#language: ru

@tree

Функциональность: 5. Дымовые тесты "Регистр накопления"

//Контекст:

Сценарий: Открытие клиента тестирования для выплат
И я подключаю TestClient "ГСЛ" логин "Администратор" пароль ""
И Я закрываю все окна клиентского приложения

Сценарий: Открытие формы списка "Выплаты" 

	Дано Я открываю основную форму списка регистра накопления "Выплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления Выплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Выплаты"

	Дано Я открываю основную форму регистра накопления "Выплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления Выплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДФЛИгроков" 

	Дано Я открываю основную форму списка регистра накопления "НДФЛИгроков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛИгроков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛИгроков"

	Дано Я открываю основную форму регистра накопления "НДФЛИгроков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛИгроков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикиВыплат" 

	Дано Я открываю основную форму списка регистра накопления "ГрафикиВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ГрафикиВыплат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикиВыплат"

	Дано Я открываю основную форму регистра накопления "ГрафикиВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ГрафикиВыплат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПоЧекамККМ" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеПоЧекамККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеПоЧекамККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПоЧекамККМ"

	Дано Я открываю основную форму регистра накопления "ДанныеПоЧекамККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеПоЧекамККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыплатыБилетовПоТиражам" 

	Дано Я открываю основную форму списка регистра накопления "ВыплатыБилетовПоТиражам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыплатыБилетовПоТиражам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатыБилетовПоТиражам"

	Дано Я открываю основную форму регистра накопления "ВыплатыБилетовПоТиражам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыплатыБилетовПоТиражам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДФЛ_ФактическиеВыплаты" 

	Дано Я открываю основную форму списка регистра накопления "НДФЛ_ФактическиеВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛ_ФактическиеВыплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛ_ФактическиеВыплаты"

	Дано Я открываю основную форму регистра накопления "НДФЛ_ФактическиеВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛ_ФактическиеВыплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДФЛ_ВыплатыБилетовПоТиражам" 

	Дано Я открываю основную форму списка регистра накопления "НДФЛ_ВыплатыБилетовПоТиражам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛ_ВыплатыБилетовПоТиражам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛ_ВыплатыБилетовПоТиражам"

	Дано Я открываю основную форму регистра накопления "НДФЛ_ВыплатыБилетовПоТиражам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛ_ВыплатыБилетовПоТиражам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСИгрокомПоНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСИгрокомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСИгрокомПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСИгрокомПоНДФЛ"

	Дано Я открываю основную форму регистра накопления "РасчетыСИгрокомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСИгрокомПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДФЛИВыплаты" 

	Дано Я открываю основную форму списка регистра накопления "НДФЛИВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛИВыплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛИВыплаты"

	Дано Я открываю основную форму регистра накопления "НДФЛИВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛИВыплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСБюджетомПоНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСБюджетомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСБюджетомПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСБюджетомПоНДФЛ"

	Дано Я открываю основную форму регистра накопления "РасчетыСБюджетомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСБюджетомПоНДФЛ"
	И Я закрываю текущее окно

И Я закрываю все окна клиентского приложения

И я закрываю сеанс текущего клиента тестирования