#language: ru

@tree

Функциональность: Дымовые тесты "Отчеты"

//Контекст:

Сценарий: Открытие клиента тестирования для выплат
И я подключаю TestClient "Клиент для выплат" логин "Администратор" пароль ""
И Я закрываю все окна клиентского приложения

Сценарий: Открытие формы объекта "АнализВерсийОбъектов"

	Дано Я открываю основную форму отчета "АнализВерсийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализВерсийОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализВзносовВФонды"

	Дано Я открываю основную форму отчета "АнализВзносовВФонды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализВзносовВФонды"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЖурналаРегистрации"

	Дано Я открываю основную форму отчета "АнализЖурналаРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЖурналаРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЗадолженностиПоЗарплате"

	Дано Я открываю основную форму отчета "АнализЗадолженностиПоЗарплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЗадолженностиПоЗарплате"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализИзмененийЛичныхДанныхСотрудников"

	Дано Я открываю основную форму отчета "АнализИзмененийЛичныхДанныхСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализИзмененийЛичныхДанныхСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализНачисленийИУдержаний"

	Дано Я открываю основную форму отчета "АнализНачисленийИУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализНачисленийИУдержаний"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализНДФЛ"

	Дано Я открываю основную форму отчета "АнализНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализНДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализОпроса"

	Дано Я открываю основную форму отчета "АнализОпроса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализОпроса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПлановыхНачислений"

	Дано Я открываю основную форму отчета "АнализПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПлановыхНачислений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализУплатыНДФЛ"

	Дано Я открываю основную форму отчета "АнализУплатыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализУплатыНДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЦелевыхПоказателейСотрудников"

	Дано Я открываю основную форму отчета "АнализЦелевыхПоказателейСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЦелевыхПоказателейСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АналитическийОтчетПоАнкетированию"

	Дано Я открываю основную форму отчета "АналитическийОтчетПоАнкетированию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АналитическийОтчетПоАнкетированию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БизнесПроцессы"

	Дано Я открываю основную форму отчета "БизнесПроцессы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БизнесПроцессы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВоинскийУчетБронирование"

	Дано Я открываю основную форму отчета "ВоинскийУчетБронирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВоинскийУчетБронирование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВоинскийУчетОбщий"

	Дано Я открываю основную форму отчета "ВоинскийУчетОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВоинскийУчетОбщий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыплатыНезарплатныхДоходов"

	Дано Я открываю основную форму отчета "ВыплатыНезарплатныхДоходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыплатыНезарплатныхДоходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГрафикОтпусков"

	Дано Я открываю основную форму отчета "ГрафикОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ГрафикОтпусков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДанныеДляОтраженияВБухучете"

	Дано Я открываю основную форму отчета "ДанныеДляОтраженияВБухучете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДанныеДляОтраженияВБухучете"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДатыЗапретаЗагрузки"

	Дано Я открываю основную форму отчета "ДатыЗапретаЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаЗагрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму отчета "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаИзменения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДинамикаПлановыхНачислений"

	Дано Я открываю основную форму отчета "ДинамикаПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДинамикаПлановыхНачислений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Договорники"

	Дано Я открываю основную форму отчета "Договорники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Договорники"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналРегистрацииИнструктажа"

	Дано Я открываю основную форму отчета "ЖурналРегистрацииИнструктажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналРегистрацииИнструктажа"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналУчетаИсполнительныхДокументов"

	Дано Я открываю основную форму отчета "ЖурналУчетаИсполнительныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналУчетаИсполнительныхДокументов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗависшиеЗадачи"

	Дано Я открываю основную форму отчета "ЗависшиеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗависшиеЗадачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Задания"

	Дано Я открываю основную форму отчета "Задания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Задания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Задачи"

	Дано Я открываю основную форму отчета "Задачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Задачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадачиИстекающиеНаДату"

	Дано Я открываю основную форму отчета "ЗадачиИстекающиеНаДату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадачиИстекающиеНаДату"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаймыСотрудникам"

	Дано Я открываю основную форму отчета "ЗаймыСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаймыСотрудникам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаявлениеДСВ1"

	Дано Я открываю основную форму отчета "ЗаявлениеДСВ1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаявлениеДСВ1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИзменениеШтатногоРасписания"

	Дано Я открываю основную форму отчета "ИзменениеШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИзменениеШтатногоРасписания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнструктажиПоОхранеТруда"

	Дано Я открываю основную форму отчета "ИнструктажиПоОхранеТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИнструктажиПоОхранеТруда"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнениеПланаОбучения"

	Дано Я открываю основную форму отчета "ИсполнениеПланаОбучения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнениеПланаОбучения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсполнительныеДокументы"

	Дано Я открываю основную форму отчета "ИсполнительныеДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсполнительныеДокументы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИспользуемыеВнешниеРесурсы"

	Дано Я открываю основную форму отчета "ИспользуемыеВнешниеРесурсы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИспользуемыеВнешниеРесурсы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КадроваяИсторияСотрудников"

	Дано Я открываю основную форму отчета "КадроваяИсторияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КадроваяИсторияСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КарточкаУчетаПоСтраховымВзносам"

	Дано Я открываю основную форму отчета "КарточкаУчетаПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КарточкаУчетаПоСтраховымВзносам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КнигаУчетаДепонентов"

	Дано Я открываю основную форму отчета "КнигаУчетаДепонентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КнигаУчетаДепонентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтактнаяИнформацияСотрудников"

	Дано Я открываю основную форму отчета "КонтактнаяИнформацияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтактнаяИнформацияСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольГрейдов"

	Дано Я открываю основную форму отчета "КонтрольГрейдов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольГрейдов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЛицевыеСчетаСотрудников"

	Дано Я открываю основную форму отчета "ЛицевыеСчетаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЛицевыеСчетаСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЛьготыСотрудников"

	Дано Я открываю основную форму отчета "ЛьготыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЛьготыСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МестаИспользованияСсылок"

	Дано Я открываю основную форму отчета "МестаИспользованияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МестаИспользованияСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НаградыСотрудников"

	Дано Я открываю основную форму отчета "НаградыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НаградыСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НалогиИВзносыКратко"

	Дано Я открываю основную форму отчета "НалогиИВзносыКратко"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НалогиИВзносыКратко"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиПрограммыЗарплатаКадры"

	Дано Я открываю основную форму отчета "НастройкиПрограммыЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НастройкиПрограммыЗарплатаКадры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НесчастныеСлучаиНаПроизводстве"

	Дано Я открываю основную форму отчета "НесчастныеСлучаиНаПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НесчастныеСлучаиНаПроизводстве"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбразованияСотрудников"

	Дано Я открываю основную форму отчета "ОбразованияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбразованияСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбъемНенужныхФайлов"

	Дано Я открываю основную форму отчета "ОбъемНенужныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбъемНенужныхФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбязательстваПоУченическимДоговорам"

	Дано Я открываю основную форму отчета "ОбязательстваПоУченическимДоговорам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбязательстваПоУченическимДоговорам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОрганизационнаяСтруктура"

	Дано Я открываю основную форму отчета "ОрганизационнаяСтруктура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОрганизационнаяСтруктура"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиОтпусков"

	Дано Я открываю основную форму отчета "ОстаткиОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиОтпусков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтчетыПоСотрудникам"

	Дано Я открываю основную форму отчета "ОтчетыПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтчетыПоСотрудникам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаПерсонала"

	Дано Я открываю основную форму отчета "ОценкаПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОценкаПерсонала"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлановыеУдержанияСотрудников"

	Дано Я открываю основную форму отчета "ПлановыеУдержанияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлановыеУдержанияСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Подработки"

	Дано Я открываю основную форму отчета "Подработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Подработки"
	И Я закрываю текущее окно



Сценарий: Открытие формы объекта "ПроверкаЦелостностиТома"

	Дано Я открываю основную форму отчета "ПроверкаЦелостностиТома"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроверкаЦелостностиТома"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрогрессОтложенногоОбновления"

	Дано Я открываю основную форму отчета "ПрогрессОтложенногоОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрогрессОтложенногоОбновления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПросроченныеЗадачи"

	Дано Я открываю основную форму отчета "ПросроченныеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПросроченныеЗадачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РабочиеМестаПодлежащиеСпециальнойОценкеУсловийТруда"

	Дано Я открываю основную форму отчета "РабочиеМестаПодлежащиеСпециальнойОценкеУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РабочиеМестаПодлежащиеСпециальнойОценкеУсловийТруда"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Расшифровка4ФСС"

	Дано Я открываю основную форму отчета "Расшифровка4ФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Расшифровка4ФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Расшифровка6НДФЛ"

	Дано Я открываю основную форму отчета "Расшифровка6НДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Расшифровка6НДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасшифровкаРСВ1"

	Дано Я открываю основную форму отчета "РасшифровкаРСВ1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасшифровкаРСВ1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегистрНалоговогоУчетаПоНДФЛ"

	Дано Я открываю основную форму отчета "РегистрНалоговогоУчетаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегистрНалоговогоУчетаПоНДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеВыборНалоговогоОргана"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеВыборНалоговогоОргана"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеВыборНалоговогоОргана"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЕНВД1"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЕНВД1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЕНВД1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЕНВД2"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЕНВД2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЕНВД2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЕНВД3"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЕНВД3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЕНВД3"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЕНВД4"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЕНВД4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЕНВД4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЗакрытиеОбособленныхПодразделений"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЗакрытиеОбособленныхПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЗакрытиеОбособленныхПодразделений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеИзменениеПараметраУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеИзменениеПараметраУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеИзменениеПараметраУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеИсключениеПроверки"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеИсключениеПроверки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеИсключениеПроверки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеОтказОтУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеОтказОтУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеОтказОтУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПереходНаУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПереходНаУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПереходНаУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПолучениеПатента"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПолучениеПатента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПолучениеПатента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПостановкаОбъектаНВОС"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПостановкаОбъектаНВОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПостановкаОбъектаНВОС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПрекращениеПатент"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПрекращениеПатент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПрекращениеПатент"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПрекращениеУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПрекращениеУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПрекращениеУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеРеорганизацияЛиквидация"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеРеорганизацияЛиквидация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеРеорганизацияЛиквидация"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеСозданиеОбособленныхПодразделений"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеСозданиеОбособленныхПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеСозданиеОбособленныхПодразделений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеСообщениеОбУчастии"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеСообщениеОбУчастии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеСообщениеОбУчастии"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеТС1"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеТС1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеТС1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеТС2"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеТС2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеТС2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУ_ИО"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУ_ИО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУ_ИО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУтратаПраваПатент"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУтратаПраваПатент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУтратаПраваПатент"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУтратаПраваУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУтратаПраваУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУтратаПраваУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУчастиеВРоссийскихОрганизациях"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУчастиеВРоссийскихОрганизациях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУчастиеВРоссийскихОрганизациях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчет4ФСС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчет4ФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчет4ФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчет6НДФЛ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчет6НДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчет6НДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРВ3"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРВ3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРВ3"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРСВ1"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРСВ1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРСВ1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСоответствиеУсловийТруда"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСоответствиеУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСоответствиеУсловийТруда"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаПрочиеФормы"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаПрочиеФормы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаПрочиеФормы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ГС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ГС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ГС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1МС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1МС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1МС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Туст"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Туст"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Туст"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2ГСГЗ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2ГСГЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2ГСГЗ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма2МС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма2МС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма2МС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма3Ф"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма3Ф"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма3Ф"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма57Т"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма57Т"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма57Т"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаЗПЗдрав"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаЗПЗдрав"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаЗПЗдрав"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаЗПКультура"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаЗПКультура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаЗПКультура"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаЗПНаука"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаЗПНаука"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаЗПНаука"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаЗПОбразование"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаЗПОбразование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаЗПОбразование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаЗПСоц"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаЗПСоц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаЗПСоц"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаМПм"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаМПм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаМПм"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП4"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаП4НЗ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаП4НЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаП4НЗ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФормаПМ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФормаПМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФормаПМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрПолучателейСтраховогоОбеспечения"

	Дано Я открываю основную форму отчета "РеестрПолучателейСтраховогоОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрПолучателейСтраховогоОбеспечения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыАттестацииСотрудников"

	Дано Я открываю основную форму отчета "РезультатыАттестацииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыАттестацииСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыОбучения"

	Дано Я открываю основную форму отчета "РезультатыОбучения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыОбучения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыСпециальнойОценкиУсловийТруда"

	Дано Я открываю основную форму отчета "РезультатыСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СведенияОбИзмененияхДляВоенкомата"

	Дано Я открываю основную форму отчета "СведенияОбИзмененияхДляВоенкомата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СведенияОбИзмененияхДляВоенкомата"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СведенияОПользователях"

	Дано Я открываю основную форму отчета "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СведенияОПользователях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанныхДействующие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхДействующие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхДействующие"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанныхИстекающие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхИстекающие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхИстекающие"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СоставКадровогоРезерва"

	Дано Я открываю основную форму отчета "СоставКадровогоРезерва"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СоставКадровогоРезерва"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СоставыСемейСотрудников"

	Дано Я открываю основную форму отчета "СоставыСемейСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СоставыСемейСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостояниеШтатногоРасписания"

	Дано Я открываю основную форму отчета "СостояниеШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостояниеШтатногоРасписания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СостоянияСотрудников"

	Дано Я открываю основную форму отчета "СостоянияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СостоянияСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СотрудникиПодлежащиеАттестации"

	Дано Я открываю основную форму отчета "СотрудникиПодлежащиеАттестации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СотрудникиПодлежащиеАттестации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаПоОтпускам"

	Дано Я открываю основную форму отчета "СправкаПоОтпускам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаПоОтпускам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СправкаРасчетРезервыОтпусков"

	Дано Я открываю основную форму отчета "СправкаРасчетРезервыОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СправкаРасчетРезервыОтпусков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СравнениеПлановыхИФактическихНачислений"

	Дано Я открываю основную форму отчета "СравнениеПлановыхИФактическихНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СравнениеПлановыхИФактическихНачислений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтажиСотрудников"

	Дано Я открываю основную форму отчета "СтажиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтажиСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтатистикаПерсонала"

	Дано Я открываю основную форму отчета "СтатистикаПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтатистикаПерсонала"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтатистикаПодбораПерсонала"

	Дано Я открываю основную форму отчета "СтатистикаПодбораПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтатистикаПодбораПерсонала"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СтраховыеВзносыПереданныеВПФР"

	Дано Я открываю основную форму отчета "СтраховыеВзносыПереданныеВПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СтраховыеВзносыПереданныеВПФР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТрудоваяДеятельностьСотрудников"

	Дано Я открываю основную форму отчета "ТрудоваяДеятельностьСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТрудоваяДеятельностьСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УниверсальныйОтчет"

	Дано Я открываю основную форму отчета "УниверсальныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УниверсальныйОтчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УнифицированнаяФормаТ13"

	Дано Я открываю основную форму отчета "УнифицированнаяФормаТ13"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УнифицированнаяФормаТ13"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФактическиеОтпускаСотрудников"

	Дано Я открываю основную форму отчета "ФактическиеОтпускаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ФактическиеОтпускаСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ШтатноеРасписание"

	Дано Я открываю основную форму отчета "ШтатноеРасписание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ШтатноеРасписание"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ШтатноеРасписаниеНачисления"

	Дано Я открываю основную форму отчета "ШтатноеРасписаниеНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ШтатноеРасписаниеНачисления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыплатыВыигрышей"

	Дано Я открываю основную форму отчета "ВыплатыВыигрышей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыплатыВыигрышей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПеречисленияНДФЛВБюджет"

	Дано Я открываю основную форму отчета "ПеречисленияНДФЛВБюджет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПеречисленияНДФЛВБюджет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НДФЛКПеречислению"

	Дано Я открываю основную форму отчета "НДФЛКПеречислению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НДФЛКПеречислению"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КорректировкиВыплатНДФЛВБюджет"

	Дано Я открываю основную форму отчета "КорректировкиВыплатНДФЛВБюджет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КорректировкиВыплатНДФЛВБюджет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НарастающийИтогНДФЛ"

	Дано Я открываю основную форму отчета "НарастающийИтогНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НарастающийИтогНДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыигрышиПоЗаявкам"

	Дано Я открываю основную форму отчета "ВыигрышиПоЗаявкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыигрышиПоЗаявкам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НДФЛ_ФактическиеВыплаты"

	Дано Я открываю основную форму отчета "НДФЛ_ФактическиеВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НДФЛ_ФактическиеВыплаты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтчетПоВыплатамВыигрышей"

	Дано Я открываю основную форму отчета "ОтчетПоВыплатамВыигрышей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтчетПоВыплатамВыигрышей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПобедителиСменившиеСтатусРезидентства"

	Дано Я открываю основную форму отчета "ПобедителиСменившиеСтатусРезидентства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПобедителиСменившиеСтатусРезидентства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НеудержанныйНДФЛ"

	Дано Я открываю основную форму отчета "НеудержанныйНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НеудержанныйНДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НДФЛПобедителейСПревышением"

	Дано Я открываю основную форму отчета "НДФЛПобедителейСПревышением"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НДФЛПобедителейСПревышением"
	И Я закрываю текущее окно

И Я закрываю все окна клиентского приложения

И я закрываю сеанс текущего клиента тестирования