#language: ru

@tree

Функциональность: Дымовые тесты "Регистр накопления"

//Контекст:

Сценарий: Открытие клиента тестирования для выплат
И я подключаю TestClient "Клиент для выплат" логин "Администратор" пароль ""
И Я закрываю все окна клиентского приложения

Сценарий: Открытие формы списка "АвансовыеПлатежиИностранцевПоНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "АвансовыеПлатежиИностранцевПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления АвансовыеПлатежиИностранцевПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыеПлатежиИностранцевПоНДФЛ"

	Дано Я открываю основную форму регистра накопления "АвансовыеПлатежиИностранцевПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления АвансовыеПлатежиИностранцевПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетНачисленияУдержанияПоКонтрагентамАкционерам" 

	Дано Я открываю основную форму списка регистра накопления "БухучетНачисленияУдержанияПоКонтрагентамАкционерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухучетНачисленияУдержанияПоКонтрагентамАкционерам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетНачисленияУдержанияПоКонтрагентамАкционерам"

	Дано Я открываю основную форму регистра накопления "БухучетНачисленияУдержанияПоКонтрагентамАкционерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухучетНачисленияУдержанияПоКонтрагентамАкционерам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетНачисленияУдержанияПоСотрудникам" 

	Дано Я открываю основную форму списка регистра накопления "БухучетНачисленияУдержанияПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухучетНачисленияУдержанияПоСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетНачисленияУдержанияПоСотрудникам"

	Дано Я открываю основную форму регистра накопления "БухучетНачисленияУдержанияПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухучетНачисленияУдержанияПоСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетНачисленияУдержанияПоСотрудникамАвансом" 

	Дано Я открываю основную форму списка регистра накопления "БухучетНачисленияУдержанияПоСотрудникамАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухучетНачисленияУдержанияПоСотрудникамАвансом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетНачисленияУдержанияПоСотрудникамАвансом"

	Дано Я открываю основную форму регистра накопления "БухучетНачисленияУдержанияПоСотрудникамАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления БухучетНачисленияУдержанияПоСотрудникамАвансом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВзаиморасчетыПоЗаймамСотрудникам" 

	Дано Я открываю основную форму списка регистра накопления "ВзаиморасчетыПоЗаймамСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВзаиморасчетыПоЗаймамСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВзаиморасчетыПоЗаймамСотрудникам"

	Дано Я открываю основную форму регистра накопления "ВзаиморасчетыПоЗаймамСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВзаиморасчетыПоЗаймамСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВзаиморасчетыСДепонентами" 

	Дано Я открываю основную форму списка регистра накопления "ВзаиморасчетыСДепонентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВзаиморасчетыСДепонентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВзаиморасчетыСДепонентами"

	Дано Я открываю основную форму регистра накопления "ВзаиморасчетыСДепонентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВзаиморасчетыСДепонентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВзаиморасчетыССотрудниками" 

	Дано Я открываю основную форму списка регистра накопления "ВзаиморасчетыССотрудниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВзаиморасчетыССотрудниками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВзаиморасчетыССотрудниками"

	Дано Я открываю основную форму регистра накопления "ВзаиморасчетыССотрудниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВзаиморасчетыССотрудниками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыплатаОтпусковЗаСчетРезерва" 

	Дано Я открываю основную форму списка регистра накопления "ВыплатаОтпусковЗаСчетРезерва"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыплатаОтпусковЗаСчетРезерва"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатаОтпусковЗаСчетРезерва"

	Дано Я открываю основную форму регистра накопления "ВыплатаОтпусковЗаСчетРезерва"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыплатаОтпусковЗаСчетРезерва"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыполненныеРаботыСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ВыполненныеРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыполненныеРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыполненныеРаботыСотрудников"

	Дано Я открываю основную форму регистра накопления "ВыполненныеРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыполненныеРаботыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВытесняемоеПлановоеВремяСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ВытесняемоеПлановоеВремяСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВытесняемоеПлановоеВремяСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВытесняемоеПлановоеВремяСотрудников"

	Дано Я открываю основную форму регистра накопления "ВытесняемоеПлановоеВремяСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВытесняемоеПлановоеВремяСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеИндивидуальныхГрафиковСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеИндивидуальныхГрафиковСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеИндивидуальныхГрафиковСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеИндивидуальныхГрафиковСотрудников"

	Дано Я открываю основную форму регистра накопления "ДанныеИндивидуальныхГрафиковСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеИндивидуальныхГрафиковСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОВремениДляРасчетаСреднегоОбщий" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеОВремениДляРасчетаСреднегоОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОВремениДляРасчетаСреднегоОбщий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОВремениДляРасчетаСреднегоОбщий"

	Дано Я открываю основную форму регистра накопления "ДанныеОВремениДляРасчетаСреднегоОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОВремениДляРасчетаСреднегоОбщий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"

	Дано Я открываю основную форму регистра накопления "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС"

	Дано Я открываю основную форму регистра накопления "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОперативногоУчетаРабочегоВремениСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеОперативногоУчетаРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОперативногоУчетаРабочегоВремениСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОперативногоУчетаРабочегоВремениСотрудников"

	Дано Я открываю основную форму регистра накопления "ДанныеОперативногоУчетаРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеОперативногоУчетаРабочегоВремениСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеСводногоУчетаРабочегоВремениСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеСводногоУчетаРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеСводногоУчетаРабочегоВремениСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеСводногоУчетаРабочегоВремениСотрудников"

	Дано Я открываю основную форму регистра накопления "ДанныеСводногоУчетаРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеСводногоУчетаРабочегоВремениСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС"

	Дано Я открываю основную форму регистра накопления "ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеТабельногоУчетаРабочегоВремениСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеТабельногоУчетаРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеТабельногоУчетаРабочегоВремениСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеТабельногоУчетаРабочегоВремениСотрудников"

	Дано Я открываю основную форму регистра накопления "ДанныеТабельногоУчетаРабочегоВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеТабельногоУчетаРабочегоВремениСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДниЧасыОтгулов" 

	Дано Я открываю основную форму списка регистра накопления "ДниЧасыОтгулов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДниЧасыОтгулов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДниЧасыОтгулов"

	Дано Я открываю основную форму регистра накопления "ДниЧасыОтгулов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДниЧасыОтгулов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗанятыеПозицииШтатногоРасписания" 

	Дано Я открываю основную форму списка регистра накопления "ЗанятыеПозицииШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗанятыеПозицииШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗанятыеПозицииШтатногоРасписания"

	Дано Я открываю основную форму регистра накопления "ЗанятыеПозицииШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗанятыеПозицииШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗарплатаКВыплате" 

	Дано Я открываю основную форму списка регистра накопления "ЗарплатаКВыплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗарплатаКВыплате"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗарплатаКВыплате"

	Дано Я открываю основную форму регистра накопления "ЗарплатаКВыплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗарплатаКВыплате"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗарплатаКВыплатеАвансом" 

	Дано Я открываю основную форму списка регистра накопления "ЗарплатаКВыплатеАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗарплатаКВыплатеАвансом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗарплатаКВыплатеАвансом"

	Дано Я открываю основную форму регистра накопления "ЗарплатаКВыплатеАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗарплатаКВыплатеАвансом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций" 

	Дано Я открываю основную форму списка регистра накопления "ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций"

	Дано Я открываю основную форму регистра накопления "ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений" 

	Дано Я открываю основную форму списка регистра накопления "ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений"

	Дано Я открываю основную форму регистра накопления "ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников" 

	Дано Я открываю основную форму списка регистра накопления "ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников"

	Дано Я открываю основную форму регистра накопления "ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИмущественныеВычетыНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "ИмущественныеВычетыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ИмущественныеВычетыНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИмущественныеВычетыНДФЛ"

	Дано Я открываю основную форму регистра накопления "ИмущественныеВычетыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ИмущественныеВычетыНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсчисленныеСтраховыеВзносы" 

	Дано Я открываю основную форму списка регистра накопления "ИсчисленныеСтраховыеВзносы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ИсчисленныеСтраховыеВзносы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсчисленныеСтраховыеВзносы"

	Дано Я открываю основную форму регистра накопления "ИсчисленныеСтраховыеВзносы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ИсчисленныеСтраховыеВзносы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияПоДоговорамГПХ" 

	Дано Я открываю основную форму списка регистра накопления "НачисленияПоДоговорамГПХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияПоДоговорамГПХ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияПоДоговорамГПХ"

	Дано Я открываю основную форму регистра накопления "НачисленияПоДоговорамГПХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияПоДоговорамГПХ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияУдержанияПоКонтрагентамАкционерам" 

	Дано Я открываю основную форму списка регистра накопления "НачисленияУдержанияПоКонтрагентамАкционерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияУдержанияПоКонтрагентамАкционерам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияУдержанияПоКонтрагентамАкционерам"

	Дано Я открываю основную форму регистра накопления "НачисленияУдержанияПоКонтрагентамАкционерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияУдержанияПоКонтрагентамАкционерам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияУдержанияПоСотрудникам" 

	Дано Я открываю основную форму списка регистра накопления "НачисленияУдержанияПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияУдержанияПоСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияУдержанияПоСотрудникам"

	Дано Я открываю основную форму регистра накопления "НачисленияУдержанияПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияУдержанияПоСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияУдержанияПоСотрудникамАвансом" 

	Дано Я открываю основную форму списка регистра накопления "НачисленияУдержанияПоСотрудникамАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияУдержанияПоСотрудникамАвансом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияУдержанияПоСотрудникамАвансом"

	Дано Я открываю основную форму регистра накопления "НачисленияУдержанияПоСотрудникамАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НачисленияУдержанияПоСотрудникамАвансом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтработанноеВремяПоСотрудникам" 

	Дано Я открываю основную форму списка регистра накопления "ОтработанноеВремяПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтработанноеВремяПоСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтработанноеВремяПоСотрудникам"

	Дано Я открываю основную форму регистра накопления "ОтработанноеВремяПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтработанноеВремяПоСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтработанноеВремяПоСотрудникамАвансом" 

	Дано Я открываю основную форму списка регистра накопления "ОтработанноеВремяПоСотрудникамАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтработанноеВремяПоСотрудникамАвансом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтработанноеВремяПоСотрудникамАвансом"

	Дано Я открываю основную форму регистра накопления "ОтработанноеВремяПоСотрудникамАвансом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтработанноеВремяПоСотрудникамАвансом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтработанноеВремяПоСотрудникамКорректировка" 

	Дано Я открываю основную форму списка регистра накопления "ОтработанноеВремяПоСотрудникамКорректировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтработанноеВремяПоСотрудникамКорректировка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтработанноеВремяПоСотрудникамКорректировка"

	Дано Я открываю основную форму регистра накопления "ОтработанноеВремяПоСотрудникамКорректировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОтработанноеВремяПоСотрудникамКорректировка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОценочныеОбязательства" 

	Дано Я открываю основную форму списка регистра накопления "ОценочныеОбязательства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОценочныеОбязательства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОценочныеОбязательства"

	Дано Я открываю основную форму регистра накопления "ОценочныеОбязательства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ОценочныеОбязательства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыУходаЗаБольнымиРодственниками" 

	Дано Я открываю основную форму списка регистра накопления "ПериодыУходаЗаБольнымиРодственниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПериодыУходаЗаБольнымиРодственниками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыУходаЗаБольнымиРодственниками"

	Дано Я открываю основную форму регистра накопления "ПериодыУходаЗаБольнымиРодственниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПериодыУходаЗаБольнымиРодственниками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПособияПоСоциальномуСтрахованию" 

	Дано Я открываю основную форму списка регистра накопления "ПособияПоСоциальномуСтрахованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПособияПоСоциальномуСтрахованию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПособияПоСоциальномуСтрахованию"

	Дано Я открываю основную форму регистра накопления "ПособияПоСоциальномуСтрахованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПособияПоСоциальномуСтрахованию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПособияПоУходуЗаРебенком" 

	Дано Я открываю основную форму списка регистра накопления "ПособияПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПособияПоУходуЗаРебенком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПособияПоУходуЗаРебенком"

	Дано Я открываю основную форму регистра накопления "ПособияПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПособияПоУходуЗаРебенком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ"

	Дано Я открываю основную форму регистра накопления "ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыНалоговыхАгентовСБюджетомПоНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыНалоговыхАгентовСБюджетомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыНалоговыхАгентовСБюджетомПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыНалоговыхАгентовСБюджетомПоНДФЛ"

	Дано Я открываю основную форму регистра накопления "РасчетыНалоговыхАгентовСБюджетомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыНалоговыхАгентовСБюджетомПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыНалогоплательщиковСБюджетомПоНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыНалогоплательщиковСБюджетомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыНалогоплательщиковСБюджетомПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыНалогоплательщиковСБюджетомПоНДФЛ"

	Дано Я открываю основную форму регистра накопления "РасчетыНалогоплательщиковСБюджетомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыНалогоплательщиковСБюджетомПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСФондамиПоСтраховымВзносам" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСФондамиПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСФондамиПоСтраховымВзносам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСФондамиПоСтраховымВзносам"

	Дано Я открываю основную форму регистра накопления "РасчетыСФондамиПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСФондамиПоСтраховымВзносам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОДоходахНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "СведенияОДоходахНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СведенияОДоходахНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОДоходахНДФЛ"

	Дано Я открываю основную форму регистра накопления "СведенияОДоходахНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СведенияОДоходахНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОДоходахСтраховыеВзносы" 

	Дано Я открываю основную форму списка регистра накопления "СведенияОДоходахСтраховыеВзносы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СведенияОДоходахСтраховыеВзносы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОДоходахСтраховыеВзносы"

	Дано Я открываю основную форму регистра накопления "СведенияОДоходахСтраховыеВзносы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СведенияОДоходахСтраховыеВзносы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтраховыеВзносыПереданныеВПФР" 

	Дано Я открываю основную форму списка регистра накопления "СтраховыеВзносыПереданныеВПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СтраховыеВзносыПереданныеВПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтраховыеВзносыПереданныеВПФР"

	Дано Я открываю основную форму регистра накопления "СтраховыеВзносыПереданныеВПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СтраховыеВзносыПереданныеВПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтраховыеВзносыПоФизическимЛицам" 

	Дано Я открываю основную форму списка регистра накопления "СтраховыеВзносыПоФизическимЛицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СтраховыеВзносыПоФизическимЛицам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтраховыеВзносыПоФизическимЛицам"

	Дано Я открываю основную форму регистра накопления "СтраховыеВзносыПоФизическимЛицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СтраховыеВзносыПоФизическимЛицам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдержанияПоИсполнительнымДокументам" 

	Дано Я открываю основную форму списка регистра накопления "УдержанияПоИсполнительнымДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УдержанияПоИсполнительнымДокументам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдержанияПоИсполнительнымДокументам"

	Дано Я открываю основную форму регистра накопления "УдержанияПоИсполнительнымДокументам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УдержанияПоИсполнительнымДокументам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УплатаНДФЛНалоговымиАгентамиКРаспределению" 

	Дано Я открываю основную форму списка регистра накопления "УплатаНДФЛНалоговымиАгентамиКРаспределению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УплатаНДФЛНалоговымиАгентамиКРаспределению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УплатаНДФЛНалоговымиАгентамиКРаспределению"

	Дано Я открываю основную форму регистра накопления "УплатаНДФЛНалоговымиАгентамиКРаспределению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления УплатаНДФЛНалоговымиАгентамиКРаспределению"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФактическиеОтпуска" 

	Дано Я открываю основную форму списка регистра накопления "ФактическиеОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ФактическиеОтпуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФактическиеОтпуска"

	Дано Я открываю основную форму регистра накопления "ФактическиеОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ФактическиеОтпуска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Выплаты" 

	Дано Я открываю основную форму списка регистра накопления "Выплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления Выплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Выплаты"

	Дано Я открываю основную форму регистра накопления "Выплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления Выплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДФЛИгроков" 

	Дано Я открываю основную форму списка регистра накопления "НДФЛИгроков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛИгроков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛИгроков"

	Дано Я открываю основную форму регистра накопления "НДФЛИгроков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛИгроков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикиВыплат" 

	Дано Я открываю основную форму списка регистра накопления "ГрафикиВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ГрафикиВыплат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикиВыплат"

	Дано Я открываю основную форму регистра накопления "ГрафикиВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ГрафикиВыплат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПоЧекамККМ" 

	Дано Я открываю основную форму списка регистра накопления "ДанныеПоЧекамККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеПоЧекамККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПоЧекамККМ"

	Дано Я открываю основную форму регистра накопления "ДанныеПоЧекамККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ДанныеПоЧекамККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыплатыБилетовПоТиражам" 

	Дано Я открываю основную форму списка регистра накопления "ВыплатыБилетовПоТиражам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыплатыБилетовПоТиражам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатыБилетовПоТиражам"

	Дано Я открываю основную форму регистра накопления "ВыплатыБилетовПоТиражам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ВыплатыБилетовПоТиражам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДФЛ_ФактическиеВыплаты" 

	Дано Я открываю основную форму списка регистра накопления "НДФЛ_ФактическиеВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛ_ФактическиеВыплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛ_ФактическиеВыплаты"

	Дано Я открываю основную форму регистра накопления "НДФЛ_ФактическиеВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛ_ФактическиеВыплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДФЛ_ВыплатыБилетовПоТиражам" 

	Дано Я открываю основную форму списка регистра накопления "НДФЛ_ВыплатыБилетовПоТиражам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛ_ВыплатыБилетовПоТиражам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛ_ВыплатыБилетовПоТиражам"

	Дано Я открываю основную форму регистра накопления "НДФЛ_ВыплатыБилетовПоТиражам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛ_ВыплатыБилетовПоТиражам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСИгрокомПоНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСИгрокомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСИгрокомПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСИгрокомПоНДФЛ"

	Дано Я открываю основную форму регистра накопления "РасчетыСИгрокомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСИгрокомПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДФЛИВыплаты" 

	Дано Я открываю основную форму списка регистра накопления "НДФЛИВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛИВыплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛИВыплаты"

	Дано Я открываю основную форму регистра накопления "НДФЛИВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления НДФЛИВыплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетыСБюджетомПоНДФЛ" 

	Дано Я открываю основную форму списка регистра накопления "РасчетыСБюджетомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСБюджетомПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетыСБюджетомПоНДФЛ"

	Дано Я открываю основную форму регистра накопления "РасчетыСБюджетомПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления РасчетыСБюджетомПоНДФЛ"
	И Я закрываю текущее окно

И Я закрываю все окна клиентского приложения

И я закрываю сеанс текущего клиента тестирования