#language: ru

@tree

Функциональность: Дымовые тесты "Справочники"

//Контекст:

Сценарий: Открытие клиента тестирования для выплат
И я подключаю TestClient "Клиент для выплат" логин "Администратор" пароль ""
И Я закрываю все окна клиентского приложения	
	
Сценарий: Открытие формы списка "WSСсылки" 

	Дано Я открываю основную форму списка справочника "WSСсылки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника WSСсылки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "WSСсылки"

	Дано Я открываю основную форму справочника "WSСсылки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника WSСсылки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БанковскиеСчетаКонтрагентов" 

	Дано Я открываю основную форму списка справочника "БанковскиеСчетаКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчетаКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БанковскиеСчетаКонтрагентов"

	Дано Я открываю основную форму справочника "БанковскиеСчетаКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчетаКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БольничныйЛистПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "БольничныйЛистПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БольничныйЛистПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БольничныйЛистПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "БольничныйЛистПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БольничныйЛистПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Вакансии" 

	Дано Я открываю основную форму списка справочника "Вакансии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Вакансии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Вакансии"

	Дано Я открываю основную форму справочника "Вакансии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Вакансии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Валюты" 

	Дано Я открываю основную форму списка справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Валюты"

	Дано Я открываю основную форму справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтчетов"
	И Я закрываю текущее окно



	


	
Сценарий: Открытие формы списка "ВерсииРасширений" 

	Дано Я открываю основную форму списка справочника "ВерсииРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииРасширений"

	Дано Я открываю основную форму справочника "ВерсииРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииФайлов" 

	Дано Я открываю основную форму списка справочника "ВерсииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииФайлов"

	Дано Я открываю основную форму справочника "ВерсииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыАттестацийСотрудников" 

	Дано Я открываю основную форму списка справочника "ВидыАттестацийСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыАттестацийСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыАттестацийСотрудников"

	Дано Я открываю основную форму справочника "ВидыАттестацийСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыАттестацийСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыВыплатБывшимСотрудникам" 

	Дано Я открываю основную форму списка справочника "ВидыВыплатБывшимСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыВыплатБывшимСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыВыплатБывшимСотрудникам"

	Дано Я открываю основную форму справочника "ВидыВыплатБывшимСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыВыплатБывшимСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыВычетовНДФЛ" 

	Дано Я открываю основную форму списка справочника "ВидыВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыВычетовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыВычетовНДФЛ"

	Дано Я открываю основную форму справочника "ВидыВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыВычетовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДоговоровАвторскогоЗаказа" 

	Дано Я открываю основную форму списка справочника "ВидыДоговоровАвторскогоЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоговоровАвторскогоЗаказа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДоговоровАвторскогоЗаказа"

	Дано Я открываю основную форму справочника "ВидыДоговоровАвторскогоЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоговоровАвторскогоЗаказа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДокументовВводДанныхДляРасчетаЗарплаты" 

	Дано Я открываю основную форму списка справочника "ВидыДокументовВводДанныхДляРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовВводДанныхДляРасчетаЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДокументовВводДанныхДляРасчетаЗарплаты"

	Дано Я открываю основную форму справочника "ВидыДокументовВводДанныхДляРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовВводДанныхДляРасчетаЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДокументовОбОбразовании" 

	Дано Я открываю основную форму списка справочника "ВидыДокументовОбОбразовании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовОбОбразовании"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДокументовОбОбразовании"

	Дано Я открываю основную форму справочника "ВидыДокументовОбОбразовании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовОбОбразовании"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДокументовФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ВидыДокументовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДокументовФизическихЛиц"

	Дано Я открываю основную форму справочника "ВидыДокументовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДоходовНДФЛ" 

	Дано Я открываю основную форму списка справочника "ВидыДоходовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоходовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДоходовНДФЛ"

	Дано Я открываю основную форму справочника "ВидыДоходовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоходовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДоходовПоСтраховымВзносам" 

	Дано Я открываю основную форму списка справочника "ВидыДоходовПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоходовПоСтраховымВзносам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДоходовПоСтраховымВзносам"

	Дано Я открываю основную форму справочника "ВидыДоходовПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоходовПоСтраховымВзносам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыИнструктажейПоОхранеТруда" 

	Дано Я открываю основную форму списка справочника "ВидыИнструктажейПоОхранеТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыИнструктажейПоОхранеТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыИнструктажейПоОхранеТруда"

	Дано Я открываю основную форму справочника "ВидыИнструктажейПоОхранеТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыИнструктажейПоОхранеТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыИспользованияРабочегоВремени" 

	Дано Я открываю основную форму списка справочника "ВидыИспользованияРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыИспользованияРабочегоВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыИспользованияРабочегоВремени"

	Дано Я открываю основную форму справочника "ВидыИспользованияРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыИспользованияРабочегоВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыКадровогоРезерва" 

	Дано Я открываю основную форму списка справочника "ВидыКадровогоРезерва"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКадровогоРезерва"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыКадровогоРезерва"

	Дано Я открываю основную форму справочника "ВидыКадровогоРезерва"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКадровогоРезерва"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Агенты" 

	Дано Я открываю основную форму списка справочника "Агенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Агенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Агенты"

	Дано Я открываю основную форму справочника "Агенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Агенты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыКонтактнойИнформации" 

	Дано Я открываю основную форму списка справочника "ВидыКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыКонтактнойИнформации"

	Дано Я открываю основную форму справочника "ВидыКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыМероприятияОбученияРазвития" 

	Дано Я открываю основную форму списка справочника "ВидыМероприятияОбученияРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыМероприятияОбученияРазвития"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыМероприятияОбученияРазвития"

	Дано Я открываю основную форму справочника "ВидыМероприятияОбученияРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыМероприятияОбученияРазвития"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "ВидыНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыНалоговыхОрганов"

	Дано Я открываю основную форму справочника "ВидыНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОбразованияФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ВидыОбразованияФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОбразованияФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОбразованияФизическихЛиц"

	Дано Я открываю основную форму справочника "ВидыОбразованияФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОбразованияФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОбщественноПолезнойДеятельностиСЗВК" 

	Дано Я открываю основную форму списка справочника "ВидыОбщественноПолезнойДеятельностиСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОбщественноПолезнойДеятельностиСЗВК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОбщественноПолезнойДеятельностиСЗВК"

	Дано Я открываю основную форму справочника "ВидыОбщественноПолезнойДеятельностиСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОбщественноПолезнойДеятельностиСЗВК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОперацийРасчетаЗарплаты" 

	Дано Я открываю основную форму списка справочника "ВидыОперацийРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОперацийРасчетаЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОперацийРасчетаЗарплаты"

	Дано Я открываю основную форму справочника "ВидыОперацийРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОперацийРасчетаЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОтправляемыхДокументов" 

	Дано Я открываю основную форму списка справочника "ВидыОтправляемыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОтправляемыхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОтправляемыхДокументов"

	Дано Я открываю основную форму справочника "ВидыОтправляемыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОтправляемыхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОтпусков" 

	Дано Я открываю основную форму списка справочника "ВидыОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОтпусков"

	Дано Я открываю основную форму справочника "ВидыОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПредоставляемыхСотрудникамСправок" 

	Дано Я открываю основную форму списка справочника "ВидыПредоставляемыхСотрудникамСправок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПредоставляемыхСотрудникамСправок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПредоставляемыхСотрудникамСправок"

	Дано Я открываю основную форму справочника "ВидыПредоставляемыхСотрудникамСправок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПредоставляемыхСотрудникамСправок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПроисшествий" 

	Дано Я открываю основную форму списка справочника "ВидыПроисшествий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПроисшествий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПроисшествий"

	Дано Я открываю основную форму справочника "ВидыПроисшествий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПроисшествий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПрочихДоходовФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ВидыПрочихДоходовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПрочихДоходовФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПрочихДоходовФизическихЛиц"

	Дано Я открываю основную форму справочника "ВидыПрочихДоходовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПрочихДоходовФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыРаботСотрудников" 

	Дано Я открываю основную форму списка справочника "ВидыРаботСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРаботСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыРаботСотрудников"

	Дано Я открываю основную форму справочника "ВидыРаботСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРаботСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыРазвивающихДействий" 

	Дано Я открываю основную форму списка справочника "ВидыРазвивающихДействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРазвивающихДействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыРазвивающихДействий"

	Дано Я открываю основную форму справочника "ВидыРазвивающихДействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРазвивающихДействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСтажа" 

	Дано Я открываю основную форму списка справочника "ВидыСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСтажа"

	Дано Я открываю основную форму справочника "ВидыСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыТарифовСтраховыхВзносов" 

	Дано Я открываю основную форму списка справочника "ВидыТарифовСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыТарифовСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыТарифовСтраховыхВзносов"

	Дано Я открываю основную форму справочника "ВидыТарифовСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыТарифовСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнешниеПользователи" 

	Дано Я открываю основную форму списка справочника "ВнешниеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнешниеПользователи"

	Дано Я открываю основную форму справочника "ВнешниеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Военкоматы" 

	Дано Я открываю основную форму списка справочника "Военкоматы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Военкоматы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Военкоматы"

	Дано Я открываю основную форму справочника "Военкоматы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Военкоматы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВозвратИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВопросыШаблонаАнкеты" 

	Дано Я открываю основную форму списка справочника "ВопросыШаблонаАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВопросыШаблонаАнкеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВопросыШаблонаАнкеты"

	Дано Я открываю основную форму справочника "ВопросыШаблонаАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВопросыШаблонаАнкеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВосстановлениеВДолжностиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВосстановлениеВДолжностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВосстановлениеВДолжностиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВосстановлениеВДолжностиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВосстановлениеВДолжностиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВосстановлениеВДолжностиПрисоединенныеФайлы"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ГрафикиРаботыСотрудников" 

	Дано Я открываю основную форму списка справочника "ГрафикиРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГрафикиРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикиРаботыСотрудников"

	Дано Я открываю основную форму справочника "ГрафикиРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГрафикиРаботыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Грейды" 

	Дано Я открываю основную форму списка справочника "Грейды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Грейды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Грейды"

	Дано Я открываю основную форму справочника "Грейды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Грейды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыВнешнихПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыВнешнихПользователей"

	Дано Я открываю основную форму справочника "ГруппыВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступа" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступа"

	Дано Я открываю основную форму справочника "ГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступаФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаФизическихЛиц"

	Дано Я открываю основную форму справочника "ГруппыДоступаФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыИсполнителейЗадач" 

	Дано Я открываю основную форму списка справочника "ГруппыИсполнителейЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыИсполнителейЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыИсполнителейЗадач"

	Дано Я открываю основную форму справочника "ГруппыИсполнителейЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыИсполнителейЗадач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыПользователей"

	Дано Я открываю основную форму справочника "ГруппыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыСотрудников" 

	Дано Я открываю основную форму списка справочника "ГруппыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыСотрудников"

	Дано Я открываю основную форму справочника "ГруппыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоверенностиНалогоплательщика" 

	Дано Я открываю основную форму списка справочника "ДоверенностиНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоверенностиНалогоплательщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоверенностиНалогоплательщика"

	Дано Я открываю основную форму справочника "ДоверенностиНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоверенностиНалогоплательщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорАвторскогоЗаказаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорАвторскогоЗаказаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорАвторскогоЗаказаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорАвторскогоЗаказаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорАвторскогоЗаказаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорАвторскогоЗаказаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорЗаймаСотрудникуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорЗаймаСотрудникуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорЗаймаСотрудникуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорЗаймаСотрудникуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорЗаймаСотрудникуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорЗаймаСотрудникуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорРаботыУслугиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ДоговорРаботыУслугиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорРаботыУслугиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорРаботыУслугиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ДоговорРаботыУслугиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорРаботыУслугиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыРеализацииПолномочийНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "ДокументыРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументыРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "Должности" 

	Дано Я открываю основную форму списка справочника "Должности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Должности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Должности"

	Дано Я открываю основную форму справочника "Должности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Должности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеОтчетыИОбработки" 

	Дано Я открываю основную форму списка справочника "ДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеОтчетыИОбработки"

	Дано Я открываю основную форму справочника "ДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗакладкиВзаимодействий" 

	Дано Я открываю основную форму списка справочника "ЗакладкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗакладкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗакладкиВзаимодействий"

	Дано Я открываю основную форму справочника "ЗакладкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗакладкиВзаимодействий"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ЗапросСправкиСотрудникомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗапросСправкиСотрудникомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапросСправкиСотрудникомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросСправкиСотрудникомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗапросСправкиСотрудникомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапросСправкиСотрудникомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗарплатныеПроекты" 

	Дано Я открываю основную форму списка справочника "ЗарплатныеПроекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗарплатныеПроекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗарплатныеПроекты"

	Дано Я открываю основную форму справочника "ЗарплатныеПроекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗарплатныеПроекты"
	И Я закрываю текущее окно

	




	
Сценарий: Открытие формы списка "ЗванияГражданскогоВоинскогоУчета" 

	Дано Я открываю основную форму списка справочника "ЗванияГражданскогоВоинскогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗванияГражданскогоВоинскогоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗванияГражданскогоВоинскогоУчета"

	Дано Я открываю основную форму справочника "ЗванияГражданскогоВоинскогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗванияГражданскогоВоинскогоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияКатегорийНовостей" 

	Дано Я открываю основную форму списка справочника "ЗначенияКатегорийНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияКатегорийНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияКатегорийНовостей"

	Дано Я открываю основную форму справочника "ЗначенияКатегорийНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияКатегорийНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектов" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСвойствОбъектов"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектовИерархия" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектовИерархия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСвойствОбъектовИерархия"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектовИерархия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовМетаданных" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовМетаданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовМетаданных"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовМетаданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовРасширений" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовРасширений"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеУсловийДоговораЗаймаСотрудникуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИндивидуальныйПланРазвития" 

	Дано Я открываю основную форму списка справочника "ИндивидуальныйПланРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИндивидуальныйПланРазвития"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндивидуальныйПланРазвития"

	Дано Я открываю основную форму справочника "ИндивидуальныйПланРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИндивидуальныйПланРазвития"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнформационныеСсылкиДляФорм" 

	Дано Я открываю основную форму списка справочника "ИнформационныеСсылкиДляФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнформационныеСсылкиДляФорм"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнформационныеСсылкиДляФорм"

	Дано Я открываю основную форму справочника "ИнформационныеСсылкиДляФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнформационныеСсылкиДляФорм"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсточникиИнформацииОКандидатах" 

	Дано Я открываю основную форму списка справочника "ИсточникиИнформацииОКандидатах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсточникиИнформацииОКандидатах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсточникиИнформацииОКандидатах"

	Дано Я открываю основную форму справочника "ИсточникиИнформацииОКандидатах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсточникиИнформацииОКандидатах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыйПереводПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КадровыйПереводПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КадровыйПереводПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыйПереводПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КадровыйПереводПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КадровыйПереводПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыйПереводСпискомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КадровыйПереводСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КадровыйПереводСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыйПереводСпискомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КадровыйПереводСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КадровыйПереводСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыйРезерв" 

	Дано Я открываю основную форму списка справочника "КадровыйРезерв"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КадровыйРезерв"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыйРезерв"

	Дано Я открываю основную форму справочника "КадровыйРезерв"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КадровыйРезерв"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Кандидаты" 

	Дано Я открываю основную форму списка справочника "Кандидаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Кандидаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Кандидаты"

	Дано Я открываю основную форму справочника "Кандидаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Кандидаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КандидатыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КандидатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КандидатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КандидатыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КандидатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КандидатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Кассы" 

	Дано Я открываю основную форму списка справочника "Кассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Кассы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Кассы"

	Дано Я открываю основную форму справочника "Кассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Кассы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторБанковРФ" 

	Дано Я открываю основную форму списка справочника "КлассификаторБанковРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанковРФ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторБанковРФ"

	Дано Я открываю основную форму справочника "КлассификаторБанковРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанковРФ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторСпециальностейПоОбразованию" 

	Дано Я открываю основную форму списка справочника "КлассификаторСпециальностейПоОбразованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторСпециальностейПоОбразованию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторСпециальностейПоОбразованию"

	Дано Я открываю основную форму справочника "КлассификаторСпециальностейПоОбразованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторСпециальностейПоОбразованию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючевыеОперации" 

	Дано Я открываю основную форму списка справочника "КлючевыеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючевыеОперации"

	Дано Я открываю основную форму справочника "КлючевыеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомандировкаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "КомандировкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомандировкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомандировкаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "КомандировкаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомандировкаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомпетенцииПерсонала" 

	Дано Я открываю основную форму списка справочника "КомпетенцииПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомпетенцииПерсонала"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомпетенцииПерсонала"

	Дано Я открываю основную форму справочника "КомпетенцииПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомпетенцииПерсонала"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомплектыОтчетностиПерсучета" 

	Дано Я открываю основную форму списка справочника "КомплектыОтчетностиПерсучета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомплектыОтчетностиПерсучета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомплектыОтчетностиПерсучета"

	Дано Я открываю основную форму справочника "КомплектыОтчетностиПерсучета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомплектыОтчетностиПерсучета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Игры" 

	Дано Я открываю основную форму списка справочника "Игры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Игры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Игры"

	Дано Я открываю основную форму справочника "Игры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Игры"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "Контрагенты" 

	Дано Я открываю основную форму списка справочника "Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Контрагенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Контрагенты"

	Дано Я открываю основную форму справочника "Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Контрагенты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КритерииОценкиПозицийШтатногоРасписания" 

	Дано Я открываю основную форму списка справочника "КритерииОценкиПозицийШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КритерииОценкиПозицийШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КритерииОценкиПозицийШтатногоРасписания"

	Дано Я открываю основную форму справочника "КритерииОценкиПозицийШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КритерииОценкиПозицийШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛентыНовостей" 

	Дано Я открываю основную форму списка справочника "ЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛентыНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛентыНовостей"

	Дано Я открываю основную форму справочника "ЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛентыНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МакетыПенсионныхДел" 

	Дано Я открываю основную форму списка справочника "МакетыПенсионныхДел"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МакетыПенсионныхДел"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МакетыПенсионныхДел"

	Дано Я открываю основную форму справочника "МакетыПенсионныхДел"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МакетыПенсионныхДел"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "МатериальнаяПомощьПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "МатериальнаяПомощьПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МатериальнаяПомощьПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МатериальнаяПомощьПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "МатериальнаяПомощьПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МатериальнаяПомощьПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МедицинскиеОрганизации" 

	Дано Я открываю основную форму списка справочника "МедицинскиеОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МедицинскиеОрганизации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МедицинскиеОрганизации"

	Дано Я открываю основную форму справочника "МедицинскиеОрганизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МедицинскиеОрганизации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МероприятияОбученияРазвития" 

	Дано Я открываю основную форму списка справочника "МероприятияОбученияРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МероприятияОбученияРазвития"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МероприятияОбученияРазвития"

	Дано Я открываю основную форму справочника "МероприятияОбученияРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МероприятияОбученияРазвития"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МероприятияОценкиПерсонала" 

	Дано Я открываю основную форму списка справочника "МероприятияОценкиПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МероприятияОценкиПерсонала"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МероприятияОценкиПерсонала"

	Дано Я открываю основную форму справочника "МероприятияОценкиПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МероприятияОценкиПерсонала"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МестаРаботы" 

	Дано Я открываю основную форму списка справочника "МестаРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МестаРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МестаРаботы"

	Дано Я открываю основную форму справочника "МестаРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МестаРаботы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыДополнительныхРеквизитовИСведений" 

	Дано Я открываю основную форму списка справочника "НаборыДополнительныхРеквизитовИСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыДополнительныхРеквизитовИСведений"

	Дано Я открываю основную форму справочника "НаборыДополнительныхРеквизитовИСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Награды" 

	Дано Я открываю основную форму списка справочника "Награды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Награды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Награды"

	Дано Я открываю основную форму справочника "Награды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Награды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НалоговыеОрганы" 

	Дано Я открываю основную форму списка справочника "НалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НалоговыеОрганы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НалоговыеОрганы"

	Дано Я открываю основную форму справочника "НалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НалоговыеОрганы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаправлениеНаВнешнююАттестациюПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НаправлениеНаВнешнююАттестациюПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправлениеНаВнешнююАттестациюПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаправлениеНаВнешнююАттестациюПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НаправлениеНаВнешнююАттестациюПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправлениеНаВнешнююАттестациюПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаправленияСдачиОтчетности" 

	Дано Я открываю основную форму списка справочника "НаправленияСдачиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияСдачиОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаправленияСдачиОтчетности"

	Дано Я открываю основную форму справочника "НаправленияСдачиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияСдачиОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменСБанками" 

	Дано Я открываю основную форму списка справочника "НастройкиОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменСБанками"

	Дано Я открываю основную форму справочника "НастройкиОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НесчастныйСлучайНаПроизводствеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "НесчастныйСлучайНаПроизводствеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НесчастныйСлучайНаПроизводствеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НесчастныйСлучайНаПроизводствеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "НесчастныйСлучайНаПроизводствеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НесчастныйСлучайНаПроизводствеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Новости" 

	Дано Я открываю основную форму списка справочника "Новости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Новости"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ОбразованиеФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ОбразованиеФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбразованиеФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбразованиеФизическихЛиц"

	Дано Я открываю основную форму справочника "ОбразованиеФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбразованиеФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеДанныеИнформационногоЦентра" 

	Дано Я открываю основную форму списка справочника "ОбщиеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеДанныеИнформационногоЦентра"

	Дано Я открываю основную форму справочника "ОбщиеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписиВходящихДокументовИзНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "ОписиВходящихДокументовИзНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписиВходящихДокументовИзНалоговыхОрганов"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ОписиИсходящихДокументовВНалоговыеОрганы" 

	Дано Я открываю основную форму списка справочника "ОписиИсходящихДокументовВНалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписиИсходящихДокументовВНалоговыеОрганы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписиИсходящихДокументовВНалоговыеОрганы"

	Дано Я открываю основную форму справочника "ОписиИсходящихДокументовВНалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписиИсходящихДокументовВНалоговыеОрганы"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОплатаПоСреднемуЗаработкуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Организации" 

	Дано Я открываю основную форму списка справочника "Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Организации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Организации"

	Дано Я открываю основную форму справочника "Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Организации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрганыПФР" 

	Дано Я открываю основную форму списка справочника "ОрганыПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганыПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганыПФР"

	Дано Я открываю основную форму справочника "ОрганыПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганыПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрганыФСГС" 

	Дано Я открываю основную форму списка справочника "ОрганыФСГС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганыФСГС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганыФСГС"

	Дано Я открываю основную форму справочника "ОрганыФСГС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганыФСГС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияДосрочногоНазначенияПенсии" 

	Дано Я открываю основную форму списка справочника "ОснованияДосрочногоНазначенияПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияДосрочногоНазначенияПенсии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияДосрочногоНазначенияПенсии"

	Дано Я открываю основную форму справочника "ОснованияДосрочногоНазначенияПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияДосрочногоНазначенияПенсии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияДосрочногоНазначенияПенсииДляСЗВК" 

	Дано Я открываю основную форму списка справочника "ОснованияДосрочногоНазначенияПенсииДляСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияДосрочногоНазначенияПенсииДляСЗВК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияДосрочногоНазначенияПенсииДляСЗВК"

	Дано Я открываю основную форму справочника "ОснованияДосрочногоНазначенияПенсииДляСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияДосрочногоНазначенияПенсииДляСЗВК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияЗаключенияСрочныхТрудовыхДоговоров" 

	Дано Я открываю основную форму списка справочника "ОснованияЗаключенияСрочныхТрудовыхДоговоров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияЗаключенияСрочныхТрудовыхДоговоров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияЗаключенияСрочныхТрудовыхДоговоров"

	Дано Я открываю основную форму справочника "ОснованияЗаключенияСрочныхТрудовыхДоговоров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияЗаключенияСрочныхТрудовыхДоговоров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияИсчисляемогоСтраховогоСтажа" 

	Дано Я открываю основную форму списка справочника "ОснованияИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияИсчисляемогоСтраховогоСтажа"

	Дано Я открываю основную форму справочника "ОснованияИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияУвольнения" 

	Дано Я открываю основную форму списка справочника "ОснованияУвольнения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияУвольнения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияУвольнения"

	Дано Я открываю основную форму справочника "ОснованияУвольнения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияУвольнения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсобыеУсловияТрудаДляСЗВКПФР" 

	Дано Я открываю основную форму списка справочника "ОсобыеУсловияТрудаДляСЗВКПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсобыеУсловияТрудаДляСЗВКПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсобыеУсловияТрудаДляСЗВКПФР"

	Дано Я открываю основную форму справочника "ОсобыеУсловияТрудаДляСЗВКПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсобыеУсловияТрудаДляСЗВКПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсобыеУсловияТрудаПФР" 

	Дано Я открываю основную форму списка справочника "ОсобыеУсловияТрудаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсобыеУсловияТрудаПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсобыеУсловияТрудаПФР"

	Дано Я открываю основную форму справочника "ОсобыеУсловияТрудаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсобыеУсловияТрудаПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаСовмещенияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтменаСовмещенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтменаСовмещенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаСовмещенияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтменаСовмещенияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтменаСовмещенияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиОтчетности" 

	Дано Я открываю основную форму списка справочника "ОтправкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиОтчетности"

	Дано Я открываю основную форму справочника "ОтправкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиРПН" 

	Дано Я открываю основную форму списка справочника "ОтправкиРПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРПН"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ОтправкиФСРАР" 

	Дано Я открываю основную форму списка справочника "ОтправкиФСРАР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФСРАР"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ОтправкиФСС" 

	Дано Я открываю основную форму списка справочника "ОтправкиФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФСС"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ОтправкиФТС" 

	Дано Я открываю основную форму списка справочника "ОтправкиФТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФТС"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ОтпускБезСохраненияОплатыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтпускБезСохраненияОплатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускБезСохраненияОплатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускБезСохраненияОплатыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтпускБезСохраненияОплатыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускБезСохраненияОплатыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускПоУходуЗаРебенкомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ОтпускПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ОтпускПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтпускПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЗаданий" 

	Дано Я открываю основную форму списка справочника "ОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЗаданий"

	Дано Я открываю основную форму справочника "ОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЗаданийОбластейДанных" 

	Дано Я открываю основную форму списка справочника "ОчередьЗаданийОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданийОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЗаданийОбластейДанных"

	Дано Я открываю основную форму справочника "ОчередьЗаданийОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданийОбластейДанных"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ПапкиФайлов" 

	Дано Я открываю основную форму списка справочника "ПапкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПапкиФайлов"

	Дано Я открываю основную форму справочника "ПапкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ПараметрыИсчисляемогоСтраховогоСтажа" 

	Дано Я открываю основную форму списка справочника "ПараметрыИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыИсчисляемогоСтраховогоСтажа"

	Дано Я открываю основную форму справочника "ПараметрыИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ПереводКДругомуРаботодателюПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПереводКДругомуРаботодателюПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереводКДругомуРаботодателюПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереводКДругомуРаботодателюПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПереводКДругомуРаботодателюПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереводКДругомуРаботодателюПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереносОтпускаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПереносОтпускаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереносОтпускаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереносОтпускаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПереносОтпускаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереносОтпускаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерепискаСКонтролирующимиОрганами" 

	Дано Я открываю основную форму списка справочника "ПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерепискаСКонтролирующимиОрганами"

	Дано Я открываю основную форму справочника "ПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереченьДолжностейДляБронированияГраждан" 

	Дано Я открываю основную форму списка справочника "ПереченьДолжностейДляБронированияГраждан"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереченьДолжностейДляБронированияГраждан"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереченьДолжностейДляБронированияГраждан"

	Дано Я открываю основную форму справочника "ПереченьДолжностейДляБронированияГраждан"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПереченьДолжностейДляБронированияГраждан"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ПодразделенияОрганизаций" 

	Дано Я открываю основную форму списка справочника "ПодразделенияОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодразделенияОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодразделенияОрганизаций"

	Дано Я открываю основную форму справочника "ПодразделенияОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодразделенияОрганизаций"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ПоказателиРасчетаЗарплаты" 

	Дано Я открываю основную форму списка справочника "ПоказателиРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоказателиРасчетаЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоказателиРасчетаЗарплаты"

	Дано Я открываю основную форму справочника "ПоказателиРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоказателиРасчетаЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПолныеПутиКФормам" 

	Дано Я открываю основную форму списка справочника "ПолныеПутиКФормам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолныеПутиКФормам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПолныеПутиКФормам"

	Дано Я открываю основную форму справочника "ПолныеПутиКФормам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолныеПутиКФормам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Пользователи" 

	Дано Я открываю основную форму списка справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Пользователи"

	Дано Я открываю основную форму справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеНастройкиОтчетов" 

	Дано Я открываю основную форму списка справочника "ПользовательскиеНастройкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеНастройкиОтчетов"

	Дано Я открываю основную форму справочника "ПользовательскиеНастройкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоследствияНесчастногоСлучая" 

	Дано Я открываю основную форму списка справочника "ПоследствияНесчастногоСлучая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоследствияНесчастногоСлучая"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоследствияНесчастногоСлучая"

	Дано Я открываю основную форму справочника "ПоследствияНесчастногоСлучая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоследствияНесчастногоСлучая"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДанные" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеДанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДанные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеДанные"

	Дано Я открываю основную форму справочника "ПоставляемыеДанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДанные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДополнительныеОтчетыИОбработки" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеДополнительныеОтчетыИОбработки"

	Дано Я открываю основную форму справочника "ПоставляемыеДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеРасширения" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеРасширения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеРасширения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеРасширения"

	Дано Я открываю основную форму справочника "ПоставляемыеРасширения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеРасширения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаИнтеграцииС1СДокументооборотом" 

	Дано Я открываю основную форму списка справочника "ПравилаИнтеграцииС1СДокументооборотом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаИнтеграцииС1СДокументооборотом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаИнтеграцииС1СДокументооборотом"

	Дано Я открываю основную форму справочника "ПравилаИнтеграцииС1СДокументооборотом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаИнтеграцииС1СДокументооборотом"
	И Я закрываю текущее окно

	




	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетов"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовРасширений" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетовРасширений"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемНаРаботуПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПриемНаРаботуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриемНаРаботуПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемНаРаботуПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПриемНаРаботуПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриемНаРаботуПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемНаРаботуСпискомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПриемНаРаботуСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриемНаРаботуСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемНаРаботуСпискомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПриемНаРаботуСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриемНаРаботуСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПризПодарокПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПризПодарокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПризПодарокПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПризПодарокПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПризПодарокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПризПодарокПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриказОбАттестацииСотрудниковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПриказОбАттестацииСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриказОбАттестацииСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриказОбАттестацииСотрудниковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПриказОбАттестацииСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПриказОбАттестацииСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныОтклоненияКандидатов" 

	Дано Я открываю основную форму списка справочника "ПричиныОтклоненияКандидатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтклоненияКандидатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныОтклоненияКандидатов"

	Дано Я открываю основную форму справочника "ПричиныОтклоненияКандидатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтклоненияКандидатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныОткрытияВакансий" 

	Дано Я открываю основную форму списка справочника "ПричиныОткрытияВакансий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОткрытияВакансий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныОткрытияВакансий"

	Дано Я открываю основную форму справочника "ПричиныОткрытияВакансий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОткрытияВакансий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныОтсутствияСотрудников" 

	Дано Я открываю основную форму списка справочника "ПричиныОтсутствияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтсутствияСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныОтсутствияСотрудников"

	Дано Я открываю основную форму справочника "ПричиныОтсутствияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтсутствияСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныПроисшествий" 

	Дано Я открываю основную форму списка справочника "ПричиныПроисшествий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныПроисшествий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныПроисшествий"

	Дано Я открываю основную форму справочника "ПричиныПроисшествий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныПроисшествий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрограммыЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрожиточныеМинимумы" 

	Дано Я открываю основную форму списка справочника "ПрожиточныеМинимумы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрожиточныеМинимумы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрожиточныеМинимумы"

	Дано Я открываю основную форму справочника "ПрожиточныеМинимумы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрожиточныеМинимумы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводственныеКалендари" 

	Дано Я открываю основную форму списка справочника "ПроизводственныеКалендари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводственныеКалендари"

	Дано Я открываю основную форму справочника "ПроизводственныеКалендари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизвольныйКадровыйПриказПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПроизвольныйКадровыйПриказПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизвольныйКадровыйПриказПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизвольныйКадровыйПриказПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПроизвольныйКадровыйПриказПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизвольныйКадровыйПриказПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПростойСотрудниковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПростойСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПростойСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПростойСотрудниковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПростойСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПростойСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПротоколОпросаУчастникаНесчастногоСлучаяПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ПротоколОпросаУчастникаНесчастногоСлучаяПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПротоколОпросаУчастникаНесчастногоСлучаяПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПротоколОпросаУчастникаНесчастногоСлучаяПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ПротоколОпросаУчастникаНесчастногоСлучаяПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПротоколОпросаУчастникаНесчастногоСлучаяПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофессииРабочих" 

	Дано Я открываю основную форму списка справочника "ПрофессииРабочих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофессииРабочих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофессииРабочих"

	Дано Я открываю основную форму справочника "ПрофессииРабочих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофессииРабочих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофилиГруппДоступа" 

	Дано Я открываю основную форму списка справочника "ПрофилиГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофилиГруппДоступа"

	Дано Я открываю основную форму справочника "ПрофилиГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофилиДолжностей" 

	Дано Я открываю основную форму списка справочника "ПрофилиДолжностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиДолжностей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофилиДолжностей"

	Дано Я открываю основную форму справочника "ПрофилиДолжностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиДолжностей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеРасходы" 

	Дано Я открываю основную форму списка справочника "ПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеРасходы"

	Дано Я открываю основную форму справочника "ПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрочиеРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РаботаВВыходныеИПраздничныеДниПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаботаСверхурочноПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РаботаСверхурочноПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РаботаСверхурочноПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаботаСверхурочноПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РаботаСверхурочноПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РаботаСверхурочноПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Работодатели" 

	Дано Я открываю основную форму списка справочника "Работодатели"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Работодатели"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Работодатели"

	Дано Я открываю основную форму справочника "Работодатели"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Работодатели"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрядыКатегорииДолжностей" 

	Дано Я открываю основную форму списка справочника "РазрядыКатегорииДолжностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РазрядыКатегорииДолжностей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрядыКатегорииДолжностей"

	Дано Я открываю основную форму справочника "РазрядыКатегорииДолжностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РазрядыКатегорииДолжностей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассылкиОтчетов" 

	Дано Я открываю основную форму списка справочника "РассылкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассылкиОтчетов"

	Дано Я открываю основную форму справочника "РассылкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацииВНалоговомОргане" 

	Дано Я открываю основную форму списка справочника "РегистрацииВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацииВНалоговомОргане"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацииВНалоговомОргане"

	Дано Я открываю основную форму справочника "РегистрацииВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацииВНалоговомОргане"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияПрочихДоходовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РегистрацияПрочихДоходовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацияПрочихДоходовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияПрочихДоходовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РегистрацияПрочихДоходовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегистрацияПрочихДоходовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегламентированныеОтчеты" 

	Дано Я открываю основную форму списка справочника "РегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегламентированныеОтчеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегламентированныеОтчеты"

	Дано Я открываю основную форму справочника "РегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РегламентированныеОтчеты"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "РезультатыАттестацииСотрудниковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "РезультатыАттестацииСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РезультатыАттестацииСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыАттестацииСотрудниковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "РезультатыАттестацииСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РезультатыАттестацииСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РешенияАттестационныхКомиссий" 

	Дано Я открываю основную форму списка справочника "РешенияАттестационныхКомиссий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РешенияАттестационныхКомиссий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РешенияАттестационныхКомиссий"

	Дано Я открываю основную форму справочника "РешенияАттестационныхКомиссий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РешенияАттестационныхКомиссий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РодственникиФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "РодственникиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РодственникиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РодственникиФизическихЛиц"

	Дано Я открываю основную форму справочника "РодственникиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РодственникиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиИсполнителей" 

	Дано Я открываю основную форму списка справочника "РолиИсполнителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиИсполнителей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиИсполнителей"

	Дано Я открываю основную форму справочника "РолиИсполнителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиИсполнителей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиРеспондентаОценкиПерсонала" 

	Дано Я открываю основную форму списка справочника "РолиРеспондентаОценкиПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиРеспондентаОценкиПерсонала"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиРеспондентаОценкиПерсонала"

	Дано Я открываю основную форму справочника "РолиРеспондентаОценкиПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиРеспондентаОценкиПерсонала"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СеансыСвязиСКонтролирующимиОрганами" 

	Дано Я открываю основную форму списка справочника "СеансыСвязиСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СеансыСвязиСКонтролирующимиОрганами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СеансыСвязиСКонтролирующимиОрганами"

	Дано Я открываю основную форму справочника "СеансыСвязиСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СеансыСвязиСКонтролирующимиОрганами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СерверыДокументооборота" 

	Дано Я открываю основную форму списка справочника "СерверыДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СерверыДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СерверыДокументооборота"

	Дано Я открываю основную форму справочника "СерверыДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СерверыДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыКлючейЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно


Сценарий: Открытие формы списка "СканированныеДокументыДляПередачиВЭлектронномВиде" 

	Дано Я открываю основную форму списка справочника "СканированныеДокументыДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СканированныеДокументыДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СканированныеДокументыДляПередачиВЭлектронномВиде"

	Дано Я открываю основную форму справочника "СканированныеДокументыДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СканированныеДокументыДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "СобытияОтправкиОтчетности" 

	Дано Я открываю основную форму списка справочника "СобытияОтправкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СобытияОтправкиОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СобытияОтправкиОтчетности"

	Дано Я открываю основную форму справочника "СобытияОтправкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СобытияОтправкиОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СовмещениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СовмещениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СовмещениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СовмещениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СовмещениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СовмещениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "СообщенияОбластейДанных" 

	Дано Я открываю основную форму списка справочника "СообщенияОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбластейДанных"
	И Я закрываю текущее окно


	
Сценарий: Открытие формы списка "СообщенияСистемы" 

	Дано Я открываю основную форму списка справочника "СообщенияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияСистемы"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "СоставыВоеннослужащих" 

	Дано Я открываю основную форму списка справочника "СоставыВоеннослужащих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоставыВоеннослужащих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставыВоеннослужащих"

	Дано Я открываю основную форму справочника "СоставыВоеннослужащих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоставыВоеннослужащих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеВБраке" 

	Дано Я открываю основную форму списка справочника "СостояниеВБраке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостояниеВБраке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеВБраке"

	Дано Я открываю основную форму справочника "СостояниеВБраке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостояниеВБраке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Сотрудники" 

	Дано Я открываю основную форму списка справочника "Сотрудники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сотрудники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Сотрудники"

	Дано Я открываю основную форму справочника "Сотрудники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сотрудники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения" 

	Дано Я открываю основную форму списка справочника "СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"

	Дано Я открываю основную форму справочника "СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособыВыплатыЗарплаты" 

	Дано Я открываю основную форму списка справочника "СпособыВыплатыЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыВыплатыЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособыВыплатыЗарплаты"

	Дано Я открываю основную форму справочника "СпособыВыплатыЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыВыплатыЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособыОкругленияПриРасчетеЗарплаты" 

	Дано Я открываю основную форму списка справочника "СпособыОкругленияПриРасчетеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОкругленияПриРасчетеЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособыОкругленияПриРасчетеЗарплаты"

	Дано Я открываю основную форму справочника "СпособыОкругленияПриРасчетеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОкругленияПриРасчетеЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпособыОтраженияЗарплатыВБухУчете" 

	Дано Я открываю основную форму списка справочника "СпособыОтраженияЗарплатыВБухУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОтраженияЗарплатыВБухУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпособыОтраженияЗарплатыВБухУчете"

	Дано Я открываю основную форму справочника "СпособыОтраженияЗарплатыВБухУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпособыОтраженияЗарплатыВБухУчете"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "СтатусыНалогоплательщиковПоНДФЛ" 

	Дано Я открываю основную форму списка справочника "СтатусыНалогоплательщиковПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатусыНалогоплательщиковПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыНалогоплательщиковПоНДФЛ"

	Дано Я открываю основную форму справочника "СтатусыНалогоплательщиковПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатусыНалогоплательщиковПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатьиРасходовЗарплата" 

	Дано Я открываю основную форму списка справочника "СтатьиРасходовЗарплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиРасходовЗарплата"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьиРасходовЗарплата"

	Дано Я открываю основную форму справочника "СтатьиРасходовЗарплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиРасходовЗарплата"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатьиФинансированияЗарплата" 

	Дано Я открываю основную форму списка справочника "СтатьиФинансированияЗарплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиФинансированияЗарплата"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьиФинансированияЗарплата"

	Дано Я открываю основную форму справочника "СтатьиФинансированияЗарплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиФинансированияЗарплата"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользователиТерминалов" 

	Дано Я открываю основную форму списка справочника "ПользователиТерминалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользователиТерминалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользователиТерминалов"

	Дано Я открываю основную форму справочника "ПользователиТерминалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользователиТерминалов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользователиТерминаловРоли" 

	Дано Я открываю основную форму списка справочника "ПользователиТерминаловРоли"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользователиТерминаловРоли"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользователиТерминаловРоли"

	Дано Я открываю основную форму справочника "ПользователиТерминаловРоли"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользователиТерминаловРоли"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтепениЗнанияЯзыка" 

	Дано Я открываю основную форму списка справочника "СтепениЗнанияЯзыка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтепениЗнанияЯзыка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтепениЗнанияЯзыка"

	Дано Я открываю основную форму справочника "СтепениЗнанияЯзыка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтепениЗнанияЯзыка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтепениРодстваФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "СтепениРодстваФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтепениРодстваФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтепениРодстваФизическихЛиц"

	Дано Я открываю основную форму справочника "СтепениРодстваФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтепениРодстваФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтраныМира" 

	Дано Я открываю основную форму списка справочника "СтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтраныМира"

	Дано Я открываю основную форму справочника "СтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы" 

	Дано Я открываю основную форму списка справочника "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"

	Дано Я открываю основную форму справочника "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтроковыеКонтактыВзаимодействий" 

	Дано Я открываю основную форму списка справочника "СтроковыеКонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтроковыеКонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтроковыеКонтактыВзаимодействий"

	Дано Я открываю основную форму справочника "СтроковыеКонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтроковыеКонтактыВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтруктураПредприятия" 

	Дано Я открываю основную форму списка справочника "СтруктураПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктураПредприятия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтруктураПредприятия"

	Дано Я открываю основную форму справочника "СтруктураПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктураПредприятия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтруктураЦелей" 

	Дано Я открываю основную форму списка справочника "СтруктураЦелей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктураЦелей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтруктураЦелей"

	Дано Я открываю основную форму справочника "СтруктураЦелей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктураЦелей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СценарииОбменовДанными" 

	Дано Я открываю основную форму списка справочника "СценарииОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СценарииОбменовДанными"

	Дано Я открываю основную форму справочника "СценарииОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТарифныеСетки" 

	Дано Я открываю основную форму списка справочника "ТарифныеСетки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТарифныеСетки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТарифныеСетки"

	Дано Я открываю основную форму справочника "ТарифныеСетки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТарифныеСетки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТарифыПлатежныхАгентов" 

	Дано Я открываю основную форму списка справочника "ТарифыПлатежныхАгентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТарифыПлатежныхАгентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТарифыПлатежныхАгентов"

	Дано Я открываю основную форму справочника "ТарифыПлатежныхАгентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТарифыПлатежныхАгентов"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ТерриториальныеУсловияПФР" 

	Дано Я открываю основную форму списка справочника "ТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриториальныеУсловияПФР"

	Дано Я открываю основную форму справочника "ТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриторииВыполненияРабот" 

	Дано Я открываю основную форму списка справочника "ТерриторииВыполненияРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриторииВыполненияРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриторииВыполненияРабот"

	Дано Я открываю основную форму справочника "ТерриторииВыполненияРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриторииВыполненияРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыИнформацииИнформационногоЦентра" 

	Дано Я открываю основную форму списка справочника "ТипыИнформацииИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыИнформацииИнформационногоЦентра"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыИнформацииИнформационногоЦентра"

	Дано Я открываю основную форму справочника "ТипыИнформацииИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыИнформацииИнформационногоЦентра"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТомаХраненияФайлов" 

	Дано Я открываю основную форму списка справочника "ТомаХраненияФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТомаХраненияФайлов"

	Дано Я открываю основную форму справочника "ТомаХраненияФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "УвольнениеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УвольнениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УвольнениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УвольнениеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УвольнениеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УвольнениеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УвольнениеСпискомПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УвольнениеСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УвольнениеСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УвольнениеСпискомПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УвольнениеСпискомПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УвольнениеСпискомПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьБанки" 

	Дано Я открываю основную форму списка справочника "УдалитьБанки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьБанки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьБанки"

	Дано Я открываю основную форму справочника "УдалитьБанки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьБанки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыВычетовНДФЛ" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыВычетовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыВычетовНДФЛ"

	Дано Я открываю основную форму справочника "УдалитьВидыВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыВычетовНДФЛ"
	И Я закрываю текущее окно

	




	
Сценарий: Открытие формы списка "УдалитьВидыДоходовПоСтраховымВзносам" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыДоходовПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыДоходовПоСтраховымВзносам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыДоходовПоСтраховымВзносам"

	Дано Я открываю основную форму справочника "УдалитьВидыДоходовПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыДоходовПоСтраховымВзносам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыНалоговыхОрганов"

	Дано Я открываю основную форму справочника "УдалитьВидыНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыОбщественноПолезнойДеятельностиСЗВК" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыОбщественноПолезнойДеятельностиСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОбщественноПолезнойДеятельностиСЗВК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыОбщественноПолезнойДеятельностиСЗВК"

	Дано Я открываю основную форму справочника "УдалитьВидыОбщественноПолезнойДеятельностиСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОбщественноПолезнойДеятельностиСЗВК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыОтправляемыхДокументов" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыОтправляемыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОтправляемыхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыОтправляемыхДокументов"

	Дано Я открываю основную форму справочника "УдалитьВидыОтправляемыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОтправляемыхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыТарифовСтраховыхВзносов" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыТарифовСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыТарифовСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыТарифовСтраховыхВзносов"

	Дано Я открываю основную форму справочника "УдалитьВидыТарифовСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыТарифовСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьДокументыРеализацииПолномочийНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"

	Дано Я открываю основную форму справочника "УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьКомплектыВедомостейНаВыплатуЗарплатыЧерезБанк" 

	Дано Я открываю основную форму списка справочника "УдалитьКомплектыВедомостейНаВыплатуЗарплатыЧерезБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьКомплектыВедомостейНаВыплатуЗарплатыЧерезБанк"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьКомплектыВедомостейНаВыплатуЗарплатыЧерезБанк"

	Дано Я открываю основную форму справочника "УдалитьКомплектыВедомостейНаВыплатуЗарплатыЧерезБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьКомплектыВедомостейНаВыплатуЗарплатыЧерезБанк"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНалоговыеОрганы" 

	Дано Я открываю основную форму списка справочника "УдалитьНалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьНалоговыеОрганы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНалоговыеОрганы"

	Дано Я открываю основную форму справочника "УдалитьНалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьНалоговыеОрганы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОрганыПФР" 

	Дано Я открываю основную форму списка справочника "УдалитьОрганыПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОрганыПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОрганыПФР"

	Дано Я открываю основную форму справочника "УдалитьОрганыПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОрганыПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОснованияДосрочногоНазначенияПенсии" 

	Дано Я открываю основную форму списка справочника "УдалитьОснованияДосрочногоНазначенияПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияДосрочногоНазначенияПенсии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОснованияДосрочногоНазначенияПенсии"

	Дано Я открываю основную форму справочника "УдалитьОснованияДосрочногоНазначенияПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияДосрочногоНазначенияПенсии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОснованияДосрочногоНазначенияПенсииДляСЗВК" 

	Дано Я открываю основную форму списка справочника "УдалитьОснованияДосрочногоНазначенияПенсииДляСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияДосрочногоНазначенияПенсииДляСЗВК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОснованияДосрочногоНазначенияПенсииДляСЗВК"

	Дано Я открываю основную форму справочника "УдалитьОснованияДосрочногоНазначенияПенсииДляСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияДосрочногоНазначенияПенсииДляСЗВК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОснованияИсчисляемогоСтраховогоСтажа" 

	Дано Я открываю основную форму списка справочника "УдалитьОснованияИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОснованияИсчисляемогоСтраховогоСтажа"

	Дано Я открываю основную форму справочника "УдалитьОснованияИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОснованияУвольнения" 

	Дано Я открываю основную форму списка справочника "УдалитьОснованияУвольнения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияУвольнения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОснованияУвольнения"

	Дано Я открываю основную форму справочника "УдалитьОснованияУвольнения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОснованияУвольнения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОсобыеУсловияТрудаДляСЗВКПФР" 

	Дано Я открываю основную форму списка справочника "УдалитьОсобыеУсловияТрудаДляСЗВКПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОсобыеУсловияТрудаДляСЗВКПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОсобыеУсловияТрудаДляСЗВКПФР"

	Дано Я открываю основную форму справочника "УдалитьОсобыеУсловияТрудаДляСЗВКПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОсобыеУсловияТрудаДляСЗВКПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОсобыеУсловияТрудаПФР" 

	Дано Я открываю основную форму списка справочника "УдалитьОсобыеУсловияТрудаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОсобыеУсловияТрудаПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОсобыеУсловияТрудаПФР"

	Дано Я открываю основную форму справочника "УдалитьОсобыеУсловияТрудаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОсобыеУсловияТрудаПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОтправкиФСС" 

	Дано Я открываю основную форму списка справочника "УдалитьОтправкиФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОтправкиФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОтправкиФСС"

	Дано Я открываю основную форму справочника "УдалитьОтправкиФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОтправкиФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПараметрыИсчисляемогоСтраховогоСтажа" 

	Дано Я открываю основную форму списка справочника "УдалитьПараметрыИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПараметрыИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПараметрыИсчисляемогоСтраховогоСтажа"

	Дано Я открываю основную форму справочника "УдалитьПараметрыИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПараметрыИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПерепискаСКонтролирующимиОрганами" 

	Дано Я открываю основную форму списка справочника "УдалитьПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПерепискаСКонтролирующимиОрганами"

	Дано Я открываю основную форму справочника "УдалитьПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРегламентированныеОтчеты" 

	Дано Я открываю основную форму списка справочника "УдалитьРегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьРегламентированныеОтчеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРегламентированныеОтчеты"

	Дано Я открываю основную форму справочника "УдалитьРегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьРегламентированныеОтчеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСерверыДокументооборота" 

	Дано Я открываю основную форму списка справочника "УдалитьСерверыДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСерверыДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСерверыДокументооборота"

	Дано Я открываю основную форму справочника "УдалитьСерверыДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСерверыДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСтатусыНалогоплательщиковПоНДФЛ" 

	Дано Я открываю основную форму списка справочника "УдалитьСтатусыНалогоплательщиковПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСтатусыНалогоплательщиковПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСтатусыНалогоплательщиковПоНДФЛ"

	Дано Я открываю основную форму справочника "УдалитьСтатусыНалогоплательщиковПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСтатусыНалогоплательщиковПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьТерриториальныеУсловияПФР" 

	Дано Я открываю основную форму списка справочника "УдалитьТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьТерриториальныеУсловияПФР"

	Дано Я открываю основную форму справочника "УдалитьТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьУчетныеЗаписиДокументооборота" 

	Дано Я открываю основную форму списка справочника "УдалитьУчетныеЗаписиДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьУчетныеЗаписиДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьУчетныеЗаписиДокументооборота"

	Дано Я открываю основную форму справочника "УдалитьУчетныеЗаписиДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьУчетныеЗаписиДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЭлектронныеПредставленияРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка справочника "УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"

	Дано Я открываю основную форму справочника "УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УровниКомпетенцийПерсонала" 

	Дано Я открываю основную форму списка справочника "УровниКомпетенцийПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УровниКомпетенцийПерсонала"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УровниКомпетенцийПерсонала"

	Дано Я открываю основную форму справочника "УровниКомпетенцийПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УровниКомпетенцийПерсонала"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УровниЦелевыхПоказателей" 

	Дано Я открываю основную форму списка справочника "УровниЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УровниЦелевыхПоказателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УровниЦелевыхПоказателей"

	Дано Я открываю основную форму справочника "УровниЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УровниЦелевыхПоказателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияТруда" 

	Дано Я открываю основную форму списка справочника "УсловияТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияТруда"

	Дано Я открываю основную форму справочника "УсловияТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчебныеЗаведения" 

	Дано Я открываю основную форму списка справочника "УчебныеЗаведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчебныеЗаведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчебныеЗаведения"

	Дано Я открываю основную форму справочника "УчебныеЗаведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчебныеЗаведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УченическийДоговорПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "УченическийДоговорПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УченическийДоговорПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УченическийДоговорПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "УченическийДоговорПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УченическийДоговорПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УченыеЗвания" 

	Дано Я открываю основную форму списка справочника "УченыеЗвания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УченыеЗвания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УченыеЗвания"

	Дано Я открываю основную форму справочника "УченыеЗвания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УченыеЗвания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УченыеСтепени" 

	Дано Я открываю основную форму списка справочника "УченыеСтепени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УченыеСтепени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УченыеСтепени"

	Дано Я открываю основную форму справочника "УченыеСтепени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УченыеСтепени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиДокументооборота" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиДокументооборота"

	Дано Я открываю основную форму справочника "УчетныеЗаписиДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиСинхронизацииФайлов"

	Дано Я открываю основную форму справочника "УчетныеЗаписиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиЭлектроннойПочты" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиЭлектроннойПочты"

	Дано Я открываю основную форму справочника "УчетныеЗаписиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Файлы" 

	Дано Я открываю основную форму списка справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Файлы"

	Дано Я открываю основную форму справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФизическиеЛица" 

	Дано Я открываю основную форму списка справочника "ФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФизическиеЛица"

	Дано Я открываю основную форму справочника "ФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФизическиеЛицаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ФизическиеЛицаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛицаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФизическиеЛицаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ФизическиеЛицаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛицаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦиклыОбмена" 

	Дано Я открываю основную форму списка справочника "ЦиклыОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦиклыОбмена"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ШаблоныАнкет" 

	Дано Я открываю основную форму списка справочника "ШаблоныАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныАнкет"

	Дано Я открываю основную форму справочника "ШаблоныАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныЗаданийОчереди" 

	Дано Я открываю основную форму списка справочника "ШаблоныЗаданийОчереди"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаданийОчереди"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныЗаданийОчереди"

	Дано Я открываю основную форму справочника "ШаблоныЗаданийОчереди"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаданийОчереди"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныПроизвольныхКадровыхПриказов" 

	Дано Я открываю основную форму списка справочника "ШаблоныПроизвольныхКадровыхПриказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныПроизвольныхКадровыхПриказов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныПроизвольныхКадровыхПриказов"

	Дано Я открываю основную форму справочника "ШаблоныПроизвольныхКадровыхПриказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныПроизвольныхКадровыхПриказов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныСообщений" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныСообщений"

	Дано Я открываю основную форму справочника "ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныСообщенийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщенийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщенийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныСообщенийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ШаблоныСообщенийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщенийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШтатноеРасписание" 

	Дано Я открываю основную форму списка справочника "ШтатноеРасписание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШтатноеРасписание"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШтатноеРасписание"

	Дано Я открываю основную форму справочника "ШтатноеРасписание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШтатноеРасписание"
	И Я закрываю текущее окно



	


	
Сценарий: Открытие формы списка "КонтактныеЛица" 

	Дано Я открываю основную форму списка справочника "КонтактныеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КонтактныеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтактныеЛица"

	Дано Я открываю основную форму справочника "КонтактныеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КонтактныеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Игроки" 

	Дано Я открываю основную форму списка справочника "Игроки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Игроки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Игроки"

	Дано Я открываю основную форму справочника "Игроки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Игроки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронныеПредставленияРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка справочника "ЭлектронныеПредставленияРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронныеПредставленияРегламентированныхОтчетов"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ЭтапыРаботыСКандидатами" 

	Дано Я открываю основную форму списка справочника "ЭтапыРаботыСКандидатами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапыРаботыСКандидатами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭтапыРаботыСКандидатами"

	Дано Я открываю основную форму справочника "ЭтапыРаботыСКандидатами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапыРаботыСКандидатами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЯзыкиНародовМира" 

	Дано Я открываю основную форму списка справочника "ЯзыкиНародовМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЯзыкиНародовМира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЯзыкиНародовМира"

	Дано Я открываю основную форму справочника "ЯзыкиНародовМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЯзыкиНародовМира"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Тиражи" 

	Дано Я открываю основную форму списка справочника "Тиражи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Тиражи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Тиражи"

	Дано Я открываю основную форму справочника "Тиражи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Тиражи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписаниеОшибокПротоколаPOS" 

	Дано Я открываю основную форму списка справочника "ОписаниеОшибокПротоколаPOS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписаниеОшибокПротоколаPOS"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписаниеОшибокПротоколаPOS"

	Дано Я открываю основную форму справочника "ОписаниеОшибокПротоколаPOS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписаниеОшибокПротоколаPOS"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НепроданныеБилетыМЛ" 

	Дано Я открываю основную форму списка справочника "НепроданныеБилетыМЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НепроданныеБилетыМЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НепроданныеБилетыМЛ"

	Дано Я открываю основную форму справочника "НепроданныеБилетыМЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НепроданныеБилетыМЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Терминалы" 

	Дано Я открываю основную форму списка справочника "Терминалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Терминалы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Терминалы"

	Дано Я открываю основную форму справочника "Терминалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Терминалы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиАлгоритмов" 

	Дано Я открываю основную форму списка справочника "НастройкиАлгоритмов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиАлгоритмов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиАлгоритмов"

	Дано Я открываю основную форму справочника "НастройкиАлгоритмов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиАлгоритмов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДрайверыОборудования" 

	Дано Я открываю основную форму списка справочника "ДрайверыОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДрайверыОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДрайверыОборудования"

	Дано Я открываю основную форму справочника "ДрайверыОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДрайверыОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЭлектронныхЧековКОтправке" 

	Дано Я открываю основную форму списка справочника "ОчередьЭлектронныхЧековКОтправке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЭлектронныхЧековКОтправке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЭлектронныхЧековКОтправке"

	Дано Я открываю основную форму справочника "ОчередьЭлектронныхЧековКОтправке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЭлектронныхЧековКОтправке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодключаемоеОборудование" 

	Дано Я открываю основную форму списка справочника "ПодключаемоеОборудование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодключаемоеОборудование"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодключаемоеОборудование"

	Дано Я открываю основную форму справочника "ПодключаемоеОборудование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодключаемоеОборудование"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеМеста" 

	Дано Я открываю основную форму списка справочника "РабочиеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеМеста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеМеста"

	Дано Я открываю основную форму справочника "РабочиеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеМеста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныМагнитныхКарт" 

	Дано Я открываю основную форму списка справочника "ШаблоныМагнитныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныМагнитныхКарт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныМагнитныхКарт"

	Дано Я открываю основную форму справочника "ШаблоныМагнитныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныМагнитныхКарт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОповещенийЭП" 

	Дано Я открываю основную форму списка справочника "ВариантыОповещенийЭП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОповещенийЭП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыОповещенийЭП"

	Дано Я открываю основную форму справочника "ВариантыОповещенийЭП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОповещенийЭП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтепениРодстваПДЛ" 

	Дано Я открываю основную форму списка справочника "СтепениРодстваПДЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтепениРодстваПДЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтепениРодстваПДЛ"

	Дано Я открываю основную форму справочника "СтепениРодстваПДЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтепениРодстваПДЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УровниИОбоснованияРискаПДЛ" 

	Дано Я открываю основную форму списка справочника "УровниИОбоснованияРискаПДЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УровниИОбоснованияРискаПДЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УровниИОбоснованияРискаПДЛ"

	Дано Я открываю основную форму справочника "УровниИОбоснованияРискаПДЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УровниИОбоснованияРискаПДЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "HTTPСервисы" 

	Дано Я открываю основную форму списка справочника "HTTPСервисы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника HTTPСервисы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "HTTPСервисы"

	Дано Я открываю основную форму справочника "HTTPСервисы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника HTTPСервисы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПолучателиРассылок" 

	Дано Я открываю основную форму списка справочника "ПолучателиРассылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолучателиРассылок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПолучателиРассылок"

	Дано Я открываю основную форму справочника "ПолучателиРассылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолучателиРассылок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправителиРассылок" 

	Дано Я открываю основную форму списка справочника "ОтправителиРассылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправителиРассылок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправителиРассылок"

	Дано Я открываю основную форму справочника "ОтправителиРассылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправителиРассылок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииПолучателейРассылок" 

	Дано Я открываю основную форму списка справочника "КатегорииПолучателейРассылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииПолучателейРассылок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииПолучателейРассылок"

	Дано Я открываю основную форму справочника "КатегорииПолучателейРассылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииПолучателейРассылок"
	И Я закрываю текущее окно

	
И Я закрываю все окна клиентского приложения

И я закрываю сеанс текущего клиента тестирования




