#language: ru

@tree

Функционал: <4. Создание банковского счета у участника>

Сценарий: Открытие клиента тестирования для выплат
И я подключаю TestClient "ГСЛ" логин "Администратор" пароль ""
И Я закрываю все окна клиентского приложения

Сценарий: <Изменение банковского счета участника>
И В командном интерфейсе я выбираю 'АРМ' 'АРМ выплат'
Когда открылось окно 'АРМ выплат'
И из выпадающего списка с именем "Игрок" я выбираю по строке 'Участник Для Автотестов Не Трогать Руками'
И я перехожу к следующему реквизиту
Когда открылось окно 'АРМ выплат'
И я нажимаю кнопку выбора у поля с именем "БанковскийСчет"
Тогда открылось окно 'Банковские счета контрагентов'

Когда открылось окно 'Банковские счета контрагентов'
И я нажимаю на кнопку с именем 'ФормаСоздать'
Когда открылось окно 'Банковский счет контрагента (создание)'
И в поле 'Номер счета' я ввожу текст '77777777777777777777'
И в поле с именем 'БИКБанка' я ввожу текст '044525225'
И я перехожу к закладке с именем "СтраницаБанк"
И я нажимаю на кнопку 'Найти банк по БИК'
И я нажимаю на кнопку 'Записать и закрыть'
И я жду закрытия окна 'Банковский счет контрагента (создание) *' в течение 20 секунд
Тогда открылось окно 'Банковские счета контрагентов'
И я нажимаю на кнопку с именем 'ФормаНайти'
Тогда открылось окно 'Найти'
И из выпадающего списка "&Где искать" я выбираю точное значение 'Номер счета'
И в поле '&Что искать' я ввожу текст '77777777777777777777'
И я нажимаю на кнопку '&Найти'
Тогда открылось окно 'Банковские счета контрагентов'
И я нажимаю на кнопку 'Удалить'
Тогда открылось окно '1С:Предприятие'
И я нажимаю на кнопку 'Да'
Тогда открылось окно 'Банковские счета контрагентов'
И Я закрываю окно 'Банковские счета контрагентов'

И Я закрываю все окна клиентского приложения
И я закрываю сеанс текущего клиента тестирования