#language: ru

@tree

Функциональность: Дымовые тесты "Регистр сведений"

//Контекст:
	
Сценарий: Открытие клиента тестирования для выплат
И я подключаю TestClient "ТКЦ2" логин "Тестировщик" пароль ""
И Я закрываю все окна клиентского приложения
	
Сценарий: Открытие формы списка "АдресныеОбъекты" 

	Дано Я открываю основную форму списка регистра сведений "АдресныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресныеОбъекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "БезопасноеХранилищеДанных" 

	Дано Я открываю основную форму списка регистра сведений "БезопасноеХранилищеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "БезопасноеХранилищеДанныхОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "БезопасноеХранилищеДанныхОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанныхОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БезопасноеХранилищеДанныхОбластейДанных"

	Дано Я открываю основную форму регистра сведений "БезопасноеХранилищеДанныхОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанныхОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "БлокировкиСеансовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "БлокировкиСеансовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСеансовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БлокировкиСеансовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "БлокировкиСеансовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСеансовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ВерсииОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииОбъектов"

	Дано Я открываю основную форму регистра сведений "ВерсииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ВерсииПодсистем" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ВерсииПодсистемОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииПодсистемОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистемОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииПодсистемОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ВерсииПодсистемОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистемОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ГруппыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "ГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗначенийДоступа"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "ДанныеБизнесПроцессов" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеБизнесПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеБизнесПроцессов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеБизнесПроцессов"

	Дано Я открываю основную форму регистра сведений "ДанныеБизнесПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеБизнесПроцессов"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "ДанныеОбработанныеВЦентральномУзлеРИБ" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбработанныеВЦентральномУзлеРИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбработанныеВЦентральномУзлеРИБ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбработанныеВЦентральномУзлеРИБ"

	Дано Я открываю основную форму регистра сведений "ДанныеОбработанныеВЦентральномУзлеРИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбработанныеВЦентральномУзлеРИБ"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ДанныеОбъектовДляРегистрацииВОбменах" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбъектовДляРегистрацииВОбменах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбъектовДляРегистрацииВОбменах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбъектовДляРегистрацииВОбменах"

	Дано Я открываю основную форму регистра сведений "ДанныеОбъектовДляРегистрацииВОбменах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбъектовДляРегистрацииВОбменах"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ДанныеПроизводственногоКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПроизводственногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ДатыЗапретаИзменения" 

	Дано Я открываю основную форму списка регистра сведений "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаИзменения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму регистра сведений "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаИзменения"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ДатыПоследнейЗагрузкиПочтовыхСообщений" 

	Дано Я открываю основную форму списка регистра сведений "ДатыПоследнейЗагрузкиПочтовыхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоследнейЗагрузкиПочтовыхСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыПоследнейЗагрузкиПочтовыхСообщений"

	Дано Я открываю основную форму регистра сведений "ДатыПоследнейЗагрузкиПочтовыхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоследнейЗагрузкиПочтовыхСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ДвоичныеДанныеФайлов" 

	Дано Я открываю основную форму списка регистра сведений "ДвоичныеДанныеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДвоичныеДанныеФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвоичныеДанныеФайлов"

	Дано Я открываю основную форму регистра сведений "ДвоичныеДанныеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДвоичныеДанныеФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ДомаЗданияСтроения" 

	Дано Я открываю основную форму списка регистра сведений "ДомаЗданияСтроения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДомаЗданияСтроения"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ДополнительныеАдресныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеАдресныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ДополнительныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеСведения"

	Дано Я открываю основную форму регистра сведений "ДополнительныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ЗаблокированныеДляПолученияУчетныеЗаписи" 

	Дано Я открываю основную форму списка регистра сведений "ЗаблокированныеДляПолученияУчетныеЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаблокированныеДляПолученияУчетныеЗаписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаблокированныеДляПолученияУчетныеЗаписи"

	Дано Я открываю основную форму регистра сведений "ЗаблокированныеДляПолученияУчетныеЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаблокированныеДляПолученияУчетныеЗаписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ЗависимостиПравДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ЗависимостиПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиПравДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ЗагруженныеВерсииАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "ЗагруженныеВерсииАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗагруженныеВерсииАдресныхСведений"
	И Я закрываю текущее окно



Сценарий: Открытие формы списка "ЗначенияГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ЗначенияГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ЗначенияГруппДоступаПоУмолчанию" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияГруппДоступаПоУмолчанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступаПоУмолчанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияГруппДоступаПоУмолчанию"

	Дано Я открываю основную форму регистра сведений "ЗначенияГруппДоступаПоУмолчанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступаПоУмолчанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ИдентификаторыОбъектовВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыОбъектовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыОбъектовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыОбъектовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыОбъектовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ИдентификаторыПолученныхЭлектронныхПисем" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыПолученныхЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыПолученныхЭлектронныхПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыПолученныхЭлектронныхПисем"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыПолученныхЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыПолученныхЭлектронныхПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ИзмененияОбщихДанныхУзлов" 

	Дано Я открываю основную форму списка регистра сведений "ИзмененияОбщихДанныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияОбщихДанныхУзлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзмененияОбщихДанныхУзлов"

	Дано Я открываю основную форму регистра сведений "ИзмененияОбщихДанныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияОбщихДанныхУзлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ИсполнителиЗадач" 

	Дано Я открываю основную форму списка регистра сведений "ИсполнителиЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсполнителиЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсполнителиЗадач"

	Дано Я открываю основную форму регистра сведений "ИсполнителиЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсполнителиЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"

	Дано Я открываю основную форму регистра сведений "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"

	Дано Я открываю основную форму регистра сведений "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ИсторияАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияАдресныхОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КодировкиФайлов"

	Дано Я открываю основную форму регистра сведений "КодировкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодировкиФайлов"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "КонтактыВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "КонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтактыВзаимодействий"

	Дано Я открываю основную форму регистра сведений "КонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "КурсыВалют" 

	Дано Я открываю основную форму списка регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КурсыВалют"

	Дано Я открываю основную форму регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "НаборыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "НаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаборыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "НаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаборыЗначенийДоступа"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "НазначениеДополнительныхОбработок" 

	Дано Я открываю основную форму списка регистра сведений "НазначениеДополнительныхОбработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НазначениеДополнительныхОбработок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеДополнительныхОбработок"

	Дано Я открываю основную форму регистра сведений "НазначениеДополнительныхОбработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НазначениеДополнительныхОбработок"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НаличиеФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НаличиеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаличиеФайлов"

	Дано Я открываю основную форму регистра сведений "НаличиеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НапоминанияПользователя" 

	Дано Я открываю основную форму списка регистра сведений "НапоминанияПользователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НапоминанияПользователя"

	Дано Я открываю основную форму регистра сведений "НапоминанияПользователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователя"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НаследованиеНастроекПравОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НаследованиеНастроекПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаследованиеНастроекПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаследованиеНастроекПравОбъектов"

	Дано Я открываю основную форму регистра сведений "НаследованиеНастроекПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаследованиеНастроекПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НастройкиВариантовОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВариантовОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВариантовОтчетов"

	Дано Я открываю основную форму регистра сведений "НастройкиВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВариантовОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НастройкиВерсионированияОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВерсионированияОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НастройкиКомандПечати" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиКомандПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКомандПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиКомандПечати"

	Дано Я открываю основную форму регистра сведений "НастройкиКомандПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКомандПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОчисткиФайлов"

	Дано Я открываю основную форму регистра сведений "НастройкиОчисткиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОчисткиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НастройкиПравОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПравОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НастройкиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСинхронизацииФайлов"

	Дано Я открываю основную форму регистра сведений "НастройкиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НастройкиТранспортаОбменаОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаОбластиДанных"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НастройкиУчетныхЗаписейЭлектроннойПочты" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетныхЗаписейЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхЗаписейЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетныхЗаписейЭлектроннойПочты"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетныхЗаписейЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхЗаписейЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма" 

	Дано Я открываю основную форму списка регистра сведений "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"

	Дано Я открываю основную форму регистра сведений "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НомераОтсканированныхФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НомераОтсканированныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераОтсканированныхФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НомераОтсканированныхФайлов"

	Дано Я открываю основную форму регистра сведений "НомераОтсканированныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераОтсканированныхФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НумерацияЧековККТ" 

	Дано Я открываю основную форму списка регистра сведений "НумерацияЧековККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НумерацияЧековККТ"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ОбластиПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ОбработчикиОбновления" 

	Дано Я открываю основную форму списка регистра сведений "ОбработчикиОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиОбновления"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ОбработчикиСобытийСинхронизацииДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбработчикиСобытийСинхронизацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиСобытийСинхронизацииДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбработчикиСобытийСинхронизацииДанных"

	Дано Я открываю основную форму регистра сведений "ОбработчикиСобытийСинхронизацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиСобытийСинхронизацииДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ОбщиеНастройкиУзловИнформационныхБаз" 

	Дано Я открываю основную форму списка регистра сведений "ОбщиеНастройкиУзловИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеНастройкиУзловИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеНастройкиУзловИнформационныхБаз"

	Дано Я открываю основную форму регистра сведений "ОбщиеНастройкиУзловИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеНастройкиУзловИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ОбщиеПоставляемыеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ОбщиеПоставляемыеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеПоставляемыеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветыНаВопросыАнкет"

	Дано Я открываю основную форму регистра сведений "ОтветыНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаВопросыАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ОчередьИзвлеченияТекста" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИзвлеченияТекста"

	Дано Я открываю основную форму регистра сведений "ОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ОчередьСообщенийОбменаСОфлайнОборудованием" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСообщенийОбменаСОфлайнОборудованием"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийОбменаСОфлайнОборудованием"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ПакетыИнформацииПриЗапуске" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыИнформацииПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыИнформацииПриЗапуске"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ПараметрыРаботыВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыРаботыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыРаботыВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ПараметрыРаботыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ПериодыНерабочихДнейКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ПериодыНерабочихДнейКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыНерабочихДнейКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ПользовательскиеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ПользовательскиеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеМакетыПечати"

	Дано Я открываю основную форму регистра сведений "ПользовательскиеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ПользовательскиеНастройкиДоступаКОбработкам" 

	Дано Я открываю основную форму списка регистра сведений "ПользовательскиеНастройкиДоступаКОбработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеНастройкиДоступаКОбработкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеНастройкиДоступаКОбработкам"

	Дано Я открываю основную форму регистра сведений "ПользовательскиеНастройкиДоступаКОбработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеНастройкиДоступаКОбработкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ПоставляемыеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ПоставляемыеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ПраваРолей" 

	Дано Я открываю основную форму списка регистра сведений "ПраваРолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваРолей"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ПредметыПапкиВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "ПредметыПапкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредметыПапкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредметыПапкиВзаимодействий"

	Дано Я открываю основную форму регистра сведений "ПредметыПапкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредметыПапкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ПредопределенныеВариантыОтчетовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредопределенныеВариантыОтчетовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетовВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ПредопределенныеВариантыОтчетовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредопределенныеВариантыОтчетовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ПричиныИзмененияАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "ПричиныИзмененияАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПричиныИзмененияАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцессыДляЗапуска"

	Дано Я открываю основную форму регистра сведений "ПроцессыДляЗапуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцессыДляЗапуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПубличныеИдентификаторыСинхронизируемыхОбъектов"

	Дано Я открываю основную форму регистра сведений "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"

	Дано Я открываю основную форму регистра сведений "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "РабочиеКаталогиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "РабочиеКаталогиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеКаталогиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеКаталогиФайлов"

	Дано Я открываю основную форму регистра сведений "РабочиеКаталогиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеКаталогиФайлов"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "РазрешенияНаИспользованиеВнешнихРесурсов" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "РезультатыОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыОбменаДанными"

	Дано Я открываю основную форму регистра сведений "РезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОбменаДанными"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СведенияОПользователях" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОПользователях"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОПользователях"

	Дано Я открываю основную форму регистра сведений "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОПользователях"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СвязиАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СвязиАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СессииОбменаСообщениямиСистемы"

	Дано Я открываю основную форму регистра сведений "СессииОбменаСообщениямиСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СессииОбменаСообщениямиСистемы"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СклоненияПредставленийОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СклоненияПредставленийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СклоненияПредставленийОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СклоненияПредставленийОбъектов"

	Дано Я открываю основную форму регистра сведений "СклоненияПредставленийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СклоненияПредставленийОбъектов"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СлужебныеАдресныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "СлужебныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СлужебныеАдресныеСведения"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "СогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "СогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СообщенияОбменаДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СообщенияОбменаДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбменаДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СообщенияОбменаДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДаннымиОбластейДанных"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СоответствияОбъектовИнформационныхБаз" 

	Дано Я открываю основную форму списка регистра сведений "СоответствияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствияОбъектовИнформационныхБаз"

	Дано Я открываю основную форму регистра сведений "СоответствияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СоставыГруппПользователей" 

	Дано Я открываю основную форму списка регистра сведений "СоставыГруппПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставыГруппПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставыГруппПользователей"

	Дано Я открываю основную форму регистра сведений "СоставыГруппПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставыГруппПользователей"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СостоянияКонтактовВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияКонтактовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтактовВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияКонтактовВзаимодействий"

	Дано Я открываю основную форму регистра сведений "СостоянияКонтактовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтактовВзаимодействий"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СостоянияОбменовДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПапокПисем"

	Дано Я открываю основную форму регистра сведений "СостоянияПапокПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПапокПисем"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СостоянияПредметовВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПредметовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПредметовВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПредметовВзаимодействий"

	Дано Я открываю основную форму регистра сведений "СостоянияПредметовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПредметовВзаимодействий"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "БилетыДляТестирования" 

	Дано Я открываю основную форму списка регистра сведений "БилетыДляТестирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БилетыДляТестирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БилетыДляТестирования"

	Дано Я открываю основную форму регистра сведений "БилетыДляТестирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БилетыДляТестирования"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СостоянияРассылокОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияРассылокОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияРассылокОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияРассылокОтчетов"

	Дано Я открываю основную форму регистра сведений "СостоянияРассылокОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияРассылокОтчетов"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СостоянияУспешныхОбменовДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияУспешныхОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияУспешныхОбменовДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СостоянияУспешныхОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СтатусыСинхронизацииФайловСОблачнымСервисом" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыСинхронизацииФайловСОблачнымСервисом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСинхронизацииФайловСОблачнымСервисом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыСинхронизацииФайловСОблачнымСервисом"

	Дано Я открываю основную форму регистра сведений "СтатусыСинхронизацииФайловСОблачнымСервисом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСинхронизацииФайловСОблачнымСервисом"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "ТаблицыГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ТаблицыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаблицыГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаблицыГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ТаблицыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаблицыГруппДоступа"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "УведомленияОПрочтении" 

	Дано Я открываю основную форму списка регистра сведений "УведомленияОПрочтении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УведомленияОПрочтении"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомленияОПрочтении"

	Дано Я открываю основную форму регистра сведений "УведомленияОПрочтении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УведомленияОПрочтении"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "УдалитьПараметрыИнтернетПоддержкиПользователей" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПараметрыИнтернетПоддержкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПараметрыИнтернетПоддержкиПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПараметрыИнтернетПоддержкиПользователей"

	Дано Я открываю основную форму регистра сведений "УдалитьПараметрыИнтернетПоддержкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПараметрыИнтернетПоддержкиПользователей"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "УдалитьХранимыеФайлыВерсий" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьХранимыеФайлыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранимыеФайлыВерсий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьХранимыеФайлыВерсий"

	Дано Я открываю основную форму регистра сведений "УдалитьХранимыеФайлыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранимыеФайлыВерсий"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "УровниСокращенийАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "УровниСокращенийАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УровниСокращенийАдресныхСведений"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "ФайлыВРабочемКаталоге" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыВРабочемКаталоге"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыВРабочемКаталоге"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыВРабочемКаталоге"

	Дано Я открываю основную форму регистра сведений "ФайлыВРабочемКаталоге"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыВРабочемКаталоге"
	И Я закрываю текущее окно


	
Сценарий: Открытие формы списка "КомплектыДокументов" 

	Дано Я открываю основную форму списка регистра сведений "КомплектыДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомплектыДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомплектыДокументов"

	Дано Я открываю основную форму регистра сведений "КомплектыДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомплектыДокументов"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "Комментарии" 

	Дано Я открываю основную форму списка регистра сведений "Комментарии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Комментарии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Комментарии"

	Дано Я открываю основную форму регистра сведений "Комментарии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Комментарии"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "Экспертиза" 

	Дано Я открываю основную форму списка регистра сведений "Экспертиза"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Экспертиза"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Экспертиза"

	Дано Я открываю основную форму регистра сведений "Экспертиза"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Экспертиза"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "НДФЛИгроковИстория" 

	Дано Я открываю основную форму списка регистра сведений "НДФЛИгроковИстория"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НДФЛИгроковИстория"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛИгроковИстория"

	Дано Я открываю основную форму регистра сведений "НДФЛИгроковИстория"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НДФЛИгроковИстория"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "ПризовойФондБестиражныхЛотерей" 

	Дано Я открываю основную форму списка регистра сведений "ПризовойФондБестиражныхЛотерей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПризовойФондБестиражныхЛотерей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПризовойФондБестиражныхЛотерей"

	Дано Я открываю основную форму регистра сведений "ПризовойФондБестиражныхЛотерей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПризовойФондБестиражныхЛотерей"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "СтатусыВыплатВоВненшнихСистемах" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыВыплатВоВненшнихСистемах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыВыплатВоВненшнихСистемах"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "ДанныеРеестровВыплат" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеРеестровВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеРеестровВыплат"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "НепроданныеБилетыМЛСтатусы" 

	Дано Я открываю основную форму списка регистра сведений "НепроданныеБилетыМЛСтатусы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепроданныеБилетыМЛСтатусы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НепроданныеБилетыМЛСтатусы"

	Дано Я открываю основную форму регистра сведений "НепроданныеБилетыМЛСтатусы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепроданныеБилетыМЛСтатусы"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "НепроданныеБилетыМЛСообщения" 

	Дано Я открываю основную форму списка регистра сведений "НепроданныеБилетыМЛСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепроданныеБилетыМЛСообщения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НепроданныеБилетыМЛСообщения"

	Дано Я открываю основную форму регистра сведений "НепроданныеБилетыМЛСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепроданныеБилетыМЛСообщения"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "БилетыПараметры" 

	Дано Я открываю основную форму списка регистра сведений "БилетыПараметры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БилетыПараметры"
	И Я закрываю текущее окно
	
Сценарий: Открытие формы списка "ГрафикиВыплатСведения" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикиВыплатСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикиВыплатСведения"
	И Я закрываю текущее окно



Сценарий: Открытие формы списка "ЧекиПараметры" 

	Дано Я открываю основную форму списка регистра сведений "ЧекиПараметры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЧекиПараметры"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ВыигрышПоКатегориям" 

	Дано Я открываю основную форму списка регистра сведений "ВыигрышПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыигрышПоКатегориям"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ВыдачаВещевогоВыигрыша" 

	Дано Я открываю основную форму списка регистра сведений "ВыдачаВещевогоВыигрыша"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыдачаВещевогоВыигрыша"
	И Я закрываю текущее окно



Сценарий: Открытие формы объекта "ДополнительныеСвойстваИгроков"

	Дано Я открываю основную форму регистра сведений "ДополнительныеСвойстваИгроков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСвойстваИгроков"
	И Я закрываю текущее окно



Сценарий: Открытие формы объекта "ДополнительныеТекстыПечатныхФорм"

	Дано Я открываю основную форму регистра сведений "ДополнительныеТекстыПечатныхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеТекстыПечатныхФорм"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "РеестрЗаблокированныхБилетов" 

	Дано Я открываю основную форму списка регистра сведений "РеестрЗаблокированныхБилетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрЗаблокированныхБилетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрЗаблокированныхБилетов"

	Дано Я открываю основную форму регистра сведений "РеестрЗаблокированныхБилетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрЗаблокированныхБилетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ЛогВзаимодействийССервисами" 

	Дано Я открываю основную форму списка регистра сведений "ЛогВзаимодействийССервисами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЛогВзаимодействийССервисами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛогВзаимодействийССервисами"

	Дано Я открываю основную форму регистра сведений "ЛогВзаимодействийССервисами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЛогВзаимодействийССервисами"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "СписокПолучателейРассылок" 

	Дано Я открываю основную форму списка регистра сведений "СписокПолучателейРассылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СписокПолучателейРассылок"
	И Я закрываю текущее окно

Сценарий: Открытие формы списка "ВыплатыПодлежащиеОбязательномуКонтролю" 

	Дано Я открываю основную форму списка регистра сведений "ВыплатыПодлежащиеОбязательномуКонтролю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыплатыПодлежащиеОбязательномуКонтролю"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатыПодлежащиеОбязательномуКонтролю"

	Дано Я открываю основную форму регистра сведений "ВыплатыПодлежащиеОбязательномуКонтролю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыплатыПодлежащиеОбязательномуКонтролю"
	И Я закрываю текущее окно


И Я закрываю все окна клиентского приложения

И я закрываю сеанс текущего клиента тестирования