#language: ru

@tree

Функциональность: Дымовые тесты "Документы"

Контекст:
	И Я открыл сеанс TestClient от имени "Администратор" с паролем "" или подключаю уже существующий
	И Я закрываю все окна клиентского приложения
	
Сценарий: Открытие формы списка "АвансовыйПлатежИностранцаПоНДФЛ" 

	Дано Я открываю основную форму списка документа "АвансовыйПлатежИностранцаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйПлатежИностранцаПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыйПлатежИностранцаПоНДФЛ"

	Дано Я открываю основную форму документа "АвансовыйПлатежИностранцаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйПлатежИностранцаПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктПриемкиВыполненныхРаботОказанныхУслуг" 

	Дано Я открываю основную форму списка документа "АктПриемкиВыполненныхРаботОказанныхУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПриемкиВыполненныхРаботОказанныхУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктПриемкиВыполненныхРаботОказанныхУслуг"

	Дано Я открываю основную форму документа "АктПриемкиВыполненныхРаботОказанныхУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПриемкиВыполненныхРаботОказанныхУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктПроверкиСтраховыхВзносов" 

	Дано Я открываю основную форму списка документа "АктПроверкиСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПроверкиСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктПроверкиСтраховыхВзносов"

	Дано Я открываю основную форму документа "АктПроверкиСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПроверкиСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Анкета" 

	Дано Я открываю основную форму списка документа "Анкета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Анкета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Анкета"

	Дано Я открываю основную форму документа "Анкета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Анкета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БольничныйЛист" 

	Дано Я открываю основную форму списка документа "БольничныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БольничныйЛист"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БольничныйЛист"

	Дано Я открываю основную форму документа "БольничныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БольничныйЛист"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БронированиеГражданПребывающихВЗапасе" 

	Дано Я открываю основную форму списка документа "БронированиеГражданПребывающихВЗапасе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БронированиеГражданПребывающихВЗапасе"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БронированиеГражданПребывающихВЗапасе"

	Дано Я открываю основную форму документа "БронированиеГражданПребывающихВЗапасе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа БронированиеГражданПребывающихВЗапасе"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводНачальныхОстатковОтпусков" 

	Дано Я открываю основную форму списка документа "ВводНачальныхОстатковОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводНачальныхОстатковОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводНачальныхОстатковОтпусков"

	Дано Я открываю основную форму документа "ВводНачальныхОстатковОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводНачальныхОстатковОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьНаВыплатуЗарплатыВБанк" 

	Дано Я открываю основную форму списка документа "ВедомостьНаВыплатуЗарплатыВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыВБанк"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьНаВыплатуЗарплатыВБанк"

	Дано Я открываю основную форму документа "ВедомостьНаВыплатуЗарплатыВБанк"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыВБанк"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьНаВыплатуЗарплатыВКассу" 

	Дано Я открываю основную форму списка документа "ВедомостьНаВыплатуЗарплатыВКассу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыВКассу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьНаВыплатуЗарплатыВКассу"

	Дано Я открываю основную форму документа "ВедомостьНаВыплатуЗарплатыВКассу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыВКассу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьНаВыплатуЗарплатыПеречислением" 

	Дано Я открываю основную форму списка документа "ВедомостьНаВыплатуЗарплатыПеречислением"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыПеречислением"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьНаВыплатуЗарплатыПеречислением"

	Дано Я открываю основную форму документа "ВедомостьНаВыплатуЗарплатыПеречислением"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыПеречислением"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьНаВыплатуЗарплатыРаздатчиком" 

	Дано Я открываю основную форму списка документа "ВедомостьНаВыплатуЗарплатыРаздатчиком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыРаздатчиком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьНаВыплатуЗарплатыРаздатчиком"

	Дано Я открываю основную форму документа "ВедомостьНаВыплатуЗарплатыРаздатчиком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьНаВыплатуЗарплатыРаздатчиком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВедомостьУплатыАДВ_11" 

	Дано Я открываю основную форму списка документа "ВедомостьУплатыАДВ_11"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьУплатыАДВ_11"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВедомостьУплатыАДВ_11"

	Дано Я открываю основную форму документа "ВедомостьУплатыАДВ_11"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВедомостьУплатыАДВ_11"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВключениеВКадровыйРезерв" 

	Дано Я открываю основную форму списка документа "ВключениеВКадровыйРезерв"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВключениеВКадровыйРезерв"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВключениеВКадровыйРезерв"

	Дано Я открываю основную форму документа "ВключениеВКадровыйРезерв"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВключениеВКадровыйРезерв"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратИзОтпускаПоУходуЗаРебенком" 

	Дано Я открываю основную форму списка документа "ВозвратИзОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратИзОтпускаПоУходуЗаРебенком"

	Дано Я открываю основную форму документа "ВозвратИзОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратНДФЛ" 

	Дано Я открываю основную форму списка документа "ВозвратНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратНДФЛ"

	Дано Я открываю основную форму документа "ВозвратНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратСотрудникомЗадолженности" 

	Дано Я открываю основную форму списка документа "ВозвратСотрудникомЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратСотрудникомЗадолженности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратСотрудникомЗадолженности"

	Дано Я открываю основную форму документа "ВозвратСотрудникомЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратСотрудникомЗадолженности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозмещениеРасходовФондомСоциальногоСтрахования" 

	Дано Я открываю основную форму списка документа "ВозмещениеРасходовФондомСоциальногоСтрахования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозмещениеРасходовФондомСоциальногоСтрахования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозмещениеРасходовФондомСоциальногоСтрахования"

	Дано Я открываю основную форму документа "ВозмещениеРасходовФондомСоциальногоСтрахования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозмещениеРасходовФондомСоциальногоСтрахования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВосстановлениеВДолжности" 

	Дано Я открываю основную форму списка документа "ВосстановлениеВДолжности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВосстановлениеВДолжности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВосстановлениеВДолжности"

	Дано Я открываю основную форму документа "ВосстановлениеВДолжности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВосстановлениеВДолжности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Встреча" 

	Дано Я открываю основную форму списка документа "Встреча"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Встреча"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Встреча"

	Дано Я открываю основную форму документа "Встреча"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Встреча"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВходящаяСправкаОЗаработкеДляРасчетаПособий" 

	Дано Я открываю основную форму списка документа "ВходящаяСправкаОЗаработкеДляРасчетаПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВходящаяСправкаОЗаработкеДляРасчетаПособий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВходящаяСправкаОЗаработкеДляРасчетаПособий"

	Дано Я открываю основную форму документа "ВходящаяСправкаОЗаработкеДляРасчетаПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВходящаяСправкаОЗаработкеДляРасчетаПособий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыгрузкаРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка документа "ВыгрузкаРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыгрузкаРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыгрузкаРегламентированныхОтчетов"

	Дано Я открываю основную форму документа "ВыгрузкаРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыгрузкаРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыдачаЗаймаСотруднику" 

	Дано Я открываю основную форму списка документа "ВыдачаЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыдачаЗаймаСотруднику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыдачаЗаймаСотруднику"

	Дано Я открываю основную форму документа "ВыдачаЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыдачаЗаймаСотруднику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыплатаБывшимСотрудникам" 

	Дано Я открываю основную форму списка документа "ВыплатаБывшимСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыплатаБывшимСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатаБывшимСотрудникам"

	Дано Я открываю основную форму документа "ВыплатаБывшимСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыплатаБывшимСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыплатаДепонированнойЗарплаты" 

	Дано Я открываю основную форму списка документа "ВыплатаДепонированнойЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыплатаДепонированнойЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатаДепонированнойЗарплаты"

	Дано Я открываю основную форму документа "ВыплатаДепонированнойЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыплатаДепонированнойЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикОтпусков" 

	Дано Я открываю основную форму списка документа "ГрафикОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ГрафикОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикОтпусков"

	Дано Я открываю основную форму документа "ГрафикОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ГрафикОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеДляРасчетаЗарплаты" 

	Дано Я открываю основную форму списка документа "ДанныеДляРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДанныеДляРасчетаЗарплаты"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ДекларацияСоответствияУсловийТруда" 

	Дано Я открываю основную форму списка документа "ДекларацияСоответствияУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДекларацияСоответствияУсловийТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДекларацияСоответствияУсловийТруда"

	Дано Я открываю основную форму документа "ДекларацияСоответствияУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДекларацияСоответствияУсловийТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДепонированиеЗарплаты" 

	Дано Я открываю основную форму списка документа "ДепонированиеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДепонированиеЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДепонированиеЗарплаты"

	Дано Я открываю основную форму документа "ДепонированиеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДепонированиеЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДивидендыФизическимЛицам" 

	Дано Я открываю основную форму списка документа "ДивидендыФизическимЛицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДивидендыФизическимЛицам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДивидендыФизическимЛицам"

	Дано Я открываю основную форму документа "ДивидендыФизическимЛицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДивидендыФизическимЛицам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорАвторскогоЗаказа" 

	Дано Я открываю основную форму списка документа "ДоговорАвторскогоЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорАвторскогоЗаказа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорАвторскогоЗаказа"

	Дано Я открываю основную форму документа "ДоговорАвторскогоЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорАвторскогоЗаказа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорЗаймаСотруднику" 

	Дано Я открываю основную форму списка документа "ДоговорЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорЗаймаСотруднику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорЗаймаСотруднику"

	Дано Я открываю основную форму документа "ДоговорЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорЗаймаСотруднику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорРаботыУслуги" 

	Дано Я открываю основную форму списка документа "ДоговорРаботыУслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорРаботыУслуги"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорРаботыУслуги"

	Дано Я открываю основную форму документа "ДоговорРаботыУслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорРаботыУслуги"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоходВНатуральнойФорме" 

	Дано Я открываю основную форму списка документа "ДоходВНатуральнойФорме"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоходВНатуральнойФорме"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ЕдиновременноеПособиеЗаСчетФСС" 

	Дано Я открываю основную форму списка документа "ЕдиновременноеПособиеЗаСчетФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЕдиновременноеПособиеЗаСчетФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЕдиновременноеПособиеЗаСчетФСС"

	Дано Я открываю основную форму документа "ЕдиновременноеПособиеЗаСчетФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЕдиновременноеПособиеЗаСчетФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапланированноеВзаимодействие" 

	Дано Я открываю основную форму списка документа "ЗапланированноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапланированноеВзаимодействие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапланированноеВзаимодействие"

	Дано Я открываю основную форму документа "ЗапланированноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапланированноеВзаимодействие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросВФССОПроверкеРаботодателя" 

	Дано Я открываю основную форму списка документа "ЗапросВФССОПроверкеРаботодателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросВФССОПроверкеРаботодателя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросВФССОПроверкеРаботодателя"

	Дано Я открываю основную форму документа "ЗапросВФССОПроверкеРаботодателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросВФССОПроверкеРаботодателя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП" 

	Дано Я открываю основную форму списка документа "ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"

	Дано Я открываю основную форму документа "ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика" 

	Дано Я открываю основную форму списка документа "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"

	Дано Я открываю основную форму документа "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросНаИнформационноеОбслуживаниеСтрахователя" 

	Дано Я открываю основную форму списка документа "ЗапросНаИнформационноеОбслуживаниеСтрахователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаИнформационноеОбслуживаниеСтрахователя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросНаИнформационноеОбслуживаниеСтрахователя"

	Дано Я открываю основную форму документа "ЗапросНаИнформационноеОбслуживаниеСтрахователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаИнформационноеОбслуживаниеСтрахователя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросСправкиСотрудником" 

	Дано Я открываю основную форму списка документа "ЗапросСправкиСотрудником"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросСправкиСотрудником"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросСправкиСотрудником"

	Дано Я открываю основную форму документа "ЗапросСправкиСотрудником"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросСправкиСотрудником"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаВключениеВКадровыйРезерв" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаВключениеВКадровыйРезерв"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВключениеВКадровыйРезерв"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаВключениеВКадровыйРезерв"

	Дано Я открываю основную форму документа "ЗаявкаНаВключениеВКадровыйРезерв"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВключениеВКадровыйРезерв"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаВключениеВПланОбучения" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаВключениеВПланОбучения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВключениеВПланОбучения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаВключениеВПланОбучения"

	Дано Я открываю основную форму документа "ЗаявкаНаВключениеВПланОбучения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВключениеВПланОбучения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников"

	Дано Я открываю основную форму документа "ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаКомандировку" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаКомандировку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаКомандировку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаКомандировку"

	Дано Я открываю основную форму документа "ЗаявкаНаКомандировку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаКомандировку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаОбучениеРазвитие" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаОбучениеРазвитие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаОбучениеРазвитие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаОбучениеРазвитие"

	Дано Я открываю основную форму документа "ЗаявкаНаОбучениеРазвитие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаОбучениеРазвитие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников"

	Дано Я открываю основную форму документа "ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаОтпуск" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаОтпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаОтпуск"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаОтпуск"

	Дано Я открываю основную форму документа "ЗаявкаНаОтпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаОтпуск"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаПодборПерсонала" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаПодборПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаПодборПерсонала"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаПодборПерсонала"

	Дано Я открываю основную форму документа "ЗаявкаНаПодборПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаПодборПерсонала"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеАбонентаСпецоператораСвязи" 

	Дано Я открываю основную форму списка документа "ЗаявлениеАбонентаСпецоператораСвязи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеАбонентаСпецоператораСвязи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеАбонентаСпецоператораСвязи"

	Дано Я открываю основную форму документа "ЗаявлениеАбонентаСпецоператораСвязи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеАбонентаСпецоператораСвязи"
	И Я закрываю текущее окно
И Я закрываю все окна клиентского приложения
	
Сценарий: Открытие формы списка "ЗаявлениеИЗапросВПФРОЗаработке" 

	Дано Я открываю основную форму списка документа "ЗаявлениеИЗапросВПФРОЗаработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеИЗапросВПФРОЗаработке"
	И Я закрываю текущее окно
И Я закрываю все окна клиентского приложения

Сценарий: Открытие формы объекта "ЗаявлениеИЗапросВПФРОЗаработке"

	Дано Я открываю основную форму документа "ЗаявлениеИЗапросВПФРОЗаработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеИЗапросВПФРОЗаработке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ" 

	Дано Я открываю основную форму списка документа "ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ"

	Дано Я открываю основную форму документа "ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ" 

	Дано Я открываю основную форму списка документа "ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ"

	Дано Я открываю основную форму документа "ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеСотрудникаНаВыплатуПособия" 

	Дано Я открываю основную форму списка документа "ЗаявлениеСотрудникаНаВыплатуПособия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеСотрудникаНаВыплатуПособия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеСотрудникаНаВыплатуПособия"

	Дано Я открываю основную форму документа "ЗаявлениеСотрудникаНаВыплатуПособия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеСотрудникаНаВыплатуПособия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеАванса" 

	Дано Я открываю основную форму списка документа "ИзменениеАванса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеАванса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеАванса"

	Дано Я открываю основную форму документа "ИзменениеАванса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеАванса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеГрафикаРаботыСписком" 

	Дано Я открываю основную форму списка документа "ИзменениеГрафикаРаботыСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеГрафикаРаботыСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеГрафикаРаботыСписком"

	Дано Я открываю основную форму документа "ИзменениеГрафикаРаботыСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеГрафикаРаботыСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеКвалификационногоРазряда" 

	Дано Я открываю основную форму списка документа "ИзменениеКвалификационногоРазряда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеКвалификационногоРазряда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеКвалификационногоРазряда"

	Дано Я открываю основную форму документа "ИзменениеКвалификационногоРазряда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеКвалификационногоРазряда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеЛьготСотрудников" 

	Дано Я открываю основную форму списка документа "ИзменениеЛьготСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеЛьготСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеЛьготСотрудников"

	Дано Я открываю основную форму документа "ИзменениеЛьготСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеЛьготСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеМестРаботы" 

	Дано Я открываю основную форму списка документа "ИзменениеМестРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеМестРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеМестРаботы"

	Дано Я открываю основную форму документа "ИзменениеМестРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеМестРаботы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеОплатыТруда" 

	Дано Я открываю основную форму списка документа "ИзменениеОплатыТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеОплатыТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеОплатыТруда"

	Дано Я открываю основную форму документа "ИзменениеОплатыТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеОплатыТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеПлановыхНачислений" 

	Дано Я открываю основную форму списка документа "ИзменениеПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПлановыхНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеПлановыхНачислений"

	Дано Я открываю основную форму документа "ИзменениеПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПлановыхНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеУсловийДоговораЗаймаСотруднику" 

	Дано Я открываю основную форму списка документа "ИзменениеУсловийДоговораЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийДоговораЗаймаСотруднику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеУсловийДоговораЗаймаСотруднику"

	Дано Я открываю основную форму документа "ИзменениеУсловийДоговораЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийДоговораЗаймаСотруднику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеУсловийИсполнительногоЛиста" 

	Дано Я открываю основную форму списка документа "ИзменениеУсловийИсполнительногоЛиста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийИсполнительногоЛиста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеУсловийИсполнительногоЛиста"

	Дано Я открываю основную форму документа "ИзменениеУсловийИсполнительногоЛиста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийИсполнительногоЛиста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком" 

	Дано Я открываю основную форму списка документа "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком"

	Дано Я открываю основную форму документа "ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеШтатногоРасписания" 

	Дано Я открываю основную форму списка документа "ИзменениеШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеШтатногоРасписания"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ИндексацияЗаработка" 

	Дано Я открываю основную форму списка документа "ИндексацияЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИндексацияЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндексацияЗаработка"

	Дано Я открываю основную форму документа "ИндексацияЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИндексацияЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИндексацияШтатногоРасписания" 

	Дано Я открываю основную форму списка документа "ИндексацияШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИндексацияШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндексацияШтатногоРасписания"

	Дано Я открываю основную форму документа "ИндексацияШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИндексацияШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИндивидуальныйГрафик" 

	Дано Я открываю основную форму списка документа "ИндивидуальныйГрафик"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИндивидуальныйГрафик"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндивидуальныйГрафик"

	Дано Я открываю основную форму документа "ИндивидуальныйГрафик"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИндивидуальныйГрафик"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнструктажПоОхранеТруда" 

	Дано Я открываю основную форму списка документа "ИнструктажПоОхранеТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнструктажПоОхранеТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнструктажПоОхранеТруда"

	Дано Я открываю основную форму документа "ИнструктажПоОхранеТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнструктажПоОхранеТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсключениеИзКадровогоРезерва" 

	Дано Я открываю основную форму списка документа "ИсключениеИзКадровогоРезерва"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсключениеИзКадровогоРезерва"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсключениеИзКадровогоРезерва"

	Дано Я открываю основную форму документа "ИсключениеИзКадровогоРезерва"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсключениеИзКадровогоРезерва"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсполнительныйЛист" 

	Дано Я открываю основную форму списка документа "ИсполнительныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсполнительныйЛист"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсполнительныйЛист"

	Дано Я открываю основную форму документа "ИсполнительныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсполнительныйЛист"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсходящаяСправкаОЗаработкеДляРасчетаПособий" 

	Дано Я открываю основную форму списка документа "ИсходящаяСправкаОЗаработкеДляРасчетаПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсходящаяСправкаОЗаработкеДляРасчетаПособий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсходящаяСправкаОЗаработкеДляРасчетаПособий"

	Дано Я открываю основную форму документа "ИсходящаяСправкаОЗаработкеДляРасчетаПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсходящаяСправкаОЗаработкеДляРасчетаПособий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыйПеревод" 

	Дано Я открываю основную форму списка документа "КадровыйПеревод"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КадровыйПеревод"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыйПеревод"

	Дано Я открываю основную форму документа "КадровыйПеревод"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КадровыйПеревод"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыйПереводСписком" 

	Дано Я открываю основную форму списка документа "КадровыйПереводСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КадровыйПереводСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыйПереводСписком"

	Дано Я открываю основную форму документа "КадровыйПереводСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КадровыйПереводСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Командировка" 

	Дано Я открываю основную форму списка документа "Командировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Командировка"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "КомандировкиСотрудников" 

	Дано Я открываю основную форму списка документа "КомандировкиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КомандировкиСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомандировкиСотрудников"

	Дано Я открываю основную форму документа "КомандировкиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КомандировкиСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомпенсацияЗаЗадержкуЗарплаты" 

	Дано Я открываю основную форму списка документа "КомпенсацияЗаЗадержкуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КомпенсацияЗаЗадержкуЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомпенсацияЗаЗадержкуЗарплаты"

	Дано Я открываю основную форму документа "КомпенсацияЗаЗадержкуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КомпенсацияЗаЗадержкуЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛистокСообщенияДляВоенкомата" 

	Дано Я открываю основную форму списка документа "ЛистокСообщенияДляВоенкомата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛистокСообщенияДляВоенкомата"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛистокСообщенияДляВоенкомата"

	Дано Я открываю основную форму документа "ЛистокСообщенияДляВоенкомата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛистокСообщенияДляВоенкомата"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МатериальнаяПомощь" 

	Дано Я открываю основную форму списка документа "МатериальнаяПомощь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МатериальнаяПомощь"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "НазначениеОпросов" 

	Дано Я открываю основную форму списка документа "НазначениеОпросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеОпросов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеОпросов"

	Дано Я открываю основную форму документа "НазначениеОпросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеОпросов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеПлановогоНачисления" 

	Дано Я открываю основную форму списка документа "НазначениеПлановогоНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеПлановогоНачисления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеПлановогоНачисления"

	Дано Я открываю основную форму документа "НазначениеПлановогоНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеПлановогоНачисления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеПодработки" 

	Дано Я открываю основную форму списка документа "НазначениеПодработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеПодработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеПодработки"

	Дано Я открываю основную форму документа "НазначениеПодработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеПодработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаправлениеНаВнешнююАттестацию" 

	Дано Я открываю основную форму списка документа "НаправлениеНаВнешнююАттестацию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НаправлениеНаВнешнююАттестацию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаправлениеНаВнешнююАттестацию"

	Дано Я открываю основную форму документа "НаправлениеНаВнешнююАттестацию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НаправлениеНаВнешнююАттестацию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачальнаяЗадолженностьПоЗарплате" 

	Дано Я открываю основную форму списка документа "НачальнаяЗадолженностьПоЗарплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальнаяЗадолженностьПоЗарплате"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачальнаяЗадолженностьПоЗарплате"

	Дано Я открываю основную форму документа "НачальнаяЗадолженностьПоЗарплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальнаяЗадолженностьПоЗарплате"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачальнаяШтатнаяРасстановка" 

	Дано Я открываю основную форму списка документа "НачальнаяШтатнаяРасстановка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальнаяШтатнаяРасстановка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачальнаяШтатнаяРасстановка"

	Дано Я открываю основную форму документа "НачальнаяШтатнаяРасстановка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальнаяШтатнаяРасстановка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеЗаПервуюПоловинуМесяца" 

	Дано Я открываю основную форму списка документа "НачислениеЗаПервуюПоловинуМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеЗаПервуюПоловинуМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеЗаПервуюПоловинуМесяца"

	Дано Я открываю основную форму документа "НачислениеЗаПервуюПоловинуМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеЗаПервуюПоловинуМесяца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеЗарплаты" 

	Дано Я открываю основную форму списка документа "НачислениеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеЗарплаты"

	Дано Я открываю основную форму документа "НачислениеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеОценочныхОбязательствПоОтпускам" 

	Дано Я открываю основную форму списка документа "НачислениеОценочныхОбязательствПоОтпускам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеОценочныхОбязательствПоОтпускам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеОценочныхОбязательствПоОтпускам"

	Дано Я открываю основную форму документа "НачислениеОценочныхОбязательствПоОтпускам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеОценочныхОбязательствПоОтпускам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НесчастныйСлучайНаПроизводстве" 

	Дано Я открываю основную форму списка документа "НесчастныйСлучайНаПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НесчастныйСлучайНаПроизводстве"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НесчастныйСлучайНаПроизводстве"

	Дано Я открываю основную форму документа "НесчастныйСлучайНаПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НесчастныйСлучайНаПроизводстве"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбучениеРазвитиеСотрудников" 

	Дано Я открываю основную форму списка документа "ОбучениеРазвитиеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбучениеРазвитиеСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбучениеРазвитиеСотрудников"

	Дано Я открываю основную форму документа "ОбучениеРазвитиеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбучениеРазвитиеСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияНалоговогоУчетаПоНДФЛ" 

	Дано Я открываю основную форму списка документа "ОперацияНалоговогоУчетаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияНалоговогоУчетаПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияНалоговогоУчетаПоНДФЛ"

	Дано Я открываю основную форму документа "ОперацияНалоговогоУчетаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияНалоговогоУчетаПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияУчетаПоСтраховымВзносам" 

	Дано Я открываю основную форму списка документа "ОперацияУчетаПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияУчетаПоСтраховымВзносам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияУчетаПоСтраховымВзносам"

	Дано Я открываю основную форму документа "ОперацияУчетаПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияУчетаПоСтраховымВзносам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписьЗаявленийСотрудниковНаВыплатуПособий" 

	Дано Я открываю основную форму списка документа "ОписьЗаявленийСотрудниковНаВыплатуПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьЗаявленийСотрудниковНаВыплатуПособий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписьЗаявленийСотрудниковНаВыплатуПособий"

	Дано Я открываю основную форму документа "ОписьЗаявленийСотрудниковНаВыплатуПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьЗаявленийСотрудниковНаВыплатуПособий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписьПачекСЗВ_6" 

	Дано Я открываю основную форму списка документа "ОписьПачекСЗВ_6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьПачекСЗВ_6"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписьПачекСЗВ_6"

	Дано Я открываю основную форму документа "ОписьПачекСЗВ_6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьПачекСЗВ_6"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплатаДнейУходаЗаДетьмиИнвалидами" 

	Дано Я открываю основную форму списка документа "ОплатаДнейУходаЗаДетьмиИнвалидами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОплатаДнейУходаЗаДетьмиИнвалидами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаДнейУходаЗаДетьмиИнвалидами"

	Дано Я открываю основную форму документа "ОплатаДнейУходаЗаДетьмиИнвалидами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОплатаДнейУходаЗаДетьмиИнвалидами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплатаПоСреднемуЗаработку" 

	Дано Я открываю основную форму списка документа "ОплатаПоСреднемуЗаработку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОплатаПоСреднемуЗаработку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаПоСреднемуЗаработку"

	Дано Я открываю основную форму документа "ОплатаПоСреднемуЗаработку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОплатаПоСреднемуЗаработку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Отгул" 

	Дано Я открываю основную форму списка документа "Отгул"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Отгул"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ОтзывСогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтзывСогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаБронированияГражданПребывающихВЗапасе" 

	Дано Я открываю основную форму списка документа "ОтменаБронированияГражданПребывающихВЗапасе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаБронированияГражданПребывающихВЗапасе"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаБронированияГражданПребывающихВЗапасе"

	Дано Я открываю основную форму документа "ОтменаБронированияГражданПребывающихВЗапасе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаБронированияГражданПребывающихВЗапасе"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаДоплатыДоСреднегоЗаработка" 

	Дано Я открываю основную форму списка документа "ОтменаДоплатыДоСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаДоплатыДоСреднегоЗаработка"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ОтменаЗаявкиНаКомандировку" 

	Дано Я открываю основную форму списка документа "ОтменаЗаявкиНаКомандировку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаЗаявкиНаКомандировку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаЗаявкиНаКомандировку"

	Дано Я открываю основную форму документа "ОтменаЗаявкиНаКомандировку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаЗаявкиНаКомандировку"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаЗаявкиНаОтпуск" 

	Дано Я открываю основную форму списка документа "ОтменаЗаявкиНаОтпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаЗаявкиНаОтпуск"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаЗаявкиНаОтпуск"

	Дано Я открываю основную форму документа "ОтменаЗаявкиНаОтпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаЗаявкиНаОтпуск"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаСовмещения" 

	Дано Я открываю основную форму списка документа "ОтменаСовмещения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаСовмещения"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "Отпуск" 

	Дано Я открываю основную форму списка документа "Отпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Отпуск"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Отпуск"

	Дано Я открываю основную форму документа "Отпуск"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Отпуск"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускаСотрудников" 

	Дано Я открываю основную форму списка документа "ОтпускаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускаСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускаСотрудников"

	Дано Я открываю основную форму документа "ОтпускаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускаСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускБезСохраненияОплаты" 

	Дано Я открываю основную форму списка документа "ОтпускБезСохраненияОплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускБезСохраненияОплаты"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ОтпускПоУходуЗаРебенком" 

	Дано Я открываю основную форму списка документа "ОтпускПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускПоУходуЗаРебенком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускПоУходуЗаРебенком"

	Дано Я открываю основную форму документа "ОтпускПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтпускПоУходуЗаРебенком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеЗарплатыВБухучете" 

	Дано Я открываю основную форму списка документа "ОтражениеЗарплатыВБухучете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеЗарплатыВБухучете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеЗарплатыВБухучете"

	Дано Я открываю основную форму документа "ОтражениеЗарплатыВБухучете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеЗарплатыВБухучете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеЗарплатыВФинансовомУчете" 

	Дано Я открываю основную форму списка документа "ОтражениеЗарплатыВФинансовомУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеЗарплатыВФинансовомУчете"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеЗарплатыВФинансовомУчете"

	Дано Я открываю основную форму документа "ОтражениеЗарплатыВФинансовомУчете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтражениеЗарплатыВФинансовомУчете"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетОбменСБанками" 

	Дано Я открываю основную форму списка документа "ПакетОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПакетОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетОбменСБанками"

	Дано Я открываю основную форму документа "ПакетОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПакетОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовАДВ_1" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовАДВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовАДВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовАДВ_1"

	Дано Я открываю основную форму документа "ПачкаДокументовАДВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовАДВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовАДВ_2" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовАДВ_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовАДВ_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовАДВ_2"

	Дано Я открываю основную форму документа "ПачкаДокументовАДВ_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовАДВ_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовАДВ_3" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовАДВ_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовАДВ_3"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовАДВ_3"

	Дано Я открываю основную форму документа "ПачкаДокументовАДВ_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовАДВ_3"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовДСВ_1" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовДСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовДСВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовДСВ_1"

	Дано Я открываю основную форму документа "ПачкаДокументовДСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовДСВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_6_1" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСЗВ_6_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_6_1"

	Дано Я открываю основную форму документа "ПачкаДокументовСЗВ_6_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_6_3" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСЗВ_6_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_3"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_6_3"

	Дано Я открываю основную форму документа "ПачкаДокументовСЗВ_6_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_3"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_6_4" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСЗВ_6_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_6_4"

	Дано Я открываю основную форму документа "ПачкаДокументовСЗВ_6_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_К" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСЗВ_К"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_К"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_К"

	Дано Я открываю основную форму документа "ПачкаДокументовСЗВ_К"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_К"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСПВ_1" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСПВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСПВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСПВ_1"

	Дано Я открываю основную форму документа "ПачкаДокументовСПВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСПВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСПВ_2" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСПВ_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСПВ_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСПВ_2"

	Дано Я открываю основную форму документа "ПачкаДокументовСПВ_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСПВ_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаРазделов6РасчетаРСВ_1" 

	Дано Я открываю основную форму списка документа "ПачкаРазделов6РасчетаРСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаРазделов6РасчетаРСВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаРазделов6РасчетаРСВ_1"

	Дано Я открываю основную форму документа "ПачкаРазделов6РасчетаРСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаРазделов6РасчетаРСВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереводКДругомуРаботодателю" 

	Дано Я открываю основную форму списка документа "ПереводКДругомуРаботодателю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереводКДругомуРаботодателю"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереводКДругомуРаботодателю"

	Дано Я открываю основную форму документа "ПереводКДругомуРаботодателю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереводКДругомуРаботодателю"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеВДругоеПодразделение" 

	Дано Я открываю основную форму списка документа "ПеремещениеВДругоеПодразделение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеВДругоеПодразделение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеВДругоеПодразделение"

	Дано Я открываю основную форму документа "ПеремещениеВДругоеПодразделение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеВДругоеПодразделение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеМеждуТерриториями" 

	Дано Я открываю основную форму списка документа "ПеремещениеМеждуТерриториями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеМеждуТерриториями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеМеждуТерриториями"

	Дано Я открываю основную форму документа "ПеремещениеМеждуТерриториями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеМеждуТерриториями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереносДанных" 

	Дано Я открываю основную форму списка документа "ПереносДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереносДанных"

	Дано Я открываю основную форму документа "ПереносДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереносЗатратНаПерсоналМеждуСтатьями" 

	Дано Я открываю основную форму списка документа "ПереносЗатратНаПерсоналМеждуСтатьями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносЗатратНаПерсоналМеждуСтатьями"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереносЗатратНаПерсоналМеждуСтатьями"

	Дано Я открываю основную форму документа "ПереносЗатратНаПерсоналМеждуСтатьями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносЗатратНаПерсоналМеждуСтатьями"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереносОтпуска" 

	Дано Я открываю основную форму списка документа "ПереносОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносОтпуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереносОтпуска"

	Дано Я открываю основную форму документа "ПереносОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносОтпуска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерерасчетНДФЛ" 

	Дано Я открываю основную форму списка документа "ПерерасчетНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПерерасчетНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерерасчетНДФЛ"

	Дано Я открываю основную форму документа "ПерерасчетНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПерерасчетНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерерасчетСтраховыхВзносов" 

	Дано Я открываю основную форму списка документа "ПерерасчетСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПерерасчетСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерерасчетСтраховыхВзносов"

	Дано Я открываю основную форму документа "ПерерасчетСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПерерасчетСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеречислениеНДФЛВБюджет" 

	Дано Я открываю основную форму списка документа "ПеречислениеНДФЛВБюджет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеречислениеНДФЛВБюджет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеречислениеНДФЛВБюджет"

	Дано Я открываю основную форму документа "ПеречислениеНДФЛВБюджет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеречислениеНДФЛВБюджет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыОплаченныеДоНачалаЭксплуатации" 

	Дано Я открываю основную форму списка документа "ПериодыОплаченныеДоНачалаЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПериодыОплаченныеДоНачалаЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыОплаченныеДоНачалаЭксплуатации"

	Дано Я открываю основную форму документа "ПериодыОплаченныеДоНачалаЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПериодыОплаченныеДоНачалаЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланОбученияРазвития" 

	Дано Я открываю основную форму списка документа "ПланОбученияРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланОбученияРазвития"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланОбученияРазвития"

	Дано Я открываю основную форму документа "ПланОбученияРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланОбученияРазвития"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлатежноеПоручение" 

	Дано Я открываю основную форму списка документа "ПлатежноеПоручение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлатежноеПоручение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлатежноеПоручение"

	Дано Я открываю основную форму документа "ПлатежноеПоручение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлатежноеПоручение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПогашениеЗаймаСотруднику" 

	Дано Я открываю основную форму списка документа "ПогашениеЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПогашениеЗаймаСотруднику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПогашениеЗаймаСотруднику"

	Дано Я открываю основную форму документа "ПогашениеЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПогашениеЗаймаСотруднику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодготовкаСпецоценкиУсловийТруда" 

	Дано Я открываю основную форму списка документа "ПодготовкаСпецоценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодготовкаСпецоценкиУсловийТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодготовкаСпецоценкиУсловийТруда"

	Дано Я открываю основную форму документа "ПодготовкаСпецоценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодготовкаСпецоценкиУсловийТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодтверждениеЗачисленияЗарплаты" 

	Дано Я открываю основную форму списка документа "ПодтверждениеЗачисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодтверждениеЗачисленияЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодтверждениеОткрытияЛицевыхСчетовСотрудников" 

	Дано Я открываю основную форму списка документа "ПодтверждениеОткрытияЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПодтверждениеОткрытияЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоследствияНесчастногоСлучая" 

	Дано Я открываю основную форму списка документа "ПоследствияНесчастногоСлучая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоследствияНесчастногоСлучая"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоследствияНесчастногоСлучая"

	Дано Я открываю основную форму документа "ПоследствияНесчастногоСлучая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоследствияНесчастногоСлучая"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПостоянноеУдержаниеВПользуТретьихЛиц" 

	Дано Я открываю основную форму списка документа "ПостоянноеУдержаниеВПользуТретьихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПостоянноеУдержаниеВПользуТретьихЛиц"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ПоясненияКДекларацииПоНДС" 

	Дано Я открываю основную форму списка документа "ПоясненияКДекларацииПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоясненияКДекларацииПоНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоясненияКДекларацииПоНДС"

	Дано Я открываю основную форму документа "ПоясненияКДекларацииПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоясненияКДекларацииПоНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрекращениеПлановогоНачисления" 

	Дано Я открываю основную форму списка документа "ПрекращениеПлановогоНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеПлановогоНачисления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрекращениеПлановогоНачисления"

	Дано Я открываю основную форму документа "ПрекращениеПлановогоНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеПлановогоНачисления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрекращениеПодработки" 

	Дано Я открываю основную форму списка документа "ПрекращениеПодработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеПодработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрекращениеПодработки"

	Дано Я открываю основную форму документа "ПрекращениеПодработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеПодработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрекращениеСтандартныхВычетовНДФЛ" 

	Дано Я открываю основную форму списка документа "ПрекращениеСтандартныхВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеСтандартныхВычетовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрекращениеСтандартныхВычетовНДФЛ"

	Дано Я открываю основную форму документа "ПрекращениеСтандартныхВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрекращениеСтандартныхВычетовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Премия" 

	Дано Я открываю основную форму списка документа "Премия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Премия"
	И Я закрываю текущее окно

                                   

	
Сценарий: Открытие формы списка "ПриемНаРаботу" 

	Дано Я открываю основную форму списка документа "ПриемНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемНаРаботу"

	Дано Я открываю основную форму документа "ПриемНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемНаРаботуСписком" 

	Дано Я открываю основную форму списка документа "ПриемНаРаботуСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботуСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемНаРаботуСписком"

	Дано Я открываю основную форму документа "ПриемНаРаботуСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботуСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПризПодарок" 

	Дано Я открываю основную форму списка документа "ПризПодарок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПризПодарок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПризПодарок"

	Дано Я открываю основную форму документа "ПризПодарок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПризПодарок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриказНаДоплатуДоСреднегоЗаработка" 

	Дано Я открываю основную форму списка документа "ПриказНаДоплатуДоСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриказНаДоплатуДоСреднегоЗаработка"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ПриказОбАттестацииСотрудников" 

	Дано Я открываю основную форму списка документа "ПриказОбАттестацииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриказОбАттестацииСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриказОбАттестацииСотрудников"

	Дано Я открываю основную форму документа "ПриказОбАттестацииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриказОбАттестацииСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрогулНеявка" 

	Дано Я открываю основную форму списка документа "ПрогулНеявка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрогулНеявка"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ПродлениеКонтрактаДоговора" 

	Дано Я открываю основную форму списка документа "ПродлениеКонтрактаДоговора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПродлениеКонтрактаДоговора"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПродлениеКонтрактаДоговора"

	Дано Я открываю основную форму документа "ПродлениеКонтрактаДоговора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПродлениеКонтрактаДоговора"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизвольныйКадровыйПриказ" 

	Дано Я открываю основную форму списка документа "ПроизвольныйКадровыйПриказ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизвольныйКадровыйПриказ"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ПростойСотрудников" 

	Дано Я открываю основную форму списка документа "ПростойСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПростойСотрудников"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ПротоколОпросаУчастникаНесчастногоСлучая" 

	Дано Я открываю основную форму списка документа "ПротоколОпросаУчастникаНесчастногоСлучая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПротоколОпросаУчастникаНесчастногоСлучая"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПротоколОпросаУчастникаНесчастногоСлучая"

	Дано Я открываю основную форму документа "ПротоколОпросаУчастникаНесчастногоСлучая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПротоколОпросаУчастникаНесчастногоСлучая"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПубликацияМероприятияОбученияРазвития" 

	Дано Я открываю основную форму списка документа "ПубликацияМероприятияОбученияРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПубликацияМероприятияОбученияРазвития"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПубликацияМероприятияОбученияРазвития"

	Дано Я открываю основную форму документа "ПубликацияМероприятияОбученияРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПубликацияМероприятияОбученияРазвития"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаботаВВыходныеИПраздничныеДни" 

	Дано Я открываю основную форму списка документа "РаботаВВыходныеИПраздничныеДни"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаботаВВыходныеИПраздничныеДни"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаботаВВыходныеИПраздничныеДни"

	Дано Я открываю основную форму документа "РаботаВВыходныеИПраздничныеДни"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаботаВВыходныеИПраздничныеДни"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаботаСверхурочно" 

	Дано Я открываю основную форму списка документа "РаботаСверхурочно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаботаСверхурочно"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаботаСверхурочно"

	Дано Я открываю основную форму документа "РаботаСверхурочно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаботаСверхурочно"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазовоеНачисление" 

	Дано Я открываю основную форму списка документа "РазовоеНачисление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РазовоеНачисление"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазовоеНачисление"

	Дано Я открываю основную форму документа "РазовоеНачисление"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РазовоеНачисление"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеОсновногоЗаработка" 

	Дано Я открываю основную форму списка документа "РаспределениеОсновногоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеОсновногоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеОсновногоЗаработка"

	Дано Я открываю основную форму документа "РаспределениеОсновногоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеОсновногоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияПереработок" 

	Дано Я открываю основную форму списка документа "РегистрацияПереработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияПереработок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияПереработок"

	Дано Я открываю основную форму документа "РегистрацияПереработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияПереработок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияПрочихДоходов" 

	Дано Я открываю основную форму списка документа "РегистрацияПрочихДоходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияПрочихДоходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияПрочихДоходов"

	Дано Я открываю основную форму документа "РегистрацияПрочихДоходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияПрочихДоходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегламентированныйОтчет" 

	Дано Я открываю основную форму списка документа "РегламентированныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегламентированныйОтчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегламентированныйОтчет"

	Дано Я открываю основную форму документа "РегламентированныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегламентированныйОтчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрДанныхЭЛНЗаполняемыхРаботодателем" 

	Дано Я открываю основную форму списка документа "РеестрДанныхЭЛНЗаполняемыхРаботодателем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрДанныхЭЛНЗаполняемыхРаботодателем"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "РеестрДСВ_3" 

	Дано Я открываю основную форму списка документа "РеестрДСВ_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрДСВ_3"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрДСВ_3"

	Дано Я открываю основную форму документа "РеестрДСВ_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрДСВ_3"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий" 

	Дано Я открываю основную форму списка документа "РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий"

	Дано Я открываю основную форму документа "РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрСЗВ_6_2" 

	Дано Я открываю основную форму списка документа "РеестрСЗВ_6_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСЗВ_6_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрСЗВ_6_2"

	Дано Я открываю основную форму документа "РеестрСЗВ_6_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСЗВ_6_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыАттестацииСотрудников" 

	Дано Я открываю основную форму списка документа "РезультатыАттестацииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РезультатыАттестацииСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыАттестацииСотрудников"

	Дано Я открываю основную форму документа "РезультатыАттестацииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РезультатыАттестацииСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыСпецоценкиУсловийТруда" 

	Дано Я открываю основную форму списка документа "РезультатыСпецоценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РезультатыСпецоценкиУсловийТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыСпецоценкиУсловийТруда"

	Дано Я открываю основную форму документа "РезультатыСпецоценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РезультатыСпецоценкиУсловийТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОЗастрахованныхЛицахСЗВ_М" 

	Дано Я открываю основную форму списка документа "СведенияОЗастрахованныхЛицахСЗВ_М"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОЗастрахованныхЛицахСЗВ_М"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОЗастрахованныхЛицахСЗВ_М"

	Дано Я открываю основную форму документа "СведенияОЗастрахованныхЛицахСЗВ_М"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОЗастрахованныхЛицахСЗВ_М"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОНезачисленнойЗарплате" 

	Дано Я открываю основную форму списка документа "СведенияОНезачисленнойЗарплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОНезачисленнойЗарплате"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОНезачисленнойЗарплате"

	Дано Я открываю основную форму документа "СведенияОНезачисленнойЗарплате"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОНезачисленнойЗарплате"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Совмещение" 

	Дано Я открываю основную форму списка документа "Совмещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Совмещение"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "СогласиеНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласиеНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеSMS" 

	Дано Я открываю основную форму списка документа "СообщениеSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеSMS"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеSMS"

	Дано Я открываю основную форму документа "СообщениеSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеSMS"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеОбменСБанками" 

	Дано Я открываю основную форму списка документа "СообщениеОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеОбменСБанками"

	Дано Я открываю основную форму документа "СообщениеОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеОбОтсутствии" 

	Дано Я открываю основную форму списка документа "СообщениеОбОтсутствии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеОбОтсутствии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеОбОтсутствии"

	Дано Я открываю основную форму документа "СообщениеОбОтсутствии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеОбОтсутствии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеОНеправильныхДанныхСотрудника" 

	Дано Я открываю основную форму списка документа "СообщениеОНеправильныхДанныхСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеОНеправильныхДанныхСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеОНеправильныхДанныхСотрудника"

	Дано Я открываю основную форму документа "СообщениеОНеправильныхДанныхСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеОНеправильныхДанныхСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеДепонированнойЗарплаты" 

	Дано Я открываю основную форму списка документа "СписаниеДепонированнойЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеДепонированнойЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеДепонированнойЗарплаты"

	Дано Я открываю основную форму документа "СписаниеДепонированнойЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеДепонированнойЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкаНДФЛ" 

	Дано Я открываю основную форму списка документа "СправкаНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкаНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкаНДФЛ"

	Дано Я открываю основную форму документа "СправкаНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкаНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиНДФЛДляПередачиВНалоговыйОрган" 

	Дано Я открываю основную форму списка документа "СправкиНДФЛДляПередачиВНалоговыйОрган"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиНДФЛДляПередачиВНалоговыйОрган"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиНДФЛДляПередачиВНалоговыйОрган"

	Дано Я открываю основную форму документа "СправкиНДФЛДляПередачиВНалоговыйОрган"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиНДФЛДляПередачиВНалоговыйОрган"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль" 

	Дано Я открываю основную форму списка документа "СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль"

	Дано Я открываю основную форму документа "СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СторнированиеНачислений" 

	Дано Я открываю основную форму списка документа "СторнированиеНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СторнированиеНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СторнированиеНачислений"

	Дано Я открываю основную форму документа "СторнированиеНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СторнированиеНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТабельУчетаРабочегоВремени" 

	Дано Я открываю основную форму списка документа "ТабельУчетаРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТабельУчетаРабочегоВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТабельУчетаРабочегоВремени"

	Дано Я открываю основную форму документа "ТабельУчетаРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТабельУчетаРабочегоВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелефонныйЗвонок" 

	Дано Я открываю основную форму списка документа "ТелефонныйЗвонок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТелефонныйЗвонок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелефонныйЗвонок"

	Дано Я открываю основную форму документа "ТелефонныйЗвонок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТелефонныйЗвонок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортноеСообщение" 

	Дано Я открываю основную форму списка документа "ТранспортноеСообщение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортноеСообщение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОПравеНаИмущественныйВычетДляНДФЛ" 

	Дано Я открываю основную форму списка документа "УведомлениеОПравеНаИмущественныйВычетДляНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПравеНаИмущественныйВычетДляНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОПравеНаИмущественныйВычетДляНДФЛ"

	Дано Я открываю основную форму документа "УведомлениеОПравеНаИмущественныйВычетДляНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПравеНаИмущественныйВычетДляНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОСпецрежимахНалогообложения" 

	Дано Я открываю основную форму списка документа "УведомлениеОСпецрежимахНалогообложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОСпецрежимахНалогообложения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОСпецрежимахНалогообложения"

	Дано Я открываю основную форму документа "УведомлениеОСпецрежимахНалогообложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОСпецрежимахНалогообложения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Увольнение" 

	Дано Я открываю основную форму списка документа "Увольнение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Увольнение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Увольнение"

	Дано Я открываю основную форму документа "Увольнение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Увольнение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УвольнениеСписком" 

	Дано Я открываю основную форму списка документа "УвольнениеСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УвольнениеСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УвольнениеСписком"

	Дано Я открываю основную форму документа "УвольнениеСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УвольнениеСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП" 

	Дано Я открываю основную форму списка документа "УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"

	Дано Я открываю основную форму документа "УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика" 

	Дано Я открываю основную форму списка документа "УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"

	Дано Я открываю основную форму документа "УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗаявлениеАбонентаСпецоператораСвязи" 

	Дано Я открываю основную форму списка документа "УдалитьЗаявлениеАбонентаСпецоператораСвязи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗаявлениеАбонентаСпецоператораСвязи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗаявлениеАбонентаСпецоператораСвязи"

	Дано Я открываю основную форму документа "УдалитьЗаявлениеАбонентаСпецоператораСвязи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗаявлениеАбонентаСпецоператораСвязи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдержаниеВСчетРасчетовПоПрочимОперациям" 

	Дано Я открываю основную форму списка документа "УдержаниеВСчетРасчетовПоПрочимОперациям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдержаниеВСчетРасчетовПоПрочимОперациям"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "УдержаниеДобровольныхВзносовВНПФ" 

	Дано Я открываю основную форму списка документа "УдержаниеДобровольныхВзносовВНПФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдержаниеДобровольныхВзносовВНПФ"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "УдержаниеДобровольныхСтраховыхВзносов" 

	Дано Я открываю основную форму списка документа "УдержаниеДобровольныхСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдержаниеДобровольныхСтраховыхВзносов"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "УдержаниеПрофсоюзныхВзносов" 

	Дано Я открываю основную форму списка документа "УдержаниеПрофсоюзныхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдержаниеПрофсоюзныхВзносов"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "УплатаСтраховыхВзносовВФонды" 

	Дано Я открываю основную форму списка документа "УплатаСтраховыхВзносовВФонды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УплатаСтраховыхВзносовВФонды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УплатаСтраховыхВзносовВФонды"

	Дано Я открываю основную форму документа "УплатаСтраховыхВзносовВФонды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УплатаСтраховыхВзносовВФонды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УтверждениеТарифнойСетки" 

	Дано Я открываю основную форму списка документа "УтверждениеТарифнойСетки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УтверждениеТарифнойСетки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УтверждениеТарифнойСетки"

	Дано Я открываю основную форму документа "УтверждениеТарифнойСетки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УтверждениеТарифнойСетки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УтверждениеШтатногоРасписания" 

	Дано Я открываю основную форму списка документа "УтверждениеШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УтверждениеШтатногоРасписания"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "УченическийДоговор" 

	Дано Я открываю основную форму списка документа "УченическийДоговор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УченическийДоговор"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УченическийДоговор"

	Дано Я открываю основную форму документа "УченическийДоговор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УченическийДоговор"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФормированиеАттестационнойКомиссииСотрудников" 

	Дано Я открываю основную форму списка документа "ФормированиеАттестационнойКомиссииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ФормированиеАттестационнойКомиссииСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФормированиеАттестационнойКомиссииСотрудников"

	Дано Я открываю основную форму документа "ФормированиеАттестационнойКомиссииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ФормированиеАттестационнойКомиссииСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХодатайствоОБронированииГражданПребывающихВЗапасе" 

	Дано Я открываю основную форму списка документа "ХодатайствоОБронированииГражданПребывающихВЗапасе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ХодатайствоОБронированииГражданПребывающихВЗапасе"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХодатайствоОБронированииГражданПребывающихВЗапасе"

	Дано Я открываю основную форму документа "ХодатайствоОБронированииГражданПребывающихВЗапасе"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ХодатайствоОБронированииГражданПребывающихВЗапасе"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоВходящее" 

	Дано Я открываю основную форму списка документа "ЭлектронноеПисьмоВходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоВходящее"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоИсходящее" 

	Дано Я открываю основную форму списка документа "ЭлектронноеПисьмоИсходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоИсходящее"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоИсходящее"

	Дано Я открываю основную форму документа "ЭлектронноеПисьмоИсходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоИсходящее"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтменаПродажGate" 

	Дано Я открываю основную форму списка документа "ОтменаПродажGate"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаПродажGate"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтменаПродажGate"

	Дано Я открываю основную форму документа "ОтменаПродажGate"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтменаПродажGate"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Экспертиза" 

	Дано Я открываю основную форму списка документа "Экспертиза"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Экспертиза"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Экспертиза"

	Дано Я открываю основную форму документа "Экспертиза"
	Когда открылось окно '1С:Предприятие'
	И я нажимаю на кнопку с именем 'Button0'
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Экспертиза"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрВыплат" 

	Дано Я открываю основную форму списка документа "РеестрВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрВыплат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрВыплат"

	Дано Я открываю основную форму документа "РеестрВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрВыплат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаВыплату" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаВыплату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВыплату"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаВыплату"

	Дано Я открываю основную форму документа "ЗаявкаНаВыплату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВыплату"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияНДФЛИгроков" 

	Дано Я открываю основную форму списка документа "РегистрацияНДФЛИгроков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияНДФЛИгроков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияНДФЛИгроков"

	Дано Я открываю основную форму документа "РегистрацияНДФЛИгроков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияНДФЛИгроков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗагрузкаНеПроданныхБилетовМЛ" 

	Дано Я открываю основную форму списка документа "ЗагрузкаНеПроданныхБилетовМЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗагрузкаНеПроданныхБилетовМЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗагрузкаНеПроданныхБилетовМЛ"

	Дано Я открываю основную форму документа "ЗагрузкаНеПроданныхБилетовМЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗагрузкаНеПроданныхБилетовМЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикВыплат" 

	Дано Я открываю основную форму списка документа "ГрафикВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ГрафикВыплат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикВыплат"

	Дано Я открываю основную форму документа "ГрафикВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ГрафикВыплат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДФЛСВыигрышейВЛотереи" 

	Дано Я открываю основную форму списка документа "НДФЛСВыигрышейВЛотереи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НДФЛСВыигрышейВЛотереи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛСВыигрышейВЛотереи"

	Дано Я открываю основную форму документа "НДФЛСВыигрышейВЛотереи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НДФЛСВыигрышейВЛотереи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекККМ" 

	Дано Я открываю основную форму списка документа "ЧекККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекККМ"

	Дано Я открываю основную форму документа "ЧекККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассоваяСмена" 

	Дано Я открываю основную форму списка документа "КассоваяСмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КассоваяСмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассоваяСмена"

	Дано Я открываю основную форму документа "КассоваяСмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КассоваяСмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассовыйЧекКоррекции" 

	Дано Я открываю основную форму списка документа "КассовыйЧекКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КассовыйЧекКоррекции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассовыйЧекКоррекции"

	Дано Я открываю основную форму документа "КассовыйЧекКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КассовыйЧекКоррекции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыдачаВещевогоВыигрыша" 

	Дано Я открываю основную форму списка документа "ВыдачаВещевогоВыигрыша"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыдачаВещевогоВыигрыша"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыдачаВещевогоВыигрыша"

	Дано Я открываю основную форму документа "ВыдачаВещевогоВыигрыша"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыдачаВещевогоВыигрыша"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыплатыOrtax" 

	Дано Я открываю основную форму списка документа "ВыплатыOrtax"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыплатыOrtax"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатыOrtax"

	Дано Я открываю основную форму документа "ВыплатыOrtax"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыплатыOrtax"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеСтатусаБлокировки" 

	Дано Я открываю основную форму списка документа "ИзменениеСтатусаБлокировки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеСтатусаБлокировки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеСтатусаБлокировки"

	Дано Я открываю основную форму документа "ИзменениеСтатусаБлокировки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеСтатусаБлокировки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПочтовыеСообщения" 

	Дано Я открываю основную форму списка документа "ПочтовыеСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПочтовыеСообщения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПочтовыеСообщения"

	Дано Я открываю основную форму документа "ПочтовыеСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПочтовыеСообщения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегистрацияВыплатыВручную" 

	Дано Я открываю основную форму списка документа "РегистрацияВыплатыВручную"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияВыплатыВручную"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегистрацияВыплатыВручную"

	Дано Я открываю основную форму документа "РегистрацияВыплатыВручную"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегистрацияВыплатыВручную"
	И Я закрываю текущее окно

