#language: ru

@tree

Функциональность: Дымовые тесты "Регистр сведений"

Контекст:
	И Я открыл сеанс TestClient от имени "Администратор" с паролем "" или подключаю уже существующий
	И Я закрываю все окна клиентского приложения
	
Сценарий: Открытие формы списка "АдресныеОбъекты" 

	Дано Я открываю основную форму списка регистра сведений "АдресныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресныеОбъекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АдресныеОбъекты"

	Дано Я открываю основную форму регистра сведений "АдресныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресныеОбъекты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктивированныеАгентыРезервногоКопирования" 

	Дано Я открываю основную форму списка регистра сведений "АктивированныеАгентыРезервногоКопирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АктивированныеАгентыРезервногоКопирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктивированныеАгентыРезервногоКопирования"

	Дано Я открываю основную форму регистра сведений "АктивированныеАгентыРезервногоКопирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АктивированныеАгентыРезервногоКопирования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда" 

	Дано Я открываю основную форму списка регистра сведений "АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда"

	Дано Я открываю основную форму регистра сведений "АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АрхивДанныхРегламентированнойОтчетности" 

	Дано Я открываю основную форму списка регистра сведений "АрхивДанныхРегламентированнойОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АрхивДанныхРегламентированнойОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АрхивДанныхРегламентированнойОтчетности"

	Дано Я открываю основную форму регистра сведений "АрхивДанныхРегламентированнойОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АрхивДанныхРегламентированнойОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БезопасноеХранилищеДанных" 

	Дано Я открываю основную форму списка регистра сведений "БезопасноеХранилищеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БезопасноеХранилищеДанных"

	Дано Я открываю основную форму регистра сведений "БезопасноеХранилищеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БезопасноеХранилищеДанныхОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "БезопасноеХранилищеДанныхОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанныхОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БезопасноеХранилищеДанныхОбластейДанных"

	Дано Я открываю основную форму регистра сведений "БезопасноеХранилищеДанныхОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанныхОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БлокировкиСеансовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "БлокировкиСеансовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСеансовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БлокировкиСеансовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "БлокировкиСеансовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСеансовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БронированиеСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "БронированиеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БронированиеСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БронированиеСотрудников"

	Дано Я открываю основную форму регистра сведений "БронированиеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БронированиеСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БуферОперацийСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "БуферОперацийСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БуферОперацийСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БуферОперацийСтатистики"

	Дано Я открываю основную форму регистра сведений "БуферОперацийСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БуферОперацийСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетЗарплатыОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "БухучетЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетЗарплатыОрганизаций"

	Дано Я открываю основную форму регистра сведений "БухучетЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетЗарплатыПервичныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "БухучетЗарплатыПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыПервичныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетЗарплатыПервичныхДокументов"

	Дано Я открываю основную форму регистра сведений "БухучетЗарплатыПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыПервичныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетЗарплатыПодразделений" 

	Дано Я открываю основную форму списка регистра сведений "БухучетЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыПодразделений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетЗарплатыПодразделений"

	Дано Я открываю основную форму регистра сведений "БухучетЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыПодразделений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетЗарплатыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "БухучетЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетЗарплатыСотрудников"

	Дано Я открываю основную форму регистра сведений "БухучетЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетЗарплатыТерриторийВыполненияРабот" 

	Дано Я открываю основную форму списка регистра сведений "БухучетЗарплатыТерриторийВыполненияРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыТерриторийВыполненияРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетЗарплатыТерриторийВыполненияРабот"

	Дано Я открываю основную форму регистра сведений "БухучетЗарплатыТерриторийВыполненияРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетЗарплатыТерриторийВыполненияРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетПлановыхНачислений" 

	Дано Я открываю основную форму списка регистра сведений "БухучетПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетПлановыхНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетПлановыхНачислений"

	Дано Я открываю основную форму регистра сведений "БухучетПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетПлановыхНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БухучетРаспределениеОсновногоЗаработка" 

	Дано Я открываю основную форму списка регистра сведений "БухучетРаспределениеОсновногоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетРаспределениеОсновногоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БухучетРаспределениеОсновногоЗаработка"

	Дано Я открываю основную форму регистра сведений "БухучетРаспределениеОсновногоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БухучетРаспределениеОсновногоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВеличинаПрожиточногоМинимума" 

	Дано Я открываю основную форму списка регистра сведений "ВеличинаПрожиточногоМинимума"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВеличинаПрожиточногоМинимума"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВеличинаПрожиточногоМинимума"

	Дано Я открываю основную форму регистра сведений "ВеличинаПрожиточногоМинимума"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВеличинаПрожиточногоМинимума"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииОбъектов"

	Дано Я открываю основную форму регистра сведений "ВерсииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииПодсистем" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииПодсистем"

	Дано Я открываю основную форму регистра сведений "ВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииПодсистемОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииПодсистемОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистемОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииПодсистемОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ВерсииПодсистемОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистемОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВесЦелевыхПоказателей" 

	Дано Я открываю основную форму списка регистра сведений "ВесЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВесЦелевыхПоказателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВесЦелевыхПоказателей"

	Дано Я открываю основную форму регистра сведений "ВесЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВесЦелевыхПоказателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВложенияНеформализованныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ВложенияНеформализованныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВложенияНеформализованныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВложенияНеформализованныхДокументов"

	Дано Я открываю основную форму регистра сведений "ВложенияНеформализованныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВложенияНеформализованныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнеочередныеАттестацииСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ВнеочередныеАттестацииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВнеочередныеАттестацииСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнеочередныеАттестацииСотрудников"

	Дано Я открываю основную форму регистра сведений "ВнеочередныеАттестацииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВнеочередныеАттестацииСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВоинскийУчет" 

	Дано Я открываю основную форму списка регистра сведений "ВоинскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВоинскийУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВоинскийУчет"

	Дано Я открываю основную форму регистра сведений "ВоинскийУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВоинскийУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВопросыОценкиКомпетенций" 

	Дано Я открываю основную форму списка регистра сведений "ВопросыОценкиКомпетенций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВопросыОценкиКомпетенций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВопросыОценкиКомпетенций"

	Дано Я открываю основную форму регистра сведений "ВопросыОценкиКомпетенций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВопросыОценкиКомпетенций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам" 

	Дано Я открываю основную форму списка регистра сведений "ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам"

	Дано Я открываю основную форму регистра сведений "ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВремяРегистрацииДокументовПлановыхНачислений" 

	Дано Я открываю основную форму списка регистра сведений "ВремяРегистрацииДокументовПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВремяРегистрацииДокументовПлановыхНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВремяРегистрацииДокументовПлановыхНачислений"

	Дано Я открываю основную форму регистра сведений "ВремяРегистрацииДокументовПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВремяРегистрацииДокументовПлановыхНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВсеОбновленияНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ВсеОбновленияНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВсеОбновленияНовостей"

	Дано Я открываю основную форму регистра сведений "ВсеОбновленияНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВсеОбновленияОблачногоАрхива" 

	Дано Я открываю основную форму списка регистра сведений "ВсеОбновленияОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияОблачногоАрхива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВсеОбновленияОблачногоАрхива"

	Дано Я открываю основную форму регистра сведений "ВсеОбновленияОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВсеОбновленияОблачногоАрхива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВычетыПоДоходамНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "ВычетыПоДоходамНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВычетыПоДоходамНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВычетыПоДоходамНДФЛ"

	Дано Я открываю основную форму регистра сведений "ВычетыПоДоходамНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВычетыПоДоходамНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГражданствоФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ГражданствоФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГражданствоФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГражданствоФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ГражданствоФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГражданствоФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикиРаботыПоВидамВремени" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикиРаботыПоВидамВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикиРаботыПоВидамВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикиРаботыПоВидамВремени"

	Дано Я открываю основную форму регистра сведений "ГрафикиРаботыПоВидамВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикиРаботыПоВидамВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикРаботыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикРаботыСотрудников"

	Дано Я открываю основную форму регистра сведений "ГрафикРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикРаботыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикРаботыСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикРаботыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикРаботыСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикРаботыСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ГрафикРаботыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикРаботыСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрейдыПозиций" 

	Дано Я открываю основную форму списка регистра сведений "ГрейдыПозиций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрейдыПозиций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрейдыПозиций"

	Дано Я открываю основную форму регистра сведений "ГрейдыПозиций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрейдыПозиций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрейдыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ГрейдыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрейдыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрейдыСотрудников"

	Дано Я открываю основную форму регистра сведений "ГрейдыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрейдыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрейдыСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ГрейдыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрейдыСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрейдыСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ГрейдыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрейдыСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаБезОграниченийНаКоличествоСеансов" 

	Дано Я открываю основную форму списка регистра сведений "ГруппыДоступаБезОграниченийНаКоличествоСеансов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыДоступаБезОграниченийНаКоличествоСеансов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаБезОграниченийНаКоличествоСеансов"

	Дано Я открываю основную форму регистра сведений "ГруппыДоступаБезОграниченийНаКоличествоСеансов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыДоступаБезОграниченийНаКоличествоСеансов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаБезОграниченияПродолжительностиСеанса" 

	Дано Я открываю основную форму списка регистра сведений "ГруппыДоступаБезОграниченияПродолжительностиСеанса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыДоступаБезОграниченияПродолжительностиСеанса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаБезОграниченияПродолжительностиСеанса"

	Дано Я открываю основную форму регистра сведений "ГруппыДоступаБезОграниченияПродолжительностиСеанса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыДоступаБезОграниченияПродолжительностиСеанса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "ГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗначенийДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДампыПлатформы" 

	Дано Я открываю основную форму списка регистра сведений "ДампыПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДампыПлатформы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДампыПлатформы"

	Дано Я открываю основную форму регистра сведений "ДампыПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДампыПлатформы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеБизнесПроцессов" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеБизнесПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеБизнесПроцессов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеБизнесПроцессов"

	Дано Я открываю основную форму регистра сведений "ДанныеБизнесПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеБизнесПроцессов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеДляПодбораСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеДляПодбораСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеДляПодбораСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеДляПодбораСотрудников"

	Дано Я открываю основную форму регистра сведений "ДанныеДляПодбораСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеДляПодбораСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОбОплатеТрудаДляПодбораСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбОплатеТрудаДляПодбораСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбОплатеТрудаДляПодбораСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбОплатеТрудаДляПодбораСотрудников"

	Дано Я открываю основную форму регистра сведений "ДанныеОбОплатеТрудаДляПодбораСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбОплатеТрудаДляПодбораСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОбработанныеВЦентральномУзлеРИБ" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбработанныеВЦентральномУзлеРИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбработанныеВЦентральномУзлеРИБ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбработанныеВЦентральномУзлеРИБ"

	Дано Я открываю основную форму регистра сведений "ДанныеОбработанныеВЦентральномУзлеРИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбработанныеВЦентральномУзлеРИБ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОбъектовДляРегистрацииВОбменах" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбъектовДляРегистрацииВОбменах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбъектовДляРегистрацииВОбменах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбъектовДляРегистрацииВОбменах"

	Дано Я открываю основную форму регистра сведений "ДанныеОбъектовДляРегистрацииВОбменах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбъектовДляРегистрацииВОбменах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка"

	Дано Я открываю основную форму регистра сведений "ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОВремениДляРасчетаСреднегоФСС" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОВремениДляРасчетаСреднегоФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОВремениДляРасчетаСреднегоФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОВремениДляРасчетаСреднегоФСС"

	Дано Я открываю основную форму регистра сведений "ДанныеОВремениДляРасчетаСреднегоФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОВремениДляРасчетаСреднегоФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОВремениДляРасчетаСреднегоФССИспр" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОВремениДляРасчетаСреднегоФССИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОВремениДляРасчетаСреднегоФССИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОВремениДляРасчетаСреднегоФССИспр"

	Дано Я открываю основную форму регистра сведений "ДанныеОВремениДляРасчетаСреднегоФССИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОВремениДляРасчетаСреднегоФССИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПроизводственногоКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПроизводственногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПроизводственногоКалендаря"

	Дано Я открываю основную форму регистра сведений "ДанныеПроизводственногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаря"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПроизводственногоКалендаряПомесячно" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПроизводственногоКалендаряПомесячно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаряПомесячно"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПроизводственногоКалендаряПомесячно"

	Дано Я открываю основную форму регистра сведений "ДанныеПроизводственногоКалендаряПомесячно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаряПомесячно"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПубликацииВакансий" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПубликацииВакансий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПубликацииВакансий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПубликацииВакансий"

	Дано Я открываю основную форму регистра сведений "ДанныеПубликацииВакансий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПубликацииВакансий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПубликацииРезюме" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПубликацииРезюме"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПубликацииРезюме"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПубликацииРезюме"

	Дано Я открываю основную форму регистра сведений "ДанныеПубликацииРезюме"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПубликацииРезюме"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеСостоянийСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеСостоянийСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеСостоянийСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеСостоянийСотрудников"

	Дано Я открываю основную форму регистра сведений "ДанныеСостоянийСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеСостоянийСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеСостоянийСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеСостоянийСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеСостоянийСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеСостоянийСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ДанныеСостоянийСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеСостоянийСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыЗагрузкиПоследнихНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ДатыЗагрузкиПоследнихНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗагрузкиПоследнихНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыЗагрузкиПоследнихНовостей"

	Дано Я открываю основную форму регистра сведений "ДатыЗагрузкиПоследнихНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗагрузкиПоследнихНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыЗапретаИзменения" 

	Дано Я открываю основную форму списка регистра сведений "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаИзменения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму регистра сведений "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаИзменения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыОбновленияСтандартныхСписковНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ДатыОбновленияСтандартныхСписковНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыОбновленияСтандартныхСписковНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыОбновленияСтандартныхСписковНовостей"

	Дано Я открываю основную форму регистра сведений "ДатыОбновленияСтандартныхСписковНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыОбновленияСтандартныхСписковНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыОтправкиСообщенийСотрудникам" 

	Дано Я открываю основную форму списка регистра сведений "ДатыОтправкиСообщенийСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыОтправкиСообщенийСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыОтправкиСообщенийСотрудникам"

	Дано Я открываю основную форму регистра сведений "ДатыОтправкиСообщенийСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыОтправкиСообщенийСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыПоследнейЗагрузкиПочтовыхСообщений" 

	Дано Я открываю основную форму списка регистра сведений "ДатыПоследнейЗагрузкиПочтовыхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоследнейЗагрузкиПочтовыхСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыПоследнейЗагрузкиПочтовыхСообщений"

	Дано Я открываю основную форму регистра сведений "ДатыПоследнейЗагрузкиПочтовыхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоследнейЗагрузкиПочтовыхСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыПоТребованиюФНС" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыПоТребованиюФНС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыПоТребованиюФНС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыПоТребованиюФНС"

	Дано Я открываю основную форму регистра сведений "ДокументыПоТребованиюФНС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыПоТребованиюФНС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыСреднегоЗаработка" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыСреднегоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыСреднегоЗаработка"

	Дано Я открываю основную форму регистра сведений "ДокументыСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыСреднегоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДокументыФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ДокументыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ДокументыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДокументыФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДомаЗданияСтроения" 

	Дано Я открываю основную форму списка регистра сведений "ДомаЗданияСтроения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДомаЗданияСтроения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДомаЗданияСтроения"

	Дано Я открываю основную форму регистра сведений "ДомаЗданияСтроения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДомаЗданияСтроения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеАдресныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеАдресныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеАдресныеСведения"

	Дано Я открываю основную форму регистра сведений "ДополнительныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеАдресныеСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеНастройкиЗарплатаКадры" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеНастройкиЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеНастройкиЗарплатаКадры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеНастройкиЗарплатаКадры"

	Дано Я открываю основную форму регистра сведений "ДополнительныеНастройкиЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеНастройкиЗарплатаКадры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеРеквизитыУчетнойЗаписи" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеРеквизитыУчетнойЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеРеквизитыУчетнойЗаписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеРеквизитыУчетнойЗаписи"

	Дано Я открываю основную форму регистра сведений "ДополнительныеРеквизитыУчетнойЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеРеквизитыУчетнойЗаписи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеРеквизитыУчетнойЗаписиПолучатели" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеРеквизитыУчетнойЗаписиПолучатели"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеРеквизитыУчетнойЗаписиПолучатели"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеРеквизитыУчетнойЗаписиПолучатели"

	Дано Я открываю основную форму регистра сведений "ДополнительныеРеквизитыУчетнойЗаписиПолучатели"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеРеквизитыУчетнойЗаписиПолучатели"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеСведения"

	Дано Я открываю основную форму регистра сведений "ДополнительныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеФайлыРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеФайлыРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеФайлыРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеФайлыРегламентированныхОтчетов"

	Дано Я открываю основную форму регистра сведений "ДополнительныеФайлыРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеФайлыРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДопустимыеСочетанияКодовГруппСтажа" 

	Дано Я открываю основную форму списка регистра сведений "ДопустимыеСочетанияКодовГруппСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДопустимыеСочетанияКодовГруппСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДопустимыеСочетанияКодовГруппСтажа"

	Дано Я открываю основную форму регистра сведений "ДопустимыеСочетанияКодовГруппСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДопустимыеСочетанияКодовГруппСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоступныеВерсииАгентаКопированияОблачногоАрхива" 

	Дано Я открываю основную форму списка регистра сведений "ДоступныеВерсииАгентаКопированияОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступныеВерсииАгентаКопированияОблачногоАрхива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоступныеВерсииАгентаКопированияОблачногоАрхива"

	Дано Я открываю основную форму регистра сведений "ДоступныеВерсииАгентаКопированияОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоступныеВерсииАгентаКопированияОблачногоАрхива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоходыПредыдущегоМестаРаботыНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "ДоходыПредыдущегоМестаРаботыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоходыПредыдущегоМестаРаботыНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоходыПредыдущегоМестаРаботыНДФЛ"

	Дано Я открываю основную форму регистра сведений "ДоходыПредыдущегоМестаРаботыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДоходыПредыдущегоМестаРаботыНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналАудитаОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналАудитаОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналАудитаОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналАудитаОбменСБанками"

	Дано Я открываю основную форму регистра сведений "ЖурналАудитаОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналАудитаОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналНовыхСобытий" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналНовыхСобытий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналНовыхСобытий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналНовыхСобытий"

	Дано Я открываю основную форму регистра сведений "ЖурналНовыхСобытий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналНовыхСобытий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналОтправокВКонтролирующиеОрганы" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналОтправокВКонтролирующиеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналОтправокВКонтролирующиеОрганы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналОтправокВКонтролирующиеОрганы"

	Дано Я открываю основную форму регистра сведений "ЖурналОтправокВКонтролирующиеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналОтправокВКонтролирующиеОрганы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналОтчетовСтатусы" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналОтчетовСтатусы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналОтчетовСтатусы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналОтчетовСтатусы"

	Дано Я открываю основную форму регистра сведений "ЖурналОтчетовСтатусы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналОтчетовСтатусы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналРегистрацииАгентаКопированияОблачногоАрхива" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналРегистрацииАгентаКопированияОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналРегистрацииАгентаКопированияОблачногоАрхива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналРегистрацииАгентаКопированияОблачногоАрхива"

	Дано Я открываю основную форму регистра сведений "ЖурналРегистрацииАгентаКопированияОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналРегистрацииАгентаКопированияОблачногоАрхива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖурналСобытийОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ЖурналСобытийОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналСобытийОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖурналСобытийОбменСБанками"

	Дано Я открываю основную форму регистра сведений "ЖурналСобытийОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЖурналСобытийОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаблокированныеДляПолученияУчетныеЗаписи" 

	Дано Я открываю основную форму списка регистра сведений "ЗаблокированныеДляПолученияУчетныеЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаблокированныеДляПолученияУчетныеЗаписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаблокированныеДляПолученияУчетныеЗаписи"

	Дано Я открываю основную форму регистра сведений "ЗаблокированныеДляПолученияУчетныеЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаблокированныеДляПолученияУчетныеЗаписи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗависимостиПравДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ЗависимостиПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиПравДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗависимостиПравДоступа"

	Дано Я открываю основную форму регистра сведений "ЗависимостиПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиПравДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗагруженныеВерсииАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "ЗагруженныеВерсииАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗагруженныеВерсииАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗагруженныеВерсииАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "ЗагруженныеВерсииАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗагруженныеВерсииАдресныхСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыВремени" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыВремени"

	Дано Я открываю основную форму регистра сведений "ЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыВремениТехнологические" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремениТехнологические"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыВремениТехнологические"

	Дано Я открываю основную форму регистра сведений "ЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремениТехнологические"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыКомментарииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыКомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыКомментарииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыКомментарииСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыКомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыКомментарииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыОбластиСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОбластиСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыОбластиСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОбластиСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОперацииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов" 

	Дано Я открываю основную форму списка регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса" 

	Дано Я открываю основную форму списка регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"

	Дано Я открываю основную форму регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаработанныеПраваНаОтпуска" 

	Дано Я открываю основную форму списка регистра сведений "ЗаработанныеПраваНаОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаработанныеПраваНаОтпуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаработанныеПраваНаОтпуска"

	Дано Я открываю основную форму регистра сведений "ЗаработанныеПраваНаОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаработанныеПраваНаОтпуска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗарплатаКадрыДолиСписанияКосвенныхРасходов" 

	Дано Я открываю основную форму списка регистра сведений "ЗарплатаКадрыДолиСписанияКосвенныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗарплатаКадрыДолиСписанияКосвенныхРасходов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗарплатаКадрыДолиСписанияКосвенныхРасходов"

	Дано Я открываю основную форму регистра сведений "ЗарплатаКадрыДолиСписанияКосвенныхРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗарплатаКадрыДолиСписанияКосвенныхРасходов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗнаниеЯзыковФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ЗнаниеЯзыковФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗнаниеЯзыковФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗнаниеЯзыковФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ЗнаниеЯзыковФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗнаниеЯзыковФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияБазовыхТарифов" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияБазовыхТарифов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияБазовыхТарифов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияБазовыхТарифов"

	Дано Я открываю основную форму регистра сведений "ЗначенияБазовыхТарифов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияБазовыхТарифов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ЗначенияГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияГруппДоступаПоУмолчанию" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияГруппДоступаПоУмолчанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступаПоУмолчанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияГруппДоступаПоУмолчанию"

	Дано Я открываю основную форму регистра сведений "ЗначенияГруппДоступаПоУмолчанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступаПоУмолчанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций"

	Дано Я открываю основную форму регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений"

	Дано Я открываю основную форму регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников"

	Дано Я открываю основную форму регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя"

	Дано Я открываю основную форму регистра сведений "ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПоказателейЛьготСотрудникамПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПоказателейЛьготСотрудникамПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейЛьготСотрудникамПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПоказателейЛьготСотрудникамПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ЗначенияПоказателейЛьготСотрудникамПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейЛьготСотрудникамПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПоказателейНачислений" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПоказателейНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПоказателейНачислений"

	Дано Я открываю основную форму регистра сведений "ЗначенияПоказателейНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПоказателейРасчетаЗарплатыГрейдов" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПоказателейРасчетаЗарплатыГрейдов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейРасчетаЗарплатыГрейдов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПоказателейРасчетаЗарплатыГрейдов"

	Дано Я открываю основную форму регистра сведений "ЗначенияПоказателейРасчетаЗарплатыГрейдов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейРасчетаЗарплатыГрейдов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияПоказателейУдержаний" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияПоказателейУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейУдержаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияПоказателейУдержаний"

	Дано Я открываю основную форму регистра сведений "ЗначенияПоказателейУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияПоказателейУдержаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций"

	Дано Я открываю основную форму регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений"

	Дано Я открываю основную форму регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников"

	Дано Я открываю основную форму регистра сведений "ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСовокупныхТарифныхСтавокСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияСовокупныхТарифныхСтавокСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияСовокупныхТарифныхСтавокСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСовокупныхТарифныхСтавокСотрудников"

	Дано Я открываю основную форму регистра сведений "ЗначенияСовокупныхТарифныхСтавокСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияСовокупныхТарифныхСтавокСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСовокупныхТарифныхСтавокСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияСовокупныхТарифныхСтавокСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияСовокупныхТарифныхСтавокСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСовокупныхТарифныхСтавокСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ЗначенияСовокупныхТарифныхСтавокСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияСовокупныхТарифныхСтавокСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияТарифов" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияТарифов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияТарифов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияТарифов"

	Дано Я открываю основную форму регистра сведений "ЗначенияТарифов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияТарифов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияЦелевыхПоказателей" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияЦелевыхПоказателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияЦелевыхПоказателей"

	Дано Я открываю основную форму регистра сведений "ЗначенияЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияЦелевыхПоказателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияЦелевыхПоказателейПодразделений" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияЦелевыхПоказателейПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияЦелевыхПоказателейПодразделений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияЦелевыхПоказателейПодразделений"

	Дано Я открываю основную форму регистра сведений "ЗначенияЦелевыхПоказателейПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияЦелевыхПоказателейПодразделений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыОбъектовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыОбъектовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыОбъектовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыОбъектовВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыПолученныхЭлектронныхПисем" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыПолученныхЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыПолученныхЭлектронныхПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыПолученныхЭлектронныхПисем"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыПолученныхЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыПолученныхЭлектронныхПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеСведенийФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ИзменениеСведенийФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзменениеСведенийФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеСведенийФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ИзменениеСведенийФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзменениеСведенийФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзмененияОбщихДанныхУзлов" 

	Дано Я открываю основную форму списка регистра сведений "ИзмененияОбщихДанныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияОбщихДанныхУзлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзмененияОбщихДанныхУзлов"

	Дано Я открываю основную форму регистра сведений "ИзмененияОбщихДанныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияОбщихДанныхУзлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИндивидуальныеЛьготыФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ИндивидуальныеЛьготыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИндивидуальныеЛьготыФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИндивидуальныеЛьготыФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ИндивидуальныеЛьготыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИндивидуальныеЛьготыФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнструктажиПоОхранеТруда" 

	Дано Я открываю основную форму списка регистра сведений "ИнструктажиПоОхранеТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнструктажиПоОхранеТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнструктажиПоОхранеТруда"

	Дано Я открываю основную форму регистра сведений "ИнструктажиПоОхранеТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнструктажиПоОхранеТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнцидентыОграничениеСкоростиОтсылки" 

	Дано Я открываю основную форму списка регистра сведений "ИнцидентыОграничениеСкоростиОтсылки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОграничениеСкоростиОтсылки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнцидентыОграничениеСкоростиОтсылки"

	Дано Я открываю основную форму регистра сведений "ИнцидентыОграничениеСкоростиОтсылки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОграничениеСкоростиОтсылки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнцидентыОткрытые" 

	Дано Я открываю основную форму списка регистра сведений "ИнцидентыОткрытые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОткрытые"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнцидентыОткрытые"

	Дано Я открываю основную форму регистра сведений "ИнцидентыОткрытые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОткрытые"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнцидентыОтложенныеПроверки" 

	Дано Я открываю основную форму списка регистра сведений "ИнцидентыОтложенныеПроверки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОтложенныеПроверки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнцидентыОтложенныеПроверки"

	Дано Я открываю основную форму регистра сведений "ИнцидентыОтложенныеПроверки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИнцидентыОтложенныеПроверки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсполнителиЗадач" 

	Дано Я открываю основную форму списка регистра сведений "ИсполнителиЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсполнителиЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсполнителиЗадач"

	Дано Я открываю основную форму регистра сведений "ИсполнителиЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсполнителиЗадач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"

	Дано Я открываю основную форму регистра сведений "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеНачисленийПоказателейГрейдов" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеНачисленийПоказателейГрейдов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеНачисленийПоказателейГрейдов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеНачисленийПоказателейГрейдов"

	Дано Я открываю основную форму регистра сведений "ИспользованиеНачисленийПоказателейГрейдов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеНачисленийПоказателейГрейдов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям"

	Дано Я открываю основную форму регистра сведений "ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"

	Дано Я открываю основную форму регистра сведений "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеПоставляемыхРасширенийВОбластяхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеПоставляемыхРасширенийВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхРасширенийВОбластяхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеПоставляемыхРасширенийВОбластяхДанных"

	Дано Я открываю основную форму регистра сведений "ИспользованиеПоставляемыхРасширенийВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхРасширенийВОбластяхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "ИсторияАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияАдресныхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияЕжегодныхОтпусковПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияЕжегодныхОтпусковПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияЕжегодныхОтпусковПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияЕжегодныхОтпусковПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ИсторияЕжегодныхОтпусковПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияЕжегодныхОтпусковПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияИспользованияШтатногоРасписания" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияИспользованияШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияИспользованияШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияИспользованияШтатногоРасписания"

	Дано Я открываю основную форму регистра сведений "ИсторияИспользованияШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияИспользованияШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияКадровогоРезерва" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияКадровогоРезерва"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияКадровогоРезерва"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияКадровогоРезерва"

	Дано Я открываю основную форму регистра сведений "ИсторияКадровогоРезерва"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияКадровогоРезерва"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияНастроекРасчетаУправленческойЗарплатыПозицийШтатногоРасписания" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияНастроекРасчетаУправленческойЗарплатыПозицийШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияНастроекРасчетаУправленческойЗарплатыПозицийШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияНастроекРасчетаУправленческойЗарплатыПозицийШтатногоРасписания"

	Дано Я открываю основную форму регистра сведений "ИсторияНастроекРасчетаУправленческойЗарплатыПозицийШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияНастроекРасчетаУправленческойЗарплатыПозицийШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияНачисленийПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияНачисленийПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияНачисленийПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияНачисленийПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ИсторияНачисленийПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияНачисленийПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияПоказателейПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияПоказателейПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияПоказателейПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияПоказателейПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ИсторияПоказателейПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияПоказателейПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияРегистрацийВНалоговомОргане" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияРегистрацийВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияРегистрацийВНалоговомОргане"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияРегистрацийВНалоговомОргане"

	Дано Я открываю основную форму регистра сведений "ИсторияРегистрацийВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияРегистрацийВНалоговомОргане"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияРегистрацийВОрганеПФР" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияРегистрацийВОрганеПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияРегистрацийВОрганеПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияРегистрацийВОрганеПФР"

	Дано Я открываю основную форму регистра сведений "ИсторияРегистрацийВОрганеПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияРегистрацийВОрганеПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияСпециальностейПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияСпециальностейПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияСпециальностейПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияСпециальностейПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ИсторияСпециальностейПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияСпециальностейПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияУправленческихНачисленийПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияУправленческихНачисленийПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияУправленческихНачисленийПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияУправленческихНачисленийПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ИсторияУправленческихНачисленийПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияУправленческихНачисленийПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияУправленческихПоказателейПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияУправленческихПоказателейПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияУправленческихПоказателейПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияУправленческихПоказателейПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ИсторияУправленческихПоказателейПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияУправленческихПоказателейПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадроваяИсторияСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "КадроваяИсторияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадроваяИсторияСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадроваяИсторияСотрудников"

	Дано Я открываю основную форму регистра сведений "КадроваяИсторияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадроваяИсторияСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадроваяИсторияСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "КадроваяИсторияСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадроваяИсторияСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадроваяИсторияСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "КадроваяИсторияСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадроваяИсторияСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыеПриказыЗаявокСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "КадровыеПриказыЗаявокСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадровыеПриказыЗаявокСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыеПриказыЗаявокСотрудников"

	Дано Я открываю основную форму регистра сведений "КадровыеПриказыЗаявокСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадровыеПриказыЗаявокСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровыйРезерв" 

	Дано Я открываю основную форму списка регистра сведений "КадровыйРезерв"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадровыйРезерв"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровыйРезерв"

	Дано Я открываю основную форму регистра сведений "КадровыйРезерв"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КадровыйРезерв"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНовостейИнтервалыВерсий" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииНовостейИнтервалыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейИнтервалыВерсий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНовостейИнтервалыВерсий"

	Дано Я открываю основную форму регистра сведений "КатегорииНовостейИнтервалыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейИнтервалыВерсий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНовостейИнтервалыВерсийНеобработанные" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииНовостейИнтервалыВерсийНеобработанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейИнтервалыВерсийНеобработанные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНовостейИнтервалыВерсийНеобработанные"

	Дано Я открываю основную форму регистра сведений "КатегорииНовостейИнтервалыВерсийНеобработанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейИнтервалыВерсийНеобработанные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНовостейПростые" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииНовостейПростые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейПростые"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНовостейПростые"

	Дано Я открываю основную форму регистра сведений "КатегорииНовостейПростые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейПростые"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНовостейПростыеНеобработанные" 

	Дано Я открываю основную форму списка регистра сведений "КатегорииНовостейПростыеНеобработанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейПростыеНеобработанные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНовостейПростыеНеобработанные"

	Дано Я открываю основную форму регистра сведений "КатегорииНовостейПростыеНеобработанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КатегорииНовостейПростыеНеобработанные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассыУсловийТрудаПоДолжностям" 

	Дано Я открываю основную форму списка регистра сведений "КлассыУсловийТрудаПоДолжностям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлассыУсловийТрудаПоДолжностям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассыУсловийТрудаПоДолжностям"

	Дано Я открываю основную форму регистра сведений "КлассыУсловийТрудаПоДолжностям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлассыУсловийТрудаПоДолжностям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КодировкиВерсийФайлов" 

	Дано Я открываю основную форму списка регистра сведений "КодировкиВерсийФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодировкиВерсийФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КодировкиВерсийФайлов"

	Дано Я открываю основную форму регистра сведений "КодировкиВерсийФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодировкиВерсийФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоличествоОдновременныхСеансовГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "КоличествоОдновременныхСеансовГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КоличествоОдновременныхСеансовГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоличествоОдновременныхСеансовГруппДоступа"

	Дано Я открываю основную форму регистра сведений "КоличествоОдновременныхСеансовГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КоличествоОдновременныхСеансовГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомандировкаОснования" 

	Дано Я открываю основную форму списка регистра сведений "КомандировкаОснования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомандировкаОснования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомандировкаОснования"

	Дано Я открываю основную форму регистра сведений "КомандировкаОснования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомандировкаОснования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомандировкиСотрудниковОснования" 

	Дано Я открываю основную форму списка регистра сведений "КомандировкиСотрудниковОснования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомандировкиСотрудниковОснования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомандировкиСотрудниковОснования"

	Дано Я открываю основную форму регистра сведений "КомандировкиСотрудниковОснования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомандировкиСотрудниковОснования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомментарииОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "КомментарииОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомментарииОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "КомментарииОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииОперацииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомментарииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "КомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомментарииСтатистики"

	Дано Я открываю основную форму регистра сведений "КомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтактыВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "КонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтактыВзаимодействий"

	Дано Я открываю основную форму регистра сведений "КонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректирующиеФормыРСВ_1" 

	Дано Я открываю основную форму списка регистра сведений "КорректирующиеФормыРСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КорректирующиеФормыРСВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректирующиеФормыРСВ_1"

	Дано Я открываю основную форму регистра сведений "КорректирующиеФормыРСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КорректирующиеФормыРСВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КоэффициентИндексацииЗаработка" 

	Дано Я открываю основную форму списка регистра сведений "КоэффициентИндексацииЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КоэффициентИндексацииЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КоэффициентИндексацииЗаработка"

	Дано Я открываю основную форму регистра сведений "КоэффициентИндексацииЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КоэффициентИндексацииЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КурсыВалют" 

	Дано Я открываю основную форму списка регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КурсыВалют"

	Дано Я открываю основную форму регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшПрограммныхИнтерфейсов" 

	Дано Я открываю основную форму списка регистра сведений "КэшПрограммныхИнтерфейсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПрограммныхИнтерфейсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшПрограммныхИнтерфейсов"

	Дано Я открываю основную форму регистра сведений "КэшПрограммныхИнтерфейсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПрограммныхИнтерфейсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛимитыЛьготСотрудникамПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ЛимитыЛьготСотрудникамПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЛимитыЛьготСотрудникамПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛимитыЛьготСотрудникамПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ЛимитыЛьготСотрудникамПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЛимитыЛьготСотрудникамПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам" 

	Дано Я открываю основную форму списка регистра сведений "ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"

	Дано Я открываю основную форму регистра сведений "ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаксимальныйРазмерЕжемесячнойСтраховойВыплаты" 

	Дано Я открываю основную форму списка регистра сведений "МаксимальныйРазмерЕжемесячнойСтраховойВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МаксимальныйРазмерЕжемесячнойСтраховойВыплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаксимальныйРазмерЕжемесячнойСтраховойВыплаты"

	Дано Я открываю основную форму регистра сведений "МаксимальныйРазмерЕжемесячнойСтраховойВыплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МаксимальныйРазмерЕжемесячнойСтраховойВыплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МестаВыплатыЗарплатыОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "МестаВыплатыЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестаВыплатыЗарплатыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МестаВыплатыЗарплатыОрганизаций"

	Дано Я открываю основную форму регистра сведений "МестаВыплатыЗарплатыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестаВыплатыЗарплатыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МестаВыплатыЗарплатыПодразделений" 

	Дано Я открываю основную форму списка регистра сведений "МестаВыплатыЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестаВыплатыЗарплатыПодразделений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МестаВыплатыЗарплатыПодразделений"

	Дано Я открываю основную форму регистра сведений "МестаВыплатыЗарплатыПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестаВыплатыЗарплатыПодразделений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МестаВыплатыЗарплатыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "МестаВыплатыЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестаВыплатыЗарплатыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МестаВыплатыЗарплатыСотрудников"

	Дано Я открываю основную форму регистра сведений "МестаВыплатыЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестаВыплатыЗарплатыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия" 

	Дано Я открываю основную форму списка регистра сведений "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестоПозицииШтатногоРасписанияВСтруктуреПредприятия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия"

	Дано Я открываю основную форму регистра сведений "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МестоПозицииШтатногоРасписанияВСтруктуреПредприятия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МинимальнаяОплатаТрудаРФ" 

	Дано Я открываю основную форму списка регистра сведений "МинимальнаяОплатаТрудаРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МинимальнаяОплатаТрудаРФ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МинимальнаяОплатаТрудаРФ"

	Дано Я открываю основную форму регистра сведений "МинимальнаяОплатаТрудаРФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МинимальнаяОплатаТрудаРФ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "НаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаборыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "НаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаборыЗначенийДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаградыФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "НаградыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаградыФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаградыФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "НаградыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаградыФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеДополнительныхОбработок" 

	Дано Я открываю основную форму списка регистра сведений "НазначениеДополнительныхОбработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НазначениеДополнительныхОбработок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеДополнительныхОбработок"

	Дано Я открываю основную форму регистра сведений "НазначениеДополнительныхОбработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НазначениеДополнительныхОбработок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаличиеПрисоединенныхФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НаличиеПрисоединенныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеПрисоединенныхФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаличиеПрисоединенныхФайлов"

	Дано Я открываю основную форму регистра сведений "НаличиеПрисоединенныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеПрисоединенныхФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НапоминанияПользователя" 

	Дано Я открываю основную форму списка регистра сведений "НапоминанияПользователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НапоминанияПользователя"

	Дано Я открываю основную форму регистра сведений "НапоминанияПользователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаследованиеНастроекПравОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НаследованиеНастроекПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаследованиеНастроекПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаследованиеНастроекПравОбъектов"

	Дано Я открываю основную форму регистра сведений "НаследованиеНастроекПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаследованиеНастроекПравОбъектов"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "НастройкиВариантовОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВариантовОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВариантовОтчетов"

	Дано Я открываю основную форму регистра сведений "НастройкиВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВариантовОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВерсионированияОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВерсионированияОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВзаимодействияСРекрутинговымиСайтами" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВзаимодействияСРекрутинговымиСайтами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВзаимодействияСРекрутинговымиСайтами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВзаимодействияСРекрутинговымиСайтами"

	Дано Я открываю основную форму регистра сведений "НастройкиВзаимодействияСРекрутинговымиСайтами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВзаимодействияСРекрутинговымиСайтами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВоинскогоУчета" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВоинскогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВоинскогоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВоинскогоУчета"

	Дано Я открываю основную форму регистра сведений "НастройкиВоинскогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВоинскогоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиГрейдов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиГрейдов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиГрейдов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиГрейдов"

	Дано Я открываю основную форму регистра сведений "НастройкиГрейдов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиГрейдов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЗаймовСотрудникам" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЗаймовСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗаймовСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЗаймовСотрудникам"

	Дано Я открываю основную форму регистра сведений "НастройкиЗаймовСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗаймовСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЗарплатаКадры" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗарплатаКадры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЗарплатаКадры"

	Дано Я открываю основную форму регистра сведений "НастройкиЗарплатаКадры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗарплатаКадры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЗарплатаКадрыРасширенная" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЗарплатаКадрыРасширенная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗарплатаКадрыРасширенная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЗарплатаКадрыРасширенная"

	Дано Я открываю основную форму регистра сведений "НастройкиЗарплатаКадрыРасширенная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЗарплатаКадрыРасширенная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиИнтеграцииРекрутинговыхСайтов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиИнтеграцииРекрутинговыхСайтов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИнтеграцииРекрутинговыхСайтов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиИнтеграцииРекрутинговыхСайтов"

	Дано Я открываю основную форму регистра сведений "НастройкиИнтеграцииРекрутинговыхСайтов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИнтеграцииРекрутинговыхСайтов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиИнтеграцииСоСпринтером" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиИнтеграцииСоСпринтером"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИнтеграцииСоСпринтером"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиИнтеграцииСоСпринтером"

	Дано Я открываю основную форму регистра сведений "НастройкиИнтеграцииСоСпринтером"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИнтеграцииСоСпринтером"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда"

	Дано Я открываю основную форму регистра сведений "НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиКадровогоРезерва" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиКадровогоРезерва"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКадровогоРезерва"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиКадровогоРезерва"

	Дано Я открываю основную форму регистра сведений "НастройкиКадровогоРезерва"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКадровогоРезерва"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиКадровогоУчета" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиКадровогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКадровогоУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиКадровогоУчета"

	Дано Я открываю основную форму регистра сведений "НастройкиКадровогоУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКадровогоУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиКлючевыхПоказателейЭффективности" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиКлючевыхПоказателейЭффективности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКлючевыхПоказателейЭффективности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиКлючевыхПоказателейЭффективности"

	Дано Я открываю основную форму регистра сведений "НастройкиКлючевыхПоказателейЭффективности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКлючевыхПоказателейЭффективности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиКомандПечати" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиКомандПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКомандПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиКомандПечати"

	Дано Я открываю основную форму регистра сведений "НастройкиКомандПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКомандПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЛьготСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиЛьготСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЛьготСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЛьготСотрудников"

	Дано Я открываю основную форму регистра сведений "НастройкиЛьготСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиЛьготСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиМногопотоковогоЗаполненияДокументов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиМногопотоковогоЗаполненияДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиМногопотоковогоЗаполненияДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиМногопотоковогоЗаполненияДокументов"

	Дано Я открываю основную форму регистра сведений "НастройкиМногопотоковогоЗаполненияДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиМногопотоковогоЗаполненияДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиНесчастныхСлучаевНаПроизводстве" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиНесчастныхСлучаевНаПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиНесчастныхСлучаевНаПроизводстве"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиНесчастныхСлучаевНаПроизводстве"

	Дано Я открываю основную форму регистра сведений "НастройкиНесчастныхСлучаевНаПроизводстве"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиНесчастныхСлучаевНаПроизводстве"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОблачногоАрхиваНаЛокальномКомпьютере" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОблачногоАрхиваНаЛокальномКомпьютере"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОблачногоАрхиваНаЛокальномКомпьютере"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОблачногоАрхиваНаЛокальномКомпьютере"

	Дано Я открываю основную форму регистра сведений "НастройкиОблачногоАрхиваНаЛокальномКомпьютере"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОблачногоАрхиваНаЛокальномКомпьютере"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаРПН" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаРПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаРПН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаРПН"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаРПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаРПН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаФСРАР" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаФСРАР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаФСРАР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаФСРАР"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаФСРАР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаФСРАР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаФСС" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаФСС"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаФТС" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаФТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаФТС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаФТС"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаФТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаФТС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбученияРазвития" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбученияРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбученияРазвития"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбученияРазвития"

	Дано Я открываю основную форму регистра сведений "НастройкиОбученияРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбученияРазвития"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОтправителя" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОтправителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправителя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОтправителя"

	Дано Я открываю основную форму регистра сведений "НастройкиОтправителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправителя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОтраженияДокументовВУчетеСтраховыхВзносов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОтраженияДокументовВУчетеСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтраженияДокументовВУчетеСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОтраженияДокументовВУчетеСтраховыхВзносов"

	Дано Я открываю основную форму регистра сведений "НастройкиОтраженияДокументовВУчетеСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтраженияДокументовВУчетеСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОценкиПерсонала" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОценкиПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОценкиПерсонала"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОценкиПерсонала"

	Дано Я открываю основную форму регистра сведений "НастройкиОценкиПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОценкиПерсонала"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОчисткиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОчисткиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОчисткиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОчисткиФайлов"

	Дано Я открываю основную форму регистра сведений "НастройкиОчисткиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОчисткиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПодбораПерсонала" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПодбораПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПодбораПерсонала"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПодбораПерсонала"

	Дано Я открываю основную форму регистра сведений "НастройкиПодбораПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПодбораПерсонала"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПользователейБИП" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПользователейБИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПользователейБИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПользователейБИП"

	Дано Я открываю основную форму регистра сведений "НастройкиПользователейБИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПользователейБИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПравОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПравОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПравОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПроверкиОтчетностиПерсУчета" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПроверкиОтчетностиПерсУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПроверкиОтчетностиПерсУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПроверкиОтчетностиПерсУчета"

	Дано Я открываю основную форму регистра сведений "НастройкиПроверкиОтчетностиПерсУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПроверкиОтчетностиПерсУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРасчетаЗарплатыРасширенный" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиРасчетаЗарплатыРасширенный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаЗарплатыРасширенный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРасчетаЗарплатыРасширенный"

	Дано Я открываю основную форму регистра сведений "НастройкиРасчетаЗарплатыРасширенный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаЗарплатыРасширенный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРасчетаРезервовОтпусков" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиРасчетаРезервовОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаРезервовОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРасчетаРезервовОтпусков"

	Дано Я открываю основную форму регистра сведений "НастройкиРасчетаРезервовОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаРезервовОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРасчетаСреднегоЗаработка" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиРасчетаСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаСреднегоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРасчетаСреднегоЗаработка"

	Дано Я открываю основную форму регистра сведений "НастройкиРасчетаСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаСреднегоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРасчетаУправленческойЗарплатыПозицийШтатногоРасписания" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиРасчетаУправленческойЗарплатыПозицийШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаУправленческойЗарплатыПозицийШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРасчетаУправленческойЗарплатыПозицийШтатногоРасписания"

	Дано Я открываю основную форму регистра сведений "НастройкиРасчетаУправленческойЗарплатыПозицийШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРасчетаУправленческойЗарплатыПозицийШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиСамообслуживанияСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСамообслуживанияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСамообслуживанияСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСамообслуживанияСотрудников"

	Дано Я открываю основную форму регистра сведений "НастройкиСамообслуживанияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСамообслуживанияСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСинхронизацииФайлов"

	Дано Я открываю основную форму регистра сведений "НастройкиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСинхронизацииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиСпециальнойОценкиУсловийТруда" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСпециальнойОценкиУсловийТруда"

	Дано Я открываю основную форму регистра сведений "НастройкиСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиСтатистикиПерсонала" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСтатистикиПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСтатистикиПерсонала"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСтатистикиПерсонала"

	Дано Я открываю основную форму регистра сведений "НастройкиСтатистикиПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСтатистикиПерсонала"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбмена" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбмена"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаОбластейДанных"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаОбластиДанных"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетаВремени" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетаВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетаВремени"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетаВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетаПособийСоциальногоСтрахования" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетаПособийСоциальногоСтрахования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаПособийСоциальногоСтрахования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетаПособийСоциальногоСтрахования"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетаПособийСоциальногоСтрахования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаПособийСоциальногоСтрахования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетаСтраховыхВзносов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетаСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетаСтраховыхВзносов"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетаСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетаСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетныхЗаписейЭлектроннойПочты" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетныхЗаписейЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхЗаписейЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетныхЗаписейЭлектроннойПочты"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетныхЗаписейЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхЗаписейЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиШтатногоРасписания" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиШтатногоРасписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиШтатногоРасписания"

	Дано Я открываю основную форму регистра сведений "НастройкиШтатногоРасписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиШтатногоРасписания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачальныеОстаткиОтпусков" 

	Дано Я открываю основную форму списка регистра сведений "НачальныеОстаткиОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачальныеОстаткиОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачальныеОстаткиОтпусков"

	Дано Я открываю основную форму регистра сведений "НачальныеОстаткиОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НачальныеОстаткиОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НеобходимыеКорректировкиСтажаПФР" 

	Дано Я открываю основную форму списка регистра сведений "НеобходимыеКорректировкиСтажаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеобходимыеКорректировкиСтажаПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НеобходимыеКорректировкиСтажаПФР"

	Дано Я открываю основную форму регистра сведений "НеобходимыеКорректировкиСтажаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеобходимыеКорректировкиСтажаПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма" 

	Дано Я открываю основную форму списка регистра сведений "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"

	Дано Я открываю основную форму регистра сведений "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НеразделенныеПользователи" 

	Дано Я открываю основную форму списка регистра сведений "НеразделенныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеразделенныеПользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НеразделенныеПользователи"

	Дано Я открываю основную форму регистра сведений "НеразделенныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеразделенныеПользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НомераОтсканированныхФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НомераОтсканированныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераОтсканированныхФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НомераОтсканированныхФайлов"

	Дано Я открываю основную форму регистра сведений "НомераОтсканированныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераОтсканированныхФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НомераРабочихМестСпециальнойОценкиУсловийТруда" 

	Дано Я открываю основную форму списка регистра сведений "НомераРабочихМестСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераРабочихМестСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НомераРабочихМестСпециальнойОценкиУсловийТруда"

	Дано Я открываю основную форму регистра сведений "НомераРабочихМестСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераРабочихМестСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НумераторПачекПФР" 

	Дано Я открываю основную форму списка регистра сведений "НумераторПачекПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НумераторПачекПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НумераторПачекПФР"

	Дано Я открываю основную форму регистра сведений "НумераторПачекПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НумераторПачекПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "ОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиСтатистики"

	Дано Я открываю основную форму регистра сведений "ОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиТребующиеОбработкиПоставляемыхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиТребующиеОбработкиПоставляемыхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиТребующиеОбработкиПоставляемыхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиТребующиеОбработкиПоставляемыхДанных"

	Дано Я открываю основную форму регистра сведений "ОбластиТребующиеОбработкиПоставляемыхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиТребующиеОбработкиПоставляемыхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбработчикиСобытийСинхронизацииДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбработчикиСобытийСинхронизацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиСобытийСинхронизацииДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбработчикиСобытийСинхронизацииДанных"

	Дано Я открываю основную форму регистра сведений "ОбработчикиСобытийСинхронизацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиСобытийСинхронизацииДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбразованиеФизическихЛицОснования" 

	Дано Я открываю основную форму списка регистра сведений "ОбразованиеФизическихЛицОснования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбразованиеФизическихЛицОснования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбразованиеФизическихЛицОснования"

	Дано Я открываю основную форму регистра сведений "ОбразованиеФизическихЛицОснования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбразованиеФизическихЛицОснования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбучениеСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ОбучениеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбучениеСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбучениеСотрудников"

	Дано Я открываю основную форму регистра сведений "ОбучениеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбучениеСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеНастройкиУзловИнформационныхБаз" 

	Дано Я открываю основную форму списка регистра сведений "ОбщиеНастройкиУзловИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеНастройкиУзловИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеНастройкиУзловИнформационныхБаз"

	Дано Я открываю основную форму регистра сведений "ОбщиеНастройкиУзловИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеНастройкиУзловИнформационныхБаз"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъектыИнтегрированныеС1СДокументооборотом" 

	Дано Я открываю основную форму списка регистра сведений "ОбъектыИнтегрированныеС1СДокументооборотом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыИнтегрированныеС1СДокументооборотом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыИнтегрированныеС1СДокументооборотом"

	Дано Я открываю основную форму регистра сведений "ОбъектыИнтегрированныеС1СДокументооборотом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбъектыИнтегрированныеС1СДокументооборотом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОграничениеФОТГрейдов" 

	Дано Я открываю основную форму списка регистра сведений "ОграничениеФОТГрейдов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОграничениеФОТГрейдов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОграничениеФОТГрейдов"

	Дано Я открываю основную форму регистра сведений "ОграничениеФОТГрейдов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОграничениеФОТГрейдов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацииРасчетаЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииРасчетаЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацииРасчетаЗарплаты"

	Дано Я открываю основную форму регистра сведений "ОперацииРасчетаЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииРасчетаЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "ОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплатаВедомостейНаВыплатуЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "ОплатаВедомостейНаВыплатуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОплатаВедомостейНаВыплатуЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаВедомостейНаВыплатуЗарплаты"

	Дано Я открываю основную форму регистра сведений "ОплатаВедомостейНаВыплатуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОплатаВедомостейНаВыплатуЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплаченныеДоговоры" 

	Дано Я открываю основную форму списка регистра сведений "ОплаченныеДоговоры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОплаченныеДоговоры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплаченныеДоговоры"

	Дано Я открываю основную форму регистра сведений "ОплаченныеДоговоры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОплаченныеДоговоры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОриентирыАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ОриентирыАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОриентирыАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОриентирыАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "ОриентирыАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОриентирыАдресныхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсновныеДанныеКонтрактаДоговораСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "ОсновныеДанныеКонтрактаДоговораСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеДанныеКонтрактаДоговораСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсновныеДанныеКонтрактаДоговораСотрудника"

	Дано Я открываю основную форму регистра сведений "ОсновныеДанныеКонтрактаДоговораСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеДанныеКонтрактаДоговораСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсновныеДанныеКонтрактаДоговораСотрудникаИспр" 

	Дано Я открываю основную форму списка регистра сведений "ОсновныеДанныеКонтрактаДоговораСотрудникаИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеДанныеКонтрактаДоговораСотрудникаИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсновныеДанныеКонтрактаДоговораСотрудникаИспр"

	Дано Я открываю основную форму регистра сведений "ОсновныеДанныеКонтрактаДоговораСотрудникаИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОсновныеДанныеКонтрактаДоговораСотрудникаИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтборыПоЛентамНовостейОбщие" 

	Дано Я открываю основную форму списка регистра сведений "ОтборыПоЛентамНовостейОбщие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейОбщие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтборыПоЛентамНовостейОбщие"

	Дано Я открываю основную форму регистра сведений "ОтборыПоЛентамНовостейОбщие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейОбщие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтборыПоЛентамНовостейПользовательские" 

	Дано Я открываю основную форму списка регистра сведений "ОтборыПоЛентамНовостейПользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейПользовательские"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтборыПоЛентамНовостейПользовательские"

	Дано Я открываю основную форму регистра сведений "ОтборыПоЛентамНовостейПользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтборыПоЛентамНовостейПользовательские"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветыНаВопросыАнкет" 

	Дано Я открываю основную форму списка регистра сведений "ОтветыНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаВопросыАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветыНаВопросыАнкет"

	Дано Я открываю основную форму регистра сведений "ОтветыНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаВопросыАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП" 

	Дано Я открываю основную форму списка регистра сведений "ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"

	Дано Я открываю основную форму регистра сведений "ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветыНаЗапросыИОН" 

	Дано Я открываю основную форму списка регистра сведений "ОтветыНаЗапросыИОН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаЗапросыИОН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветыНаЗапросыИОН"

	Дано Я открываю основную форму регистра сведений "ОтветыНаЗапросыИОН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаЗапросыИОН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветыНаЗапросыИОС" 

	Дано Я открываю основную форму списка регистра сведений "ОтветыНаЗапросыИОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаЗапросыИОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветыНаЗапросыИОС"

	Дано Я открываю основную форму регистра сведений "ОтветыНаЗапросыИОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаЗапросыИОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОткликиКандидатов" 

	Дано Я открываю основную форму списка регистра сведений "ОткликиКандидатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОткликиКандидатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОткликиКандидатов"

	Дано Я открываю основную форму регистра сведений "ОткликиКандидатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОткликиКандидатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОткликиНаПубликациюМероприятияОбученияРазвития" 

	Дано Я открываю основную форму списка регистра сведений "ОткликиНаПубликациюМероприятияОбученияРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОткликиНаПубликациюМероприятияОбученияРазвития"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОткликиНаПубликациюМероприятияОбученияРазвития"

	Дано Я открываю основную форму регистра сведений "ОткликиНаПубликациюМероприятияОбученияРазвития"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОткликиНаПубликациюМероприятияОбученияРазвития"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтключенныеЛентыНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ОтключенныеЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеЛентыНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтключенныеЛентыНовостей"

	Дано Я открываю основную форму регистра сведений "ОтключенныеЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтключенныеЛентыНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтложенноеОткрытиеЛицевыхСчетовСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ОтложенноеОткрытиеЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтложенноеОткрытиеЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтложенноеОткрытиеЛицевыхСчетовСотрудников"

	Дано Я открываю основную форму регистра сведений "ОтложенноеОткрытиеЛицевыхСчетовСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтложенноеОткрытиеЛицевыхСчетовСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиОтчетностиКОбработке" 

	Дано Я открываю основную форму списка регистра сведений "ОтправкиОтчетностиКОбработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтправкиОтчетностиКОбработке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиОтчетностиКОбработке"

	Дано Я открываю основную форму регистра сведений "ОтправкиОтчетностиКОбработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтправкиОтчетностиКОбработке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускаСотрудниковОснования" 

	Дано Я открываю основную форму списка регистра сведений "ОтпускаСотрудниковОснования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтпускаСотрудниковОснования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускаСотрудниковОснования"

	Дано Я открываю основную форму регистра сведений "ОтпускаСотрудниковОснования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтпускаСотрудниковОснования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтпускОснования" 

	Дано Я открываю основную форму списка регистра сведений "ОтпускОснования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтпускОснования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтпускОснования"

	Дано Я открываю основную форму регистра сведений "ОтпускОснования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтпускОснования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеВРегламентированномУчетеНастройкиОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "ОтражениеВРегламентированномУчетеНастройкиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтражениеВРегламентированномУчетеНастройкиОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеВРегламентированномУчетеНастройкиОрганизаций"

	Дано Я открываю основную форму регистра сведений "ОтражениеВРегламентированномУчетеНастройкиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтражениеВРегламентированномУчетеНастройкиОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтражениеДокументовВУчетеСтраховыхВзносов" 

	Дано Я открываю основную форму списка регистра сведений "ОтражениеДокументовВУчетеСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтражениеДокументовВУчетеСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтражениеДокументовВУчетеСтраховыхВзносов"

	Дано Я открываю основную форму регистра сведений "ОтражениеДокументовВУчетеСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтражениеДокументовВУчетеСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОценкаПозицийШтатногоРасписанияПоКритериям" 

	Дано Я открываю основную форму списка регистра сведений "ОценкаПозицийШтатногоРасписанияПоКритериям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОценкаПозицийШтатногоРасписанияПоКритериям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОценкаПозицийШтатногоРасписанияПоКритериям"

	Дано Я открываю основную форму регистра сведений "ОценкаПозицийШтатногоРасписанияПоКритериям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОценкаПозицийШтатногоРасписанияПоКритериям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОценкиВариантовОтвета" 

	Дано Я открываю основную форму списка регистра сведений "ОценкиВариантовОтвета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОценкиВариантовОтвета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОценкиВариантовОтвета"

	Дано Я открываю основную форму регистра сведений "ОценкиВариантовОтвета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОценкиВариантовОтвета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОценкиОтветовНаВопросыАнкет" 

	Дано Я открываю основную форму списка регистра сведений "ОценкиОтветовНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОценкиОтветовНаВопросыАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОценкиОтветовНаВопросыАнкет"

	Дано Я открываю основную форму регистра сведений "ОценкиОтветовНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОценкиОтветовНаВопросыАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьИзвлеченияТекста" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИзвлеченияТекста"

	Дано Я открываю основную форму регистра сведений "ОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьСообщенийВ1СДокументооборот" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСообщенийВ1СДокументооборот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийВ1СДокументооборот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьСообщенийВ1СДокументооборот"

	Дано Я открываю основную форму регистра сведений "ОчередьСообщенийВ1СДокументооборот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийВ1СДокументооборот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыДляОтправки" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыДляОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыДляОтправки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыДляОтправки"

	Дано Я открываю основную форму регистра сведений "ПакетыДляОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыДляОтправки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыИнформацииПриЗапуске" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыИнформацииПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыИнформацииПриЗапуске"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыИнформацииПриЗапуске"

	Дано Я открываю основную форму регистра сведений "ПакетыИнформацииПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыИнформацииПриЗапуске"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыЛьготСотрудникамПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыЛьготСотрудникамПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыЛьготСотрудникамПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыЛьготСотрудникамПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "ПакетыЛьготСотрудникамПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыЛьготСотрудникамПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыОтчетности" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыОтчетности"

	Дано Я открываю основную форму регистра сведений "ПакетыОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица"

	Дано Я открываю основную форму регистра сведений "ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыЗапретаДоступаУволеннымСотрудникамИсключаемыеФизическиеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников"

	Дано Я открываю основную форму регистра сведений "ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыЗарегистрированныхДанныхУчетаВремениСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыОбменСБанками"

	Дано Я открываю основную форму регистра сведений "ПараметрыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыПериодовСтажаПФР" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыПериодовСтажаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыПериодовСтажаПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыПериодовСтажаПФР"

	Дано Я открываю основную форму регистра сведений "ПараметрыПериодовСтажаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыПериодовСтажаПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыПериодовСтажаПФРИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыПериодовСтажаПФРИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыПериодовСтажаПФРИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыПериодовСтажаПФРИспр"

	Дано Я открываю основную форму регистра сведений "ПараметрыПериодовСтажаПФРИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыПериодовСтажаПФРИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыРаботыВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыРаботыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыРаботыВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ПараметрыРаботыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыСозданияПользователейФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыСозданияПользователейФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыСозданияПользователейФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыСозданияПользователейФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ПараметрыСозданияПользователейФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыСозданияПользователейФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыСозданияПользователейФизическихЛицГруппыДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыСозданияПользователейФизическихЛицГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыСозданияПользователейФизическихЛицГруппыДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыСозданияПользователейФизическихЛицГруппыДоступа"

	Дано Я открываю основную форму регистра сведений "ПараметрыСозданияПользователейФизическихЛицГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыСозданияПользователейФизическихЛицГруппыДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерерасчетЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "ПерерасчетЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПерерасчетЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерерасчетЗарплаты"

	Дано Я открываю основную форму регистра сведений "ПерерасчетЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПерерасчетЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПерерасчетСреднегоЗаработка" 

	Дано Я открываю основную форму списка регистра сведений "ПерерасчетСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПерерасчетСреднегоЗаработка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерерасчетСреднегоЗаработка"

	Дано Я открываю основную форму регистра сведений "ПерерасчетСреднегоЗаработка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПерерасчетСреднегоЗаработка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодическиеСвойстваНовостей" 

	Дано Я открываю основную форму списка регистра сведений "ПериодическиеСвойстваНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодическиеСвойстваНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодическиеСвойстваНовостей"

	Дано Я открываю основную форму регистра сведений "ПериодическиеСвойстваНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодическиеСвойстваНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыБолезниУходаЗаДетьми" 

	Дано Я открываю основную форму списка регистра сведений "ПериодыБолезниУходаЗаДетьми"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыБолезниУходаЗаДетьми"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыБолезниУходаЗаДетьми"

	Дано Я открываю основную форму регистра сведений "ПериодыБолезниУходаЗаДетьми"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыБолезниУходаЗаДетьми"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыДействияДоговоровГражданскоПравовогоХарактера" 

	Дано Я открываю основную форму списка регистра сведений "ПериодыДействияДоговоровГражданскоПравовогоХарактера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыДействияДоговоровГражданскоПравовогоХарактера"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыДействияДоговоровГражданскоПравовогоХарактера"

	Дано Я открываю основную форму регистра сведений "ПериодыДействияДоговоровГражданскоПравовогоХарактера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыДействияДоговоровГражданскоПравовогоХарактера"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыСтажаПФР" 

	Дано Я открываю основную форму списка регистра сведений "ПериодыСтажаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыСтажаПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыСтажаПФР"

	Дано Я открываю основную форму регистра сведений "ПериодыСтажаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыСтажаПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПКУСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПКУСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПКУСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПКУСотрудников"

	Дано Я открываю основную форму регистра сведений "ПКУСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПКУСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланОбученияПоМероприятиям" 

	Дано Я открываю основную форму списка регистра сведений "ПланОбученияПоМероприятиям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПланОбученияПоМероприятиям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланОбученияПоМероприятиям"

	Дано Я открываю основную форму регистра сведений "ПланОбученияПоМероприятиям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПланОбученияПоМероприятиям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланОбученияСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПланОбученияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПланОбученияСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланОбученияСотрудников"

	Дано Я открываю основную форму регистра сведений "ПланОбученияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПланОбученияСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеАвансы" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеАвансы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеАвансы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеАвансы"

	Дано Я открываю основную форму регистра сведений "ПлановыеАвансы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеАвансы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеАвансыИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеАвансыИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеАвансыИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеАвансыИспр"

	Дано Я открываю основную форму регистра сведений "ПлановыеАвансыИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеАвансыИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеДатыСпециальнойОценкиУсловийТруда" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеДатыСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеДатыСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеДатыСпециальнойОценкиУсловийТруда"

	Дано Я открываю основную форму регистра сведений "ПлановыеДатыСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеДатыСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеЕжегодныеОтпуска" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеЕжегодныеОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеЕжегодныеОтпуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеЕжегодныеОтпуска"

	Дано Я открываю основную форму регистра сведений "ПлановыеЕжегодныеОтпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеЕжегодныеОтпуска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеНачисления" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеНачисления"

	Дано Я открываю основную форму регистра сведений "ПлановыеНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеНачисленияИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеНачисленияИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеНачисленияИспр"

	Дано Я открываю основную форму регистра сведений "ПлановыеНачисленияИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеНачисленияПоДоговорам" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеНачисленияПоДоговорам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияПоДоговорам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеНачисленияПоДоговорам"

	Дано Я открываю основную форму регистра сведений "ПлановыеНачисленияПоДоговорам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеНачисленияПоДоговорам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеУдержания" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеУдержания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеУдержания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеУдержания"

	Дано Я открываю основную форму регистра сведений "ПлановыеУдержания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеУдержания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыеУдержанияИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыеУдержанияИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеУдержанияИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыеУдержанияИспр"

	Дано Я открываю основную форму регистра сведений "ПлановыеУдержанияИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыеУдержанияИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлановыйФОТ" 

	Дано Я открываю основную форму списка регистра сведений "ПлановыйФОТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыйФОТ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлановыйФОТ"

	Дано Я открываю основную форму регистра сведений "ПлановыйФОТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлановыйФОТ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлатежныеДокументыПеречисленияЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "ПлатежныеДокументыПеречисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлатежныеДокументыПеречисленияЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлатежныеДокументыПеречисленияЗарплаты"

	Дано Я открываю основную форму регистра сведений "ПлатежныеДокументыПеречисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПлатежныеДокументыПеречисленияЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодпискиПолучателей" 

	Дано Я открываю основную форму списка регистра сведений "ПодпискиПолучателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодпискиПолучателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодпискиПолучателей"

	Дано Я открываю основную форму регистра сведений "ПодпискиПолучателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодпискиПолучателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодписываемыеВидыЭД" 

	Дано Я открываю основную форму списка регистра сведений "ПодписываемыеВидыЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодписываемыеВидыЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодписываемыеВидыЭД"

	Дано Я открываю основную форму регистра сведений "ПодписываемыеВидыЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодписываемыеВидыЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодчиненностьПодразделенийОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "ПодчиненностьПодразделенийОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодчиненностьПодразделенийОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодчиненностьПодразделенийОрганизаций"

	Дано Я открываю основную форму регистра сведений "ПодчиненностьПодразделенийОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодчиненностьПодразделенийОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоказателиСовокупнойТарифнойСтавкиСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПоказателиСовокупнойТарифнойСтавкиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоказателиСовокупнойТарифнойСтавкиСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоказателиСовокупнойТарифнойСтавкиСотрудников"

	Дано Я открываю основную форму регистра сведений "ПоказателиСовокупнойТарифнойСтавкиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоказателиСовокупнойТарифнойСтавкиСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоложенныеВидыЕжегодныхОтпусков" 

	Дано Я открываю основную форму списка регистра сведений "ПоложенныеВидыЕжегодныхОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоложенныеВидыЕжегодныхОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоложенныеВидыЕжегодныхОтпусков"

	Дано Я открываю основную форму регистра сведений "ПоложенныеВидыЕжегодныхОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоложенныеВидыЕжегодныхОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоложенныеВидыЕжегодныхОтпусковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПоложенныеВидыЕжегодныхОтпусковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоложенныеВидыЕжегодныхОтпусковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоложенныеВидыЕжегодныхОтпусковИспр"

	Дано Я открываю основную форму регистра сведений "ПоложенныеВидыЕжегодныхОтпусковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоложенныеВидыЕжегодныхОтпусковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПолучателиУдержаний" 

	Дано Я открываю основную форму списка регистра сведений "ПолучателиУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПолучателиУдержаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПолучателиУдержаний"

	Дано Я открываю основную форму регистра сведений "ПолучателиУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПолучателиУдержаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользователиУчетныхЗаписейДокументооборота" 

	Дано Я открываю основную форму списка регистра сведений "ПользователиУчетныхЗаписейДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользователиУчетныхЗаписейДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользователиУчетныхЗаписейДокументооборота"

	Дано Я открываю основную форму регистра сведений "ПользователиУчетныхЗаписейДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользователиУчетныхЗаписейДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ПользовательскиеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеМакетыПечати"

	Дано Я открываю основную форму регистра сведений "ПользовательскиеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеМакетыПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеНастройкиДоступаКОбработкам" 

	Дано Я открываю основную форму списка регистра сведений "ПользовательскиеНастройкиДоступаКОбработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеНастройкиДоступаКОбработкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеНастройкиДоступаКОбработкам"

	Дано Я открываю основную форму регистра сведений "ПользовательскиеНастройкиДоступаКОбработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеНастройкиДоступаКОбработкам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокВыплатыДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокВыплатыДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокВыплатыДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокВыплатыДокументов"

	Дано Я открываю основную форму регистра сведений "ПорядокВыплатыДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокВыплатыДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников"

	Дано Я открываю основную форму регистра сведений "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПорядокРасчетаСтоимостиЕдиницыВремениСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДанныеТребующиеОбработки" 

	Дано Я открываю основную форму списка регистра сведений "ПоставляемыеДанныеТребующиеОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеДанныеТребующиеОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеДанныеТребующиеОбработки"

	Дано Я открываю основную форму регистра сведений "ПоставляемыеДанныеТребующиеОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеДанныеТребующиеОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПотребностьВСпециалистахНаПериодМобилизации" 

	Дано Я открываю основную форму списка регистра сведений "ПотребностьВСпециалистахНаПериодМобилизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПотребностьВСпециалистахНаПериодМобилизации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПотребностьВСпециалистахНаПериодМобилизации"

	Дано Я открываю основную форму регистра сведений "ПотребностьВСпециалистахНаПериодМобилизации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПотребностьВСпециалистахНаПериодМобилизации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПраваРолей" 

	Дано Я открываю основную форму списка регистра сведений "ПраваРолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваРолей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПраваРолей"

	Дано Я открываю основную форму регистра сведений "ПраваРолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваРолей"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ПравилаОтправкиМакетовПенсионныхДел" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаОтправкиМакетовПенсионныхДел"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаОтправкиМакетовПенсионныхДел"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаОтправкиМакетовПенсионныхДел"

	Дано Я открываю основную форму регистра сведений "ПравилаОтправкиМакетовПенсионныхДел"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаОтправкиМакетовПенсионныхДел"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредельнаяВеличинаБазыСтраховыхВзносов" 

	Дано Я открываю основную форму списка регистра сведений "ПредельнаяВеличинаБазыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредельнаяВеличинаБазыСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредельнаяВеличинаБазыСтраховыхВзносов"

	Дано Я открываю основную форму регистра сведений "ПредельнаяВеличинаБазыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредельнаяВеличинаБазыСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредметыПапкиВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "ПредметыПапкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредметыПапкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредметыПапкиВзаимодействий"

	Дано Я открываю основную форму регистра сведений "ПредметыПапкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредметыПапкиВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ПредопределенныеВариантыОтчетовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредопределенныеВариантыОтчетовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетовВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ПредопределенныеВариантыОтчетовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредопределенныеВариантыОтчетовВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредоставлениеСоциальныхВычетовУРаботодателя" 

	Дано Я открываю основную форму списка регистра сведений "ПредоставлениеСоциальныхВычетовУРаботодателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредоставлениеСоциальныхВычетовУРаботодателя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредоставлениеСоциальныхВычетовУРаботодателя"

	Дано Я открываю основную форму регистра сведений "ПредоставлениеСоциальныхВычетовУРаботодателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредоставлениеСоциальныхВычетовУРаботодателя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредставленияОснованийУвольнения" 

	Дано Я открываю основную форму списка регистра сведений "ПредставленияОснованийУвольнения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредставленияОснованийУвольнения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредставленияОснованийУвольнения"

	Дано Я открываю основную форму регистра сведений "ПредставленияОснованийУвольнения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредставленияОснованийУвольнения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредставленияРабочихМест" 

	Дано Я открываю основную форму списка регистра сведений "ПредставленияРабочихМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредставленияРабочихМест"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредставленияРабочихМест"

	Дано Я открываю основную форму регистра сведений "ПредставленияРабочихМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредставленияРабочихМест"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПривязкаНовостейКМетаданным" 

	Дано Я открываю основную форму списка регистра сведений "ПривязкаНовостейКМетаданным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПривязкаНовостейКМетаданным"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПривязкаНовостейКМетаданным"

	Дано Я открываю основную форму регистра сведений "ПривязкаНовостейКМетаданным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПривязкаНовостейКМетаданным"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников"

	Дано Я открываю основную форму регистра сведений "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеПлановыхНачислений" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеПлановыхНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеПлановыхНачислений"

	Дано Я открываю основную форму регистра сведений "ПрименениеПлановыхНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеПлановыхНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеПлановыхНачисленийИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеПлановыхНачисленийИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеПлановыхНачисленийИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеПлановыхНачисленийИспр"

	Дано Я открываю основную форму регистра сведений "ПрименениеПлановыхНачисленийИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеПлановыхНачисленийИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"

	Дано Я открываю основную форму регистра сведений "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеСтандартныхВычетовПоНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеСтандартныхВычетовПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеСтандартныхВычетовПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеСтандартныхВычетовПоНДФЛ"

	Дано Я открываю основную форму регистра сведений "ПрименениеСтандартныхВычетовПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеСтандартныхВычетовПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименениеСтандартныхВычетовПоНДФЛИспр" 

	Дано Я открываю основную форму списка регистра сведений "ПрименениеСтандартныхВычетовПоНДФЛИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеСтандартныхВычетовПоНДФЛИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименениеСтандартныхВычетовПоНДФЛИспр"

	Дано Я открываю основную форму регистра сведений "ПрименениеСтандартныхВычетовПоНДФЛИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименениеСтандартныхВычетовПоНДФЛИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрименяемыеТарифыСтраховыхВзносов" 

	Дано Я открываю основную форму списка регистра сведений "ПрименяемыеТарифыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименяемыеТарифыСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрименяемыеТарифыСтраховыхВзносов"

	Дано Я открываю основную форму регистра сведений "ПрименяемыеТарифыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрименяемыеТарифыСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка регистра сведений "ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрисоединенныеФайлы"

	Дано Я открываю основную форму регистра сведений "ПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныИзмененияАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "ПричиныИзмененияАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПричиныИзмененияАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныИзмененияАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "ПричиныИзмененияАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПричиныИзмененияАдресныхСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПродолжительностьСеансаГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ПродолжительностьСеансаГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПродолжительностьСеансаГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПродолжительностьСеансаГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ПродолжительностьСеансаГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПродолжительностьСеансаГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПросмотренныеДанныеИнформационногоЦентра" 

	Дано Я открываю основную форму списка регистра сведений "ПросмотренныеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПросмотренныеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПросмотренныеДанныеИнформационногоЦентра"

	Дано Я открываю основную форму регистра сведений "ПросмотренныеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПросмотренныеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПротоколыОтправкиСообщенийОценкиПерсонала" 

	Дано Я открываю основную форму списка регистра сведений "ПротоколыОтправкиСообщенийОценкиПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПротоколыОтправкиСообщенийОценкиПерсонала"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПротоколыОтправкиСообщенийОценкиПерсонала"

	Дано Я открываю основную форму регистра сведений "ПротоколыОтправкиСообщенийОценкиПерсонала"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПротоколыОтправкиСообщенийОценкиПерсонала"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофессииФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ПрофессииФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрофессииФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофессииФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ПрофессииФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПрофессииФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроцентЕНВДДляУчетаЗатратНаЗарплату" 

	Дано Я открываю основную форму списка регистра сведений "ПроцентЕНВДДляУчетаЗатратНаЗарплату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцентЕНВДДляУчетаЗатратНаЗарплату"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцентЕНВДДляУчетаЗатратНаЗарплату"

	Дано Я открываю основную форму регистра сведений "ПроцентЕНВДДляУчетаЗатратНаЗарплату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцентЕНВДДляУчетаЗатратНаЗарплату"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроцентыСевернойНадбавкиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ПроцентыСевернойНадбавкиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцентыСевернойНадбавкиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцентыСевернойНадбавкиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ПроцентыСевернойНадбавкиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцентыСевернойНадбавкиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроцессыДляЗапуска" 

	Дано Я открываю основную форму списка регистра сведений "ПроцессыДляЗапуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцессыДляЗапуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцессыДляЗапуска"

	Дано Я открываю основную форму регистра сведений "ПроцессыДляЗапуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцессыДляЗапуска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПубликацияВакансий" 

	Дано Я открываю основную форму списка регистра сведений "ПубликацияВакансий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубликацияВакансий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПубликацияВакансий"

	Дано Я открываю основную форму регистра сведений "ПубликацияВакансий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубликацияВакансий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПубличныеИдентификаторыСинхронизируемыхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПубличныеИдентификаторыСинхронизируемыхОбъектов"

	Дано Я открываю основную форму регистра сведений "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux" 

	Дано Я открываю основную форму списка регистра сведений "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"

	Дано Я открываю основную форму регистра сведений "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаботаСКандидатами" 

	Дано Я открываю основную форму списка регистра сведений "РаботаСКандидатами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РаботаСКандидатами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаботаСКандидатами"

	Дано Я открываю основную форму регистра сведений "РаботаСКандидатами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РаботаСКандидатами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеКаталогиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "РабочиеКаталогиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеКаталогиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеКаталогиФайлов"

	Дано Я открываю основную форму регистра сведений "РабочиеКаталогиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеКаталогиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазмерВычетовНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "РазмерВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмерВычетовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазмерВычетовНДФЛ"

	Дано Я открываю основную форму регистра сведений "РазмерВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмерВычетовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазмерыГосударственныхПособий" 

	Дано Я открываю основную форму списка регистра сведений "РазмерыГосударственныхПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмерыГосударственныхПособий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазмерыГосударственныхПособий"

	Дано Я открываю основную форму регистра сведений "РазмерыГосударственныхПособий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазмерыГосударственныхПособий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенияНаИспользованиеВнешнихРесурсов" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенияНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"

	Дано Я открываю основную форму регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенныеДляРедактированияЛентыНовостей" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенныеДляРедактированияЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенныеДляРедактированияЛентыНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенныеДляРедактированияЛентыНовостей"

	Дано Я открываю основную форму регистра сведений "РазрешенныеДляРедактированияЛентыНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенныеДляРедактированияЛентыНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрядыКатегорииСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "РазрядыКатегорииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрядыКатегорииСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрядыКатегорииСотрудников"

	Дано Я открываю основную форму регистра сведений "РазрядыКатегорииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрядыКатегорииСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеПоТерриториямУсловиямТруда" 

	Дано Я открываю основную форму списка регистра сведений "РаспределениеПоТерриториямУсловиямТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РаспределениеПоТерриториямУсловиямТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеПоТерриториямУсловиямТруда"

	Дано Я открываю основную форму регистра сведений "РаспределениеПоТерриториямУсловиямТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РаспределениеПоТерриториямУсловиямТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассчитанныеОтборыПоНовостям_Общие" 

	Дано Я открываю основную форму списка регистра сведений "РассчитанныеОтборыПоНовостям_Общие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_Общие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассчитанныеОтборыПоНовостям_Общие"

	Дано Я открываю основную форму регистра сведений "РассчитанныеОтборыПоНовостям_Общие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_Общие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассчитанныеОтборыПоНовостям_Пользовательские" 

	Дано Я открываю основную форму списка регистра сведений "РассчитанныеОтборыПоНовостям_Пользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_Пользовательские"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассчитанныеОтборыПоНовостям_Пользовательские"

	Дано Я открываю основную форму регистра сведений "РассчитанныеОтборыПоНовостям_Пользовательские"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_Пользовательские"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся" 

	Дано Я открываю основную форму списка регистра сведений "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"

	Дано Я открываю основную форму регистра сведений "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассчитанныеОтборыПоНовостям_РедкоМеняющиеся"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасценкиРаботСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "РасценкиРаботСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасценкиРаботСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасценкиРаботСотрудников"

	Дано Я открываю основную форму регистра сведений "РасценкиРаботСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасценкиРаботСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетРезерваОтпусков" 

	Дано Я открываю основную форму списка регистра сведений "РасчетРезерваОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетРезерваОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетРезерваОтпусков"

	Дано Я открываю основную форму регистра сведений "РасчетРезерваОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РасчетРезерваОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрКадровыхПриказов" 

	Дано Я открываю основную форму списка регистра сведений "РеестрКадровыхПриказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрКадровыхПриказов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрКадровыхПриказов"

	Дано Я открываю основную форму регистра сведений "РеестрКадровыхПриказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрКадровыхПриказов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрКадровыхПриказовИспр" 

	Дано Я открываю основную форму списка регистра сведений "РеестрКадровыхПриказовИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрКадровыхПриказовИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрКадровыхПриказовИспр"

	Дано Я открываю основную форму регистра сведений "РеестрКадровыхПриказовИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрКадровыхПриказовИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрОтпусков" 

	Дано Я открываю основную форму списка регистра сведений "РеестрОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрОтпусков"

	Дано Я открываю основную форму регистра сведений "РеестрОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрОтпусковИспр" 

	Дано Я открываю основную форму списка регистра сведений "РеестрОтпусковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрОтпусковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрОтпусковИспр"

	Дано Я открываю основную форму регистра сведений "РеестрОтпусковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрОтпусковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РежимыПодключенияВнешнихМодулей" 

	Дано Я открываю основную форму списка регистра сведений "РежимыПодключенияВнешнихМодулей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РежимыПодключенияВнешнихМодулей"

	Дано Я открываю основную форму регистра сведений "РежимыПодключенияВнешнихМодулей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РежимыПодключенияВнешнихМодулейВМоделиСервиса" 

	Дано Я открываю основную форму списка регистра сведений "РежимыПодключенияВнешнихМодулейВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулейВМоделиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РежимыПодключенияВнешнихМодулейВМоделиСервиса"

	Дано Я открываю основную форму регистра сведений "РежимыПодключенияВнешнихМодулейВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулейВМоделиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РежимыПодключенияВнешнихМодулейОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "РежимыПодключенияВнешнихМодулейОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулейОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РежимыПодключенияВнешнихМодулейОбластейДанных"

	Дано Я открываю основную форму регистра сведений "РежимыПодключенияВнешнихМодулейОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулейОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезервныеКопииОблачногоАрхива" 

	Дано Я открываю основную форму списка регистра сведений "РезервныеКопииОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезервныеКопииОблачногоАрхива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезервныеКопииОблачногоАрхива"

	Дано Я открываю основную форму регистра сведений "РезервныеКопииОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезервныеКопииОблачногоАрхива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыАттестацийСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыАттестацийСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыАттестацийСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыАттестацийСотрудников"

	Дано Я открываю основную форму регистра сведений "РезультатыАттестацийСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыАттестацийСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыОбменаДанными"

	Дано Я открываю основную форму регистра сведений "РезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыОценкиВПроизвольнойФорме" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыОценкиВПроизвольнойФорме"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОценкиВПроизвольнойФорме"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыОценкиВПроизвольнойФорме"

	Дано Я открываю основную форму регистра сведений "РезультатыОценкиВПроизвольнойФорме"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОценкиВПроизвольнойФорме"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыОценкиРеспондентами" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыОценкиРеспондентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОценкиРеспондентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыОценкиРеспондентами"

	Дано Я открываю основную форму регистра сведений "РезультатыОценкиРеспондентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОценкиРеспондентами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыОценкиСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыОценкиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОценкиСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыОценкиСотрудников"

	Дано Я открываю основную форму регистра сведений "РезультатыОценкиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОценкиСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыСпециальнойОценкиУсловийТруда" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыСпециальнойОценкиУсловийТруда"

	Дано Я открываю основную форму регистра сведений "РезультатыСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РейтингАктивностиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "РейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РейтингАктивностиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "РейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеквизитыПлатежныхДокументовПеречисленияЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "РеквизитыПлатежныхДокументовПеречисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеквизитыПлатежныхДокументовПеречисленияЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеквизитыПлатежныхДокументовПеречисленияЗарплаты"

	Дано Я открываю основную форму регистра сведений "РеквизитыПлатежныхДокументовПеречисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеквизитыПлатежныхДокументовПеречисленияЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей" 

	Дано Я открываю основную форму списка регистра сведений "РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей"

	Дано Я открываю основную форму регистра сведений "РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РесурсыМеханизмаОнлайнСервисовРО" 

	Дано Я открываю основную форму списка регистра сведений "РесурсыМеханизмаОнлайнСервисовРО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РесурсыМеханизмаОнлайнСервисовРО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РесурсыМеханизмаОнлайнСервисовРО"

	Дано Я открываю основную форму регистра сведений "РесурсыМеханизмаОнлайнСервисовРО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РесурсыМеханизмаОнлайнСервисовРО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "РолиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РолиСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиСотрудников"

	Дано Я открываю основную форму регистра сведений "РолиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РолиСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "РолиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РолиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "РолиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РолиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияКонтрактаДоговораСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "СведенияКонтрактаДоговораСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияКонтрактаДоговораСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияКонтрактаДоговораСотрудника"

	Дано Я открываю основную форму регистра сведений "СведенияКонтрактаДоговораСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияКонтрактаДоговораСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияКонтрактаДоговораСотрудникаИспр" 

	Дано Я открываю основную форму списка регистра сведений "СведенияКонтрактаДоговораСотрудникаИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияКонтрактаДоговораСотрудникаИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияКонтрактаДоговораСотрудникаИспр"

	Дано Я открываю основную форму регистра сведений "СведенияКонтрактаДоговораСотрудникаИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияКонтрактаДоговораСотрудникаИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОбИнвалидностиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОбИнвалидностиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОбИнвалидностиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОбИнвалидностиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СведенияОбИнвалидностиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОбИнвалидностиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОбОтветственныхЛицах" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОбОтветственныхЛицах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОбОтветственныхЛицах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОбОтветственныхЛицах"

	Дано Я открываю основную форму регистра сведений "СведенияОбОтветственныхЛицах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОбОтветственныхЛицах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОВзносахВПФР" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОВзносахВПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВзносахВПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОВзносахВПФР"

	Дано Я открываю основную форму регистра сведений "СведенияОВзносахВПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВзносахВПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОВремениДляРасчетаСреднегоОбщий" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОВремениДляРасчетаСреднегоОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВремениДляРасчетаСреднегоОбщий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОВремениДляРасчетаСреднегоОбщий"

	Дано Я открываю основную форму регистра сведений "СведенияОВремениДляРасчетаСреднегоОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВремениДляРасчетаСреднегоОбщий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОВремениДляРасчетаСреднегоФCC" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОВремениДляРасчетаСреднегоФCC"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВремениДляРасчетаСреднегоФCC"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОВремениДляРасчетаСреднегоФCC"

	Дано Я открываю основную форму регистра сведений "СведенияОВремениДляРасчетаСреднегоФCC"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВремениДляРасчетаСреднегоФCC"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС"

	Дано Я открываю основную форму регистра сведений "СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"

	Дано Я открываю основную форму регистра сведений "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"

	Дано Я открываю основную форму регистра сведений "СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОПользователях" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОПользователях"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОПользователях"

	Дано Я открываю основную форму регистра сведений "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОПользователях"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОРежимахРаботыФормыСотрудника" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОРежимахРаботыФормыСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОРежимахРаботыФормыСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОРежимахРаботыФормыСотрудника"

	Дано Я открываю основную форму регистра сведений "СведенияОРежимахРаботыФормыСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОРежимахРаботыФормыСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОРежимахРаботыФормыСотрудникаРасширенный" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОРежимахРаботыФормыСотрудникаРасширенный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОРежимахРаботыФормыСотрудникаРасширенный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОРежимахРаботыФормыСотрудникаРасширенный"

	Дано Я открываю основную форму регистра сведений "СведенияОРежимахРаботыФормыСотрудникаРасширенный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОРежимахРаботыФормыСотрудникаРасширенный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОСертификатахОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОСертификатахОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОСертификатахОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОСертификатахОбменСБанками"

	Дано Я открываю основную форму регистра сведений "СведенияОСертификатахОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОСертификатахОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваЛокальныхКомпьютеровДляОблачногоАрхива" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваЛокальныхКомпьютеровДляОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваЛокальныхКомпьютеровДляОблачногоАрхива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваЛокальныхКомпьютеровДляОблачногоАрхива"

	Дано Я открываю основную форму регистра сведений "СвойстваЛокальныхКомпьютеровДляОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваЛокальныхКомпьютеровДляОблачногоАрхива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваТранспортныхСообщений" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваТранспортныхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваТранспортныхСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваТранспортныхСообщений"

	Дано Я открываю основную форму регистра сведений "СвойстваТранспортныхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваТранспортныхСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвойстваХранилищаОблачногоАрхива" 

	Дано Я открываю основную форму списка регистра сведений "СвойстваХранилищаОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваХранилищаОблачногоАрхива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвойстваХранилищаОблачногоАрхива"

	Дано Я открываю основную форму регистра сведений "СвойстваХранилищаОблачногоАрхива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвойстваХранилищаОблачногоАрхива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязанныеОбъектыЭлектронноеВзаимодействие" 

	Дано Я открываю основную форму списка регистра сведений "СвязанныеОбъектыЭлектронноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязанныеОбъектыЭлектронноеВзаимодействие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязанныеОбъектыЭлектронноеВзаимодействие"

	Дано Я открываю основную форму регистра сведений "СвязанныеОбъектыЭлектронноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязанныеОбъектыЭлектронноеВзаимодействие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СеансыВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "СеансыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СеансыВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СеансыВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "СеансыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СеансыВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СессииОбменаСообщениямиСистемы" 

	Дано Я открываю основную форму списка регистра сведений "СессииОбменаСообщениямиСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СессииОбменаСообщениямиСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СессииОбменаСообщениямиСистемы"

	Дано Я открываю основную форму регистра сведений "СессииОбменаСообщениямиСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СессииОбменаСообщениямиСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СклоненияПредставленийОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СклоненияПредставленийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СклоненияПредставленийОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СклоненияПредставленийОбъектов"

	Дано Я открываю основную форму регистра сведений "СклоненияПредставленийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СклоненияПредставленийОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СкрытыеРегламентированныеОтчеты" 

	Дано Я открываю основную форму списка регистра сведений "СкрытыеРегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СкрытыеРегламентированныеОтчеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкрытыеРегламентированныеОтчеты"

	Дано Я открываю основную форму регистра сведений "СкрытыеРегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СкрытыеРегламентированныеОтчеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СлужебныеАдресныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "СлужебныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СлужебныеАдресныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СлужебныеАдресныеСведения"

	Дано Я открываю основную форму регистра сведений "СлужебныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СлужебныеАдресныеСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СобытияКалендаряБухгалтера" 

	Дано Я открываю основную форму списка регистра сведений "СобытияКалендаряБухгалтера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СобытияКалендаряБухгалтера"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СобытияКалендаряБухгалтера"

	Дано Я открываю основную форму регистра сведений "СобытияКалендаряБухгалтера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СобытияКалендаряБухгалтера"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "СогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "СогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СодержимоеТранспортныхКонтейнеров" 

	Дано Я открываю основную форму списка регистра сведений "СодержимоеТранспортныхКонтейнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СодержимоеТранспортныхКонтейнеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СодержимоеТранспортныхКонтейнеров"

	Дано Я открываю основную форму регистра сведений "СодержимоеТранспортныхКонтейнеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СодержимоеТранспортныхКонтейнеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "СообщенияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбменаДанными"

	Дано Я открываю основную форму регистра сведений "СообщенияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияОбменаДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СообщенияОбменаДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбменаДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СообщенияОбменаДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДаннымиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствияОбъектовИнформационныхБаз" 

	Дано Я открываю основную форму списка регистра сведений "СоответствияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствияОбъектовИнформационныхБаз"

	Дано Я открываю основную форму регистра сведений "СоответствияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоставГруппСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "СоставГруппСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставГруппСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставГруппСотрудников"

	Дано Я открываю основную форму регистра сведений "СоставГруппСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставГруппСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоставыГруппПользователей" 

	Дано Я открываю основную форму списка регистра сведений "СоставыГруппПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставыГруппПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставыГруппПользователей"

	Дано Я открываю основную форму регистра сведений "СоставыГруппПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставыГруппПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияВакансий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияВакансий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияВакансий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияВакансий"

	Дано Я открываю основную форму регистра сведений "СостоянияВакансий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияВакансий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияВБракеФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияВБракеФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияВБракеФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияВБракеФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СостоянияВБракеФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияВБракеФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияДокументовЗачисленияЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияДокументовЗачисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияДокументовЗачисленияЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияДокументовЗачисленияЗарплаты"

	Дано Я открываю основную форму регистра сведений "СостоянияДокументовЗачисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияДокументовЗачисленияЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияДокументовОткрытияЛицевыхСчетов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияДокументовОткрытияЛицевыхСчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияДокументовОткрытияЛицевыхСчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияДокументовОткрытияЛицевыхСчетов"

	Дано Я открываю основную форму регистра сведений "СостоянияДокументовОткрытияЛицевыхСчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияДокументовОткрытияЛицевыхСчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияКонтактовВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияКонтактовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтактовВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияКонтактовВзаимодействий"

	Дано Я открываю основную форму регистра сведений "СостоянияКонтактовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтактовВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияНовостей" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияНовостей"

	Дано Я открываю основную форму регистра сведений "СостоянияНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменовДанными" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовДанными"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменовДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменСБанками"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПапокПисем" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПапокПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПапокПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПапокПисем"

	Дано Я открываю основную форму регистра сведений "СостоянияПапокПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПапокПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПодработок" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПодработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПодработок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПодработок"

	Дано Я открываю основную форму регистра сведений "СостоянияПодработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПодработок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПредметовВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПредметовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПредметовВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПредметовВзаимодействий"

	Дано Я открываю основную форму регистра сведений "СостоянияПредметовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПредметовВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияРассылокОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияРассылокОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияРассылокОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияРассылокОтчетов"

	Дано Я открываю основную форму регистра сведений "СостоянияРассылокОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияРассылокОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияСогласованияВДокументообороте" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияСогласованияВДокументообороте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСогласованияВДокументообороте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияСогласованияВДокументообороте"

	Дано Я открываю основную форму регистра сведений "СостоянияСогласованияВДокументообороте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСогласованияВДокументообороте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияСотрудников"

	Дано Я открываю основную форму регистра сведений "СостоянияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияУспешныхОбменовДанными" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияУспешныхОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияУспешныхОбменовДанными"

	Дано Я открываю основную форму регистра сведений "СостоянияУспешныхОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияУспешныхОбменовДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияУспешныхОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияУспешныхОбменовДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СостоянияУспешныхОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпециальностиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СпециальностиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СпециальностиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпециальностиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СпециальностиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СпециальностиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СреднемесячныеНормыВремениГрафиковРаботыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "СреднемесячныеНормыВремениГрафиковРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СреднемесячныеНормыВремениГрафиковРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СреднемесячныеНормыВремениГрафиковРаботыСотрудников"

	Дано Я открываю основную форму регистра сведений "СреднемесячныеНормыВремениГрафиковРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СреднемесячныеНормыВремениГрафиковРаботыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев" 

	Дано Я открываю основную форму списка регистра сведений "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"

	Дано Я открываю основную форму регистра сведений "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкаКомпенсацииЗаЗадержкуЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "СтавкаКомпенсацииЗаЗадержкуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкаКомпенсацииЗаЗадержкуЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкаКомпенсацииЗаЗадержкуЗарплаты"

	Дано Я открываю основную форму регистра сведений "СтавкаКомпенсацииЗаЗадержкуЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкаКомпенсацииЗаЗадержкуЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкаРефинансированияЦБ" 

	Дано Я открываю основную форму списка регистра сведений "СтавкаРефинансированияЦБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкаРефинансированияЦБ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкаРефинансированияЦБ"

	Дано Я открываю основную форму регистра сведений "СтавкаРефинансированияЦБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтавкаРефинансированияЦБ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтажиФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СтажиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтажиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтажиФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СтажиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтажиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтандартныеВычетыНаДетейНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "СтандартныеВычетыНаДетейНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыНаДетейНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтандартныеВычетыНаДетейНДФЛ"

	Дано Я открываю основную форму регистра сведений "СтандартныеВычетыНаДетейНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыНаДетейНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтандартныеВычетыФизическихЛицНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "СтандартныеВычетыФизическихЛицНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыФизическихЛицНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтандартныеВычетыФизическихЛицНДФЛ"

	Дано Я открываю основную форму регистра сведений "СтандартныеВычетыФизическихЛицНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыФизическихЛицНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтандартныеВычетыФизическихЛицНДФЛИспр" 

	Дано Я открываю основную форму списка регистра сведений "СтандартныеВычетыФизическихЛицНДФЛИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыФизическихЛицНДФЛИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтандартныеВычетыФизическихЛицНДФЛИспр"

	Дано Я открываю основную форму регистра сведений "СтандартныеВычетыФизическихЛицНДФЛИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтандартныеВычетыФизическихЛицНДФЛИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатистикаКонфигурации" 

	Дано Я открываю основную форму списка регистра сведений "СтатистикаКонфигурации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаКонфигурации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатистикаКонфигурации"

	Дано Я открываю основную форму регистра сведений "СтатистикаКонфигурации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаКонфигурации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусФизическихЛицКакНалогоплательщиковНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "СтатусФизическихЛицКакНалогоплательщиковНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусФизическихЛицКакНалогоплательщиковНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусФизическихЛицКакНалогоплательщиковНДФЛ"

	Дано Я открываю основную форму регистра сведений "СтатусФизическихЛицКакНалогоплательщиковНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусФизическихЛицКакНалогоплательщиковНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыЗастрахованныхФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыЗастрахованныхФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗастрахованныхФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыЗастрахованныхФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СтатусыЗастрахованныхФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыЗастрахованныхФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыОтправки" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОтправки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыОтправки"

	Дано Я открываю основную форму регистра сведений "СтатусыОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыОтправки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыСинхронизацииФайловСОблачнымСервисом" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыСинхронизацииФайловСОблачнымСервисом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСинхронизацииФайловСОблачнымСервисом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыСинхронизацииФайловСОблачнымСервисом"

	Дано Я открываю основную форму регистра сведений "СтатусыСинхронизацииФайловСОблачнымСервисом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСинхронизацииФайловСОблачнымСервисом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтраховыеВзносыСкидкиКДоходам" 

	Дано Я открываю основную форму списка регистра сведений "СтраховыеВзносыСкидкиКДоходам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтраховыеВзносыСкидкиКДоходам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтраховыеВзносыСкидкиКДоходам"

	Дано Я открываю основную форму регистра сведений "СтраховыеВзносыСкидкиКДоходам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтраховыеВзносыСкидкиКДоходам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы" 

	Дано Я открываю основную форму списка регистра сведений "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"

	Дано Я открываю основную форму регистра сведений "СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтрокиОтчетностиМониторингаРаботниковСоциальнойСферы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтроковыеСведенияФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СтроковыеСведенияФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтроковыеСведенияФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтроковыеСведенияФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СтроковыеСведенияФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтроковыеСведенияФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетчикиВыгрузок" 

	Дано Я открываю основную форму списка регистра сведений "СчетчикиВыгрузок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетчикиВыгрузок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетчикиВыгрузок"

	Дано Я открываю основную форму регистра сведений "СчетчикиВыгрузок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СчетчикиВыгрузок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТаблицыГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ТаблицыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаблицыГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаблицыГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ТаблицыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаблицыГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией" 

	Дано Я открываю основную форму списка регистра сведений "ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"

	Дано Я открываю основную форму регистра сведений "ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда" 

	Дано Я открываю основную форму списка регистра сведений "ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда"

	Дано Я открываю основную форму регистра сведений "ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТарифыСтраховыхВзносов" 

	Дано Я открываю основную форму списка регистра сведений "ТарифыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТарифыСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТарифыСтраховыхВзносов"

	Дано Я открываю основную форму регистра сведений "ТарифыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТарифыСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТекущаяТарифнаяСтавкаСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ТекущаяТарифнаяСтавкаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТекущаяТарифнаяСтавкаСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТекущаяТарифнаяСтавкаСотрудников"

	Дано Я открываю основную форму регистра сведений "ТекущаяТарифнаяСтавкаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТекущаяТарифнаяСтавкаСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТекущиеКадровыеДанныеСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ТекущиеКадровыеДанныеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТекущиеКадровыеДанныеСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТекущиеКадровыеДанныеСотрудников"

	Дано Я открываю основную форму регистра сведений "ТекущиеКадровыеДанныеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТекущиеКадровыеДанныеСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриториальныеУсловияПФР" 

	Дано Я открываю основную форму списка регистра сведений "ТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриториальныеУсловияПФР"

	Дано Я открываю основную форму регистра сведений "ТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриторииСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ТерриторииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриторииСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриторииСотрудников"

	Дано Я открываю основную форму регистра сведений "ТерриторииСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриторииСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриторииСотрудниковИспр" 

	Дано Я открываю основную форму списка регистра сведений "ТерриторииСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриторииСотрудниковИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриторииСотрудниковИспр"

	Дано Я открываю основную форму регистра сведений "ТерриторииСотрудниковИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТерриторииСотрудниковИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТикетыОбменСБанками" 

	Дано Я открываю основную форму списка регистра сведений "ТикетыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТикетыОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТикетыОбменСБанками"

	Дано Я открываю основную форму регистра сведений "ТикетыОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТикетыОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортныеКонтейнеры" 

	Дано Я открываю основную форму списка регистра сведений "ТранспортныеКонтейнеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТранспортныеКонтейнеры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортныеКонтейнеры"

	Дано Я открываю основную форму регистра сведений "ТранспортныеКонтейнеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТранспортныеКонтейнеры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТраншиЗаймаСотруднику" 

	Дано Я открываю основную форму списка регистра сведений "ТраншиЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТраншиЗаймаСотруднику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТраншиЗаймаСотруднику"

	Дано Я открываю основную форму регистра сведений "ТраншиЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТраншиЗаймаСотруднику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТрудоваяДеятельностьФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ТрудоваяДеятельностьФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТрудоваяДеятельностьФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТрудоваяДеятельностьФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ТрудоваяДеятельностьФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТрудоваяДеятельностьФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомленияОПрочтении" 

	Дано Я открываю основную форму списка регистра сведений "УведомленияОПрочтении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УведомленияОПрочтении"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомленияОПрочтении"

	Дано Я открываю основную форму регистра сведений "УведомленияОПрочтении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УведомленияОПрочтении"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Удалить_АктивныеПредметыВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "Удалить_АктивныеПредметыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Удалить_АктивныеПредметыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Удалить_АктивныеПредметыВзаимодействий"

	Дано Я открываю основную форму регистра сведений "Удалить_АктивныеПредметыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Удалить_АктивныеПредметыВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьАдресныйКлассификатор" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьАдресныйКлассификатор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьАдресныйКлассификатор"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьАдресныйКлассификатор"

	Дано Я открываю основную форму регистра сведений "УдалитьАдресныйКлассификатор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьАдресныйКлассификатор"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьБлокировкиСеансовОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьБлокировкиСеансовОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьБлокировкиСеансовОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьБлокировкиСеансовОбластиДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьБлокировкиСеансовОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьБлокировкиСеансовОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВерсииПодсистем" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВерсииПодсистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВерсииПодсистем"

	Дано Я открываю основную форму регистра сведений "УдалитьВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВерсииПодсистем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВложенияНеформализованныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьВложенияНеформализованныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВложенияНеформализованныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВложенияНеформализованныхДокументов"

	Дано Я открываю основную форму регистра сведений "УдалитьВложенияНеформализованныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВложенияНеформализованныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВоенкоматыОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьВоенкоматыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВоенкоматыОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВоенкоматыОрганизаций"

	Дано Я открываю основную форму регистра сведений "УдалитьВоенкоматыОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВоенкоматыОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВычетыПоДоходамНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьВычетыПоДоходамНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВычетыПоДоходамНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВычетыПоДоходамНДФЛ"

	Дано Я открываю основную форму регистра сведений "УдалитьВычетыПоДоходамНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВычетыПоДоходамНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьГосударственныеПособия" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьГосударственныеПособия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГосударственныеПособия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьГосударственныеПособия"

	Дано Я открываю основную форму регистра сведений "УдалитьГосударственныеПособия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГосударственныеПособия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьГруппыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГруппыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьГруппыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "УдалитьГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГруппыЗначенийДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьДанныеДляПодбораДоговорниковГПХ" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьДанныеДляПодбораДоговорниковГПХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьДанныеДляПодбораДоговорниковГПХ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьДанныеДляПодбораДоговорниковГПХ"

	Дано Я открываю основную форму регистра сведений "УдалитьДанныеДляПодбораДоговорниковГПХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьДанныеДляПодбораДоговорниковГПХ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьДанныеДляПодбораСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьДанныеДляПодбораСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьДанныеДляПодбораСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьДанныеДляПодбораСотрудников"

	Дано Я открываю основную форму регистра сведений "УдалитьДанныеДляПодбораСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьДанныеДляПодбораСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьДопустимыеСочетанияКодовГруппСтажа" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьДопустимыеСочетанияКодовГруппСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьДопустимыеСочетанияКодовГруппСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьДопустимыеСочетанияКодовГруппСтажа"

	Дано Я открываю основную форму регистра сведений "УдалитьДопустимыеСочетанияКодовГруппСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьДопустимыеСочетанияКодовГруппСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗамерыВремени" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗамерыВремени"

	Дано Я открываю основную форму регистра сведений "УдалитьЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗамерыВремени2" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗамерыВремени2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗамерыВремени2"

	Дано Я открываю основную форму регистра сведений "УдалитьЗамерыВремени2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗамерыВремениТехнологические" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремениТехнологические"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗамерыВремениТехнологические"

	Дано Я открываю основную форму регистра сведений "УдалитьЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремениТехнологические"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьИсключаемыеИзОстатковОтпусковПериоды" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьИсключаемыеИзОстатковОтпусковПериоды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьИсключаемыеИзОстатковОтпусковПериоды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьИсключаемыеИзОстатковОтпусковПериоды"

	Дано Я открываю основную форму регистра сведений "УдалитьИсключаемыеИзОстатковОтпусковПериоды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьИсключаемыеИзОстатковОтпусковПериоды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьИсторияИспользованияДолжностей" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьИсторияИспользованияДолжностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьИсторияИспользованияДолжностей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьИсторияИспользованияДолжностей"

	Дано Я открываю основную форму регистра сведений "УдалитьИсторияИспользованияДолжностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьИсторияИспользованияДолжностей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьИсторияИспользованияПодразделений" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьИсторияИспользованияПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьИсторияИспользованияПодразделений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьИсторияИспользованияПодразделений"

	Дано Я открываю основную форму регистра сведений "УдалитьИсторияИспользованияПодразделений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьИсторияИспользованияПодразделений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьИсторияНачисленийПоШтатномуРасписанию" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьИсторияНачисленийПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьИсторияНачисленийПоШтатномуРасписанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьИсторияНачисленийПоШтатномуРасписанию"

	Дано Я открываю основную форму регистра сведений "УдалитьИсторияНачисленийПоШтатномуРасписанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьИсторияНачисленийПоШтатномуРасписанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьКомплектыОтчетностиПерсучета" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьКомплектыОтчетностиПерсучета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьКомплектыОтчетностиПерсучета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьКомплектыОтчетностиПерсучета"

	Дано Я открываю основную форму регистра сведений "УдалитьКомплектыОтчетностиПерсучета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьКомплектыОтчетностиПерсучета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьМестоСотрудникаВСтруктуреПредприятия" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьМестоСотрудникаВСтруктуреПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьМестоСотрудникаВСтруктуреПредприятия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьМестоСотрудникаВСтруктуреПредприятия"

	Дано Я открываю основную форму регистра сведений "УдалитьМестоСотрудникаВСтруктуреПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьМестоСотрудникаВСтруктуреПредприятия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНаборыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНаборыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНаборыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "УдалитьНаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНаборыЗначенийДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНастройкиВерсионированияОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНастройкиВерсионированияОбъектов"

	Дано Я открываю основную форму регистра сведений "УдалитьНастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНастройкиОбменаФСС" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНастройкиОбменаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиОбменаФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНастройкиОбменаФСС"

	Дано Я открываю основную форму регистра сведений "УдалитьНастройкиОбменаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиОбменаФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНачальныеОстаткиОтпусков" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНачальныеОстаткиОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНачальныеОстаткиОтпусков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНачальныеОстаткиОтпусков"

	Дано Я открываю основную форму регистра сведений "УдалитьНачальныеОстаткиОтпусков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНачальныеОстаткиОтпусков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами"

	Дано Я открываю основную форму регистра сведений "УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОбластиДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОбластиКРезервномуКопированию" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОбластиКРезервномуКопированию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиКРезервномуКопированию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОбластиКРезервномуКопированию"

	Дано Я открываю основную форму регистра сведений "УдалитьОбластиКРезервномуКопированию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиКРезервномуКопированию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОбразованиеФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОбразованиеФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбразованиеФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОбразованиеФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "УдалитьОбразованиеФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбразованиеФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"

	Дано Я открываю основную форму регистра сведений "УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОтветыНаЗапросыИОН" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОтветыНаЗапросыИОН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОтветыНаЗапросыИОН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОтветыНаЗапросыИОН"

	Дано Я открываю основную форму регистра сведений "УдалитьОтветыНаЗапросыИОН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОтветыНаЗапросыИОН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОчередьЗаданий" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОчередьЗаданий"

	Дано Я открываю основную форму регистра сведений "УдалитьОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОчередьИзвлеченияТекста" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОчередьИзвлеченияТекста"

	Дано Я открываю основную форму регистра сведений "УдалитьОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПараметрыИнтернетПоддержкиПользователей" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПараметрыИнтернетПоддержкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПараметрыИнтернетПоддержкиПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПараметрыИнтернетПоддержкиПользователей"

	Дано Я открываю основную форму регистра сведений "УдалитьПараметрыИнтернетПоддержкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПараметрыИнтернетПоддержкиПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПраваПоЗначениямДоступа" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПраваПоЗначениямДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПраваПоЗначениямДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПраваПоЗначениямДоступа"

	Дано Я открываю основную форму регистра сведений "УдалитьПраваПоЗначениямДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПраваПоЗначениямДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПредельнаяВеличинаБазыСтраховыхВзносов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПредельнаяВеличинаБазыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПредельнаяВеличинаБазыСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПредельнаяВеличинаБазыСтраховыхВзносов"

	Дано Я открываю основную форму регистра сведений "УдалитьПредельнаяВеличинаБазыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПредельнаяВеличинаБазыСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРазмерВычетовНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьРазмерВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРазмерВычетовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРазмерВычетовНДФЛ"

	Дано Я открываю основную форму регистра сведений "УдалитьРазмерВычетовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРазмерВычетовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРейтингАктивностиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьРейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРейтингАктивностиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьРейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСведенияОВремениДляРасчетаСреднегоОбщий" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСведенияОВремениДляРасчетаСреднегоОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСведенияОВремениДляРасчетаСреднегоОбщий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСведенияОВремениДляРасчетаСреднегоОбщий"

	Дано Я открываю основную форму регистра сведений "УдалитьСведенияОВремениДляРасчетаСреднегоОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСведенияОВремениДляРасчетаСреднегоОбщий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"

	Дано Я открываю основную форму регистра сведений "УдалитьСведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"

	Дано Я открываю основную форму регистра сведений "УдалитьСведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСозданныеОбъектыНаОснованииОбучения" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСозданныеОбъектыНаОснованииОбучения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСозданныеОбъектыНаОснованииОбучения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСозданныеОбъектыНаОснованииОбучения"

	Дано Я открываю основную форму регистра сведений "УдалитьСозданныеОбъектыНаОснованииОбучения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСозданныеОбъектыНаОснованииОбучения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСоставыСемейФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСоставыСемейФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСоставыСемейФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСоставыСемейФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "УдалитьСоставыСемейФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСоставыСемейФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСостоянияДокументовЗачисленияЗарплаты" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСостоянияДокументовЗачисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСостоянияДокументовЗачисленияЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСостоянияДокументовЗачисленияЗарплаты"

	Дано Я открываю основную форму регистра сведений "УдалитьСостоянияДокументовЗачисленияЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСостоянияДокументовЗачисленияЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСреднемесячныеНормыВремениГрафиковРаботыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСреднемесячныеНормыВремениГрафиковРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСреднемесячныеНормыВремениГрафиковРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСреднемесячныеНормыВремениГрафиковРаботыСотрудников"

	Дано Я открываю основную форму регистра сведений "УдалитьСреднемесячныеНормыВремениГрафиковРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСреднемесячныеНормыВремениГрафиковРаботыСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСтандартныеВычетыНаДетейНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСтандартныеВычетыНаДетейНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтандартныеВычетыНаДетейНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСтандартныеВычетыНаДетейНДФЛ"

	Дано Я открываю основную форму регистра сведений "УдалитьСтандартныеВычетыНаДетейНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтандартныеВычетыНаДетейНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСтатусыЗастрахованныхФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСтатусыЗастрахованныхФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтатусыЗастрахованныхФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСтатусыЗастрахованныхФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "УдалитьСтатусыЗастрахованныхФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтатусыЗастрахованныхФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСтраныМира" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтраныМира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСтраныМира"

	Дано Я открываю основную форму регистра сведений "УдалитьСтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтраныМира"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСтраховыеВзносыСкидкиКДоходам" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСтраховыеВзносыСкидкиКДоходам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтраховыеВзносыСкидкиКДоходам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСтраховыеВзносыСкидкиКДоходам"

	Дано Я открываю основную форму регистра сведений "УдалитьСтраховыеВзносыСкидкиКДоходам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтраховыеВзносыСкидкиКДоходам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"

	Дано Я открываю основную форму регистра сведений "УдалитьТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьТарифыСтраховыхВзносов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьТарифыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьТарифыСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьТарифыСтраховыхВзносов"

	Дано Я открываю основную форму регистра сведений "УдалитьТарифыСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьТарифыСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов"

	Дано Я открываю основную форму регистра сведений "УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьФайлыСведенийРОКИ" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьФайлыСведенийРОКИ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФайлыСведенийРОКИ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьФайлыСведенийРОКИ"

	Дано Я открываю основную форму регистра сведений "УдалитьФайлыСведенийРОКИ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФайлыСведенийРОКИ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьФайлыСведенийСпецоператоры" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьФайлыСведенийСпецоператоры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФайлыСведенийСпецоператоры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьФайлыСведенийСпецоператоры"

	Дано Я открываю основную форму регистра сведений "УдалитьФайлыСведенийСпецоператоры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьФайлыСведенийСпецоператоры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"

	Дано Я открываю основную форму регистра сведений "УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УровниСокращенийАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "УровниСокращенийАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УровниСокращенийАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УровниСокращенийАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "УровниСокращенийАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УровниСокращенийАдресныхСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияДоговораГПХ" 

	Дано Я открываю основную форму списка регистра сведений "УсловияДоговораГПХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияДоговораГПХ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияДоговораГПХ"

	Дано Я открываю основную форму регистра сведений "УсловияДоговораГПХ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияДоговораГПХ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияДоговораЗаймаСотруднику" 

	Дано Я открываю основную форму списка регистра сведений "УсловияДоговораЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияДоговораЗаймаСотруднику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияДоговораЗаймаСотруднику"

	Дано Я открываю основную форму регистра сведений "УсловияДоговораЗаймаСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияДоговораЗаймаСотруднику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияОплатыОтпускаПоУходуЗаРебенком" 

	Дано Я открываю основную форму списка регистра сведений "УсловияОплатыОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияОплатыОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияОплатыОтпускаПоУходуЗаРебенком"

	Дано Я открываю основную форму регистра сведений "УсловияОплатыОтпускаПоУходуЗаРебенком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияОплатыОтпускаПоУходуЗаРебенком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияОплатыОтпускаПоУходуЗаРебенкомИспр" 

	Дано Я открываю основную форму списка регистра сведений "УсловияОплатыОтпускаПоУходуЗаРебенкомИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияОплатыОтпускаПоУходуЗаРебенкомИспр"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияОплатыОтпускаПоУходуЗаРебенкомИспр"

	Дано Я открываю основную форму регистра сведений "УсловияОплатыОтпускаПоУходуЗаРебенкомИспр"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияОплатыОтпускаПоУходуЗаРебенкомИспр"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияУдержанияПоИсполнительномуДокументу" 

	Дано Я открываю основную форму списка регистра сведений "УсловияУдержанияПоИсполнительномуДокументу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияУдержанияПоИсполнительномуДокументу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияУдержанияПоИсполнительномуДокументу"

	Дано Я открываю основную форму регистра сведений "УсловияУдержанияПоИсполнительномуДокументу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияУдержанияПоИсполнительномуДокументу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияУченическогоДоговора" 

	Дано Я открываю основную форму списка регистра сведений "УсловияУченическогоДоговора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияУченическогоДоговора"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияУченическогоДоговора"

	Дано Я открываю основную форму регистра сведений "УсловияУченическогоДоговора"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УсловияУченическогоДоговора"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УченыеЗванияФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "УченыеЗванияФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УченыеЗванияФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УченыеЗванияФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "УченыеЗванияФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УченыеЗванияФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УченыеСтепениФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "УченыеСтепениФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УченыеСтепениФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УченыеСтепениФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "УченыеСтепениФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УченыеСтепениФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетнаяПолитикаОрганизаций" 

	Дано Я открываю основную форму списка регистра сведений "УчетнаяПолитикаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетнаяПолитикаОрганизаций"

	Дано Я открываю основную форму регистра сведений "УчетнаяПолитикаОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетнаяПолитикаПоНДФЛ" 

	Дано Я открываю основную форму списка регистра сведений "УчетнаяПолитикаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаПоНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетнаяПолитикаПоНДФЛ"

	Дано Я открываю основную форму регистра сведений "УчетнаяПолитикаПоНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УчетнаяПолитикаПоНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФайлыВРабочемКаталоге" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыВРабочемКаталоге"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыВРабочемКаталоге"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыВРабочемКаталоге"

	Дано Я открываю основную форму регистра сведений "ФайлыВРабочемКаталоге"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыВРабочемКаталоге"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФайлыДокументовРеализацииПолномочийНалоговыхОрганов" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыДокументовРеализацииПолномочийНалоговыхОрганов"

	Дано Я открываю основную форму регистра сведений "ФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыДокументовРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФайлыСведенийРОКИ" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыСведенийРОКИ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыСведенийРОКИ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыСведенийРОКИ"

	Дано Я открываю основную форму регистра сведений "ФайлыСведенийРОКИ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыСведенийРОКИ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФайлыСведенийСпецоператоры" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыСведенийСпецоператоры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыСведенийСпецоператоры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыСведенийСпецоператоры"

	Дано Я открываю основную форму регистра сведений "ФайлыСведенийСпецоператоры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыСведенийСпецоператоры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФИОФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ФИОФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФИОФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФИОФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ФИОФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФИОФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФотографииФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ФотографииФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФотографииФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФотографииФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ФотографииФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФотографииФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХранилищеСертификатов" 

	Дано Я открываю основную форму списка регистра сведений "ХранилищеСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранилищеСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХранилищеСертификатов"

	Дано Я открываю основную форму регистра сведений "ХранилищеСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранилищеСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХранилищеСертификатовБРО" 

	Дано Я открываю основную форму списка регистра сведений "ХранилищеСертификатовБРО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранилищеСертификатовБРО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХранилищеСертификатовБРО"

	Дано Я открываю основную форму регистра сведений "ХранилищеСертификатовБРО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранилищеСертификатовБРО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"

	Дано Я открываю основную форму регистра сведений "ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХранимыеФайлыВерсий" 

	Дано Я открываю основную форму списка регистра сведений "ХранимыеФайлыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранимыеФайлыВерсий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХранимыеФайлыВерсий"

	Дано Я открываю основную форму регистра сведений "ХранимыеФайлыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ХранимыеФайлыВерсий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦепочкиДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ЦепочкиДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦепочкиДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦепочкиДокументов"

	Дано Я открываю основную форму регистра сведений "ЦепочкиДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦепочкиДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныПечатиМашиночитаемыхФорм" 

	Дано Я открываю основную форму списка регистра сведений "ШаблоныПечатиМашиночитаемыхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШаблоныПечатиМашиночитаемыхФорм"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныПечатиМашиночитаемыхФорм"

	Дано Я открываю основную форму регистра сведений "ШаблоныПечатиМашиночитаемыхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШаблоныПечатиМашиночитаемыхФорм"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныЭВФОтчетовСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ШаблоныЭВФОтчетовСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШаблоныЭВФОтчетовСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныЭВФОтчетовСтатистики"

	Дано Я открываю основную форму регистра сведений "ШаблоныЭВФОтчетовСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШаблоныЭВФОтчетовСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШкалаОценкиЦелевыхПоказателей" 

	Дано Я открываю основную форму списка регистра сведений "ШкалаОценкиЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШкалаОценкиЦелевыхПоказателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШкалаОценкиЦелевыхПоказателей"

	Дано Я открываю основную форму регистра сведений "ШкалаОценкиЦелевыхПоказателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШкалаОценкиЦелевыхПоказателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШкалаОценкиЭффективности" 

	Дано Я открываю основную форму списка регистра сведений "ШкалаОценкиЭффективности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШкалаОценкиЭффективности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШкалаОценкиЭффективности"

	Дано Я открываю основную форму регистра сведений "ШкалаОценкиЭффективности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ШкалаОценкиЭффективности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомплектыДокументов" 

	Дано Я открываю основную форму списка регистра сведений "КомплектыДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомплектыДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомплектыДокументов"

	Дано Я открываю основную форму регистра сведений "КомплектыДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомплектыДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Комментарии" 

	Дано Я открываю основную форму списка регистра сведений "Комментарии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Комментарии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Комментарии"

	Дано Я открываю основную форму регистра сведений "Комментарии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Комментарии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Экспертиза" 

	Дано Я открываю основную форму списка регистра сведений "Экспертиза"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Экспертиза"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Экспертиза"

	Дано Я открываю основную форму регистра сведений "Экспертиза"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Экспертиза"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НДФЛИгроковИстория" 

	Дано Я открываю основную форму списка регистра сведений "НДФЛИгроковИстория"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НДФЛИгроковИстория"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НДФЛИгроковИстория"

	Дано Я открываю основную форму регистра сведений "НДФЛИгроковИстория"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НДФЛИгроковИстория"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПризовойФондБестиражныхЛотерей" 

	Дано Я открываю основную форму списка регистра сведений "ПризовойФондБестиражныхЛотерей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПризовойФондБестиражныхЛотерей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПризовойФондБестиражныхЛотерей"

	Дано Я открываю основную форму регистра сведений "ПризовойФондБестиражныхЛотерей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПризовойФондБестиражныхЛотерей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыВыплатВоВненшнихСистемах" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыВыплатВоВненшнихСистемах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыВыплатВоВненшнихСистемах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыВыплатВоВненшнихСистемах"

	Дано Я открываю основную форму регистра сведений "СтатусыВыплатВоВненшнихСистемах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыВыплатВоВненшнихСистемах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеРеестровВыплат" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеРеестровВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеРеестровВыплат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеРеестровВыплат"

	Дано Я открываю основную форму регистра сведений "ДанныеРеестровВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеРеестровВыплат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтактыСИгроком" 

	Дано Я открываю основную форму списка регистра сведений "КонтактыСИгроком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыСИгроком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтактыСИгроком"

	Дано Я открываю основную форму регистра сведений "КонтактыСИгроком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыСИгроком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НепроданныеБилетыМЛСтатусы" 

	Дано Я открываю основную форму списка регистра сведений "НепроданныеБилетыМЛСтатусы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепроданныеБилетыМЛСтатусы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НепроданныеБилетыМЛСтатусы"

	Дано Я открываю основную форму регистра сведений "НепроданныеБилетыМЛСтатусы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепроданныеБилетыМЛСтатусы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НепроданныеБилетыМЛСообщения" 

	Дано Я открываю основную форму списка регистра сведений "НепроданныеБилетыМЛСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепроданныеБилетыМЛСообщения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НепроданныеБилетыМЛСообщения"

	Дано Я открываю основную форму регистра сведений "НепроданныеБилетыМЛСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепроданныеБилетыМЛСообщения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БилетыПараметры" 

	Дано Я открываю основную форму списка регистра сведений "БилетыПараметры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БилетыПараметры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БилетыПараметры"

	Дано Я открываю основную форму регистра сведений "БилетыПараметры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БилетыПараметры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГрафикиВыплатСведения" 

	Дано Я открываю основную форму списка регистра сведений "ГрафикиВыплатСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикиВыплатСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикиВыплатСведения"

	Дано Я открываю основную форму регистра сведений "ГрафикиВыплатСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГрафикиВыплатСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛогЗапросовВнешнихСистем" 

	Дано Я открываю основную форму списка регистра сведений "ЛогЗапросовВнешнихСистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЛогЗапросовВнешнихСистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛогЗапросовВнешнихСистем"

	Дано Я открываю основную форму регистра сведений "ЛогЗапросовВнешнихСистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЛогЗапросовВнешнихСистем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьСообщенийОбменаСОфлайнОборудованием" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьСообщенийОбменаСОфлайнОборудованием"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийОбменаСОфлайнОборудованием"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьСообщенийОбменаСОфлайнОборудованием"

	Дано Я открываю основную форму регистра сведений "ОчередьСообщенийОбменаСОфлайнОборудованием"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьСообщенийОбменаСОфлайнОборудованием"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НумерацияЧековККТ" 

	Дано Я открываю основную форму списка регистра сведений "НумерацияЧековККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НумерацияЧековККТ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НумерацияЧековККТ"

	Дано Я открываю основную форму регистра сведений "НумерацияЧековККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НумерацияЧековККТ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекиПараметры" 

	Дано Я открываю основную форму списка регистра сведений "ЧекиПараметры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЧекиПараметры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекиПараметры"

	Дано Я открываю основную форму регистра сведений "ЧекиПараметры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЧекиПараметры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыБилетовМикролот" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыБилетовМикролот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыБилетовМикролот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыБилетовМикролот"

	Дано Я открываю основную форму регистра сведений "ПараметрыБилетовМикролот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыБилетовМикролот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРотацииДанных" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиРотацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРотацииДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРотацииДанных"

	Дано Я открываю основную форму регистра сведений "НастройкиРотацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиРотацииДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассылкаОповещенийЭП" 

	Дано Я открываю основную форму списка регистра сведений "РассылкаОповещенийЭП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассылкаОповещенийЭП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассылкаОповещенийЭП"

	Дано Я открываю основную форму регистра сведений "РассылкаОповещенийЭП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РассылкаОповещенийЭП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатаЗагрузкиОтчетовКассЭвотор" 

	Дано Я открываю основную форму списка регистра сведений "ДатаЗагрузкиОтчетовКассЭвотор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатаЗагрузкиОтчетовКассЭвотор"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатаЗагрузкиОтчетовКассЭвотор"

	Дано Я открываю основную форму регистра сведений "ДатаЗагрузкиОтчетовКассЭвотор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатаЗагрузкиОтчетовКассЭвотор"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФискальныеОперации" 

	Дано Я открываю основную форму списка регистра сведений "ФискальныеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФискальныеОперации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФискальныеОперации"

	Дано Я открываю основную форму регистра сведений "ФискальныеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФискальныеОперации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыигрышПоКатегориям" 

	Дано Я открываю основную форму списка регистра сведений "ВыигрышПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыигрышПоКатегориям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыигрышПоКатегориям"

	Дано Я открываю основную форму регистра сведений "ВыигрышПоКатегориям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыигрышПоКатегориям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыдачаВещевогоВыигрыша" 

	Дано Я открываю основную форму списка регистра сведений "ВыдачаВещевогоВыигрыша"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыдачаВещевогоВыигрыша"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыдачаВещевогоВыигрыша"

	Дано Я открываю основную форму регистра сведений "ВыдачаВещевогоВыигрыша"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыдачаВещевогоВыигрыша"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияИзмененияДанныхПоПричастностиКПДЛ" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияИзмененияДанныхПоПричастностиКПДЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияИзмененияДанныхПоПричастностиКПДЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияИзмененияДанныхПоПричастностиКПДЛ"

	Дано Я открываю основную форму регистра сведений "ИсторияИзмененияДанныхПоПричастностиКПДЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияИзмененияДанныхПоПричастностиКПДЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеСвойстваИгроков" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеСвойстваИгроков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСвойстваИгроков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеСвойстваИгроков"

	Дано Я открываю основную форму регистра сведений "ДополнительныеСвойстваИгроков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСвойстваИгроков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыплатыБилетовПоТиражамДляОтложенныхВыплат" 

	Дано Я открываю основную форму списка регистра сведений "ВыплатыБилетовПоТиражамДляОтложенныхВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыплатыБилетовПоТиражамДляОтложенныхВыплат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатыБилетовПоТиражамДляОтложенныхВыплат"

	Дано Я открываю основную форму регистра сведений "ВыплатыБилетовПоТиражамДляОтложенныхВыплат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыплатыБилетовПоТиражамДляОтложенныхВыплат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФиксацияВыигрышей" 

	Дано Я открываю основную форму списка регистра сведений "ФиксацияВыигрышей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФиксацияВыигрышей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФиксацияВыигрышей"

	Дано Я открываю основную форму регистра сведений "ФиксацияВыигрышей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФиксацияВыигрышей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОВыигрышеБилетаПоТиражам" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОВыигрышеБилетаПоТиражам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВыигрышеБилетаПоТиражам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОВыигрышеБилетаПоТиражам"

	Дано Я открываю основную форму регистра сведений "СведенияОВыигрышеБилетаПоТиражам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОВыигрышеБилетаПоТиражам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроверкаДокументовПоГражданству" 

	Дано Я открываю основную форму списка регистра сведений "ПроверкаДокументовПоГражданству"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроверкаДокументовПоГражданству"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроверкаДокументовПоГражданству"

	Дано Я открываю основную форму регистра сведений "ПроверкаДокументовПоГражданству"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроверкаДокументовПоГражданству"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеТекстыПечатныхФорм" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеТекстыПечатныхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеТекстыПечатныхФорм"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеТекстыПечатныхФорм"

	Дано Я открываю основную форму регистра сведений "ДополнительныеТекстыПечатныхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеТекстыПечатныхФорм"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрЗаблокированныхБилетов" 

	Дано Я открываю основную форму списка регистра сведений "РеестрЗаблокированныхБилетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрЗаблокированныхБилетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрЗаблокированныхБилетов"

	Дано Я открываю основную форму регистра сведений "РеестрЗаблокированныхБилетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РеестрЗаблокированныхБилетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛогВзаимодействийССервисами" 

	Дано Я открываю основную форму списка регистра сведений "ЛогВзаимодействийССервисами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЛогВзаимодействийССервисами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛогВзаимодействийССервисами"

	Дано Я открываю основную форму регистра сведений "ЛогВзаимодействийССервисами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЛогВзаимодействийССервисами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписокПолучателейРассылок" 

	Дано Я открываю основную форму списка регистра сведений "СписокПолучателейРассылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СписокПолучателейРассылок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписокПолучателейРассылок"

	Дано Я открываю основную форму регистра сведений "СписокПолучателейРассылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СписокПолучателейРассылок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыплатыПодлежащиеОбязательномуКонтролю" 

	Дано Я открываю основную форму списка регистра сведений "ВыплатыПодлежащиеОбязательномуКонтролю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыплатыПодлежащиеОбязательномуКонтролю"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыплатыПодлежащиеОбязательномуКонтролю"

	Дано Я открываю основную форму регистра сведений "ВыплатыПодлежащиеОбязательномуКонтролю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВыплатыПодлежащиеОбязательномуКонтролю"
	И Я закрываю текущее окно

