#language: ru

@tree

Функционал: <2. Общий прогон АРМ Выплат>

Сценарий: Открытие клиента тестирования для выплат
И я подключаю TestClient "Клиент для выплат" логин "Администратор" пароль ""
И Я закрываю все окна клиентского приложения

Сценарий: <Общий прогон>
И В командном интерфейсе я выбираю 'АРМ' 'АРМ выплат'
Когда открылось окно 'АРМ выплат'
И из выпадающего списка с именем "Игрок" я выбираю по строке 'Участник Для Автотестов Не Трогать Руками'
И я перехожу к следующему реквизиту
Когда открылось окно 'АРМ выплат'

Когда открылось окно 'АРМ выплат'
И я перехожу к закладке с именем "БлокДанныеОБилете"
И я перехожу к закладке с именем "БлокКомплектДоков"
И в таблице "СоставКомплектаДокументов" я активизирую поле с именем "СоставКомплектаДокументовЕстьДокумент"
И в таблице "СоставКомплектаДокументов" я снимаю флаг с именем 'СоставКомплектаДокументовЕстьДокумент'
И в таблице "СоставКомплектаДокументов" я завершаю редактирование строки

И в таблице "СоставКомплектаДокументов" я снимаю флаг с именем 'СоставКомплектаДокументовЕстьДокумент'
И в таблице "СоставКомплектаДокументов" я завершаю редактирование строки
И я перехожу к закладке с именем "БлокФискальныеЧекиПоЗаявке"
И я перехожу к закладке с именем "БлокДанныеОБилете"
И я перехожу к закладке с именем "БлокКомплектДоков"
И я перехожу к закладке с именем "СтраницаЭкспертиза"
И я меняю значение переключателя с именем 'ТипЭкспертизы' на 'Бестиражные'
И я меняю значение переключателя с именем 'ТипЭкспертизы' на 'Все'
И я перехожу к закладке с именем "Э_БлокОжидание"
И в таблице "СписокДатДокументовЭкспертизыОжидание" я активизирую поле с именем "СписокДатДокументовЭкспертизыДата"
И в таблице "СписокДокументовЭкспертизыОжидание" я разворачиваю текущую строку
И я перехожу к закладке с именем "Э_БлокАрхив"
И в таблице "СписокДокументовЭкспертизыАрхив" я активизирую поле с именем "СписокДокументовЭкспертизы1Игра"
И в таблице "СписокДатДокументовЭкспертизыАрхив" я активизирую поле с именем "СписокДатДокументовЭкспертизы1Дата"
И я перехожу к закладке с именем "СтраницаВыплаты"
И в таблице "НезарегистрированныеБилеты" я нажимаю на кнопку с именем 'НезарегистрированныеБилетыПроверитьИдентификациюИгроков'
И в таблице "НезарегистрированныеБилеты" я активизирую поле с именем "НезарегистрированныеБилетыСтатусРегистрации"
И я перехожу к закладке с именем "БлокГрафикиВыплат"
И я перехожу к закладке с именем "БлокВРаботе"
И я перехожу к закладке с именем "БлокРеестрыВыплат"
И я перехожу к закладке с именем "БлокЗаявкиНаВыплату"
И я перехожу к закладке с именем "БлокФискальныеЧеки"
И я меняю значение переключателя с именем 'ТипЧека' на 'Безнал'
И я меняю значение переключателя с именем 'ТипЧека' на 'Все'
И я перехожу к закладке с именем "БлокВыдачаВещевогоВыигрыша"
И я перехожу к закладке с именем "СтраницаКонтактыСИгроком"
И я нажимаю на кнопку с именем 'ОтменитьОтбор'
И в таблице "КонтактыСИгроком" я активизирую поле с именем "КонтактыСИгрокомИгрок"
И я перехожу к закладке с именем "СтраницаККМ"
И я перехожу к закладке с именем "СтраницаКонтрагенты"
И я перехожу к закладке с именем "БлокДанныеОБилете"
И в таблице "Билеты" я нажимаю на кнопку с именем 'БилетыОтчетОВыплате'
Тогда открылось окно 'Отчет о выплате'
И Я закрываю окно 'Отчет о выплате'
Тогда открылось окно 'АРМ выплат'
И в таблице "Билеты" я нажимаю на кнопку с именем 'БилетыТестОпределениеНомераБилета'
И в таблице "Билеты" я нажимаю на кнопку с именем 'БилетыУстановитьВоВсехСтрокахВидОплаты'
Тогда открылось окно 'Установка вида оплаты'
И Я закрываю окно 'Установка вида оплаты'


И Я закрываю все окна клиентского приложения

И я закрываю сеанс текущего клиента тестирования